{
  "glossary": "<h2>Acknowledgement</h2>\n<p>Dieses Werk wurde übersetzt von André Greubel im Rahmen des Verbundprojektes ComeMINT. ComeMINT wird im Rahmen der BMBF-Förderlinie &bdquo;Kompetenzzentrum für digitales und digital gestütztes Unterrichten in Schule und Weiterbildung im MINT-Bereich&ldquo; durch das Programm der Europäischen Union &bdquo;NextGenerationEU&ldquo; unter dem Förderkennzeichen <em>01JA23M06A-N</em> gefördert.</p>\n<h2>Glossar</h2>\n<p>Naurs Werk wurde zu einer Zeit verfasst, in dem viele der heute üblichen Begriffe für informatische Konzepte noch nicht etabliert waren. Insbesondere an Stellen, an denen Naur versucht, eigene (dänische) Begriffe zu etablieren oder sich von anderen Begriffen abzugrenzen, ist die Übersetzung daher nicht einfach. Insbesondere muss an einiger Stelle entschieden werden, ob ein Begriff auf sein modernes Pendant zurückgeführt werden soll, oder ein heute unüblicher Begriff benutzt wird. In diesem Glossar bieten wir einen Überblick über die wichtigsten Übersetzungsentscheidungen.</p>\n<h3>regnemaskiner, analogimaskine</h3>\n<p>Mechanische Maschinen zur Berechnung von Zahlen (wie sie in Kapitel 1.2 beschrieben werden) werden im dänischen Original als <em>regnemaskiner</em> (Rechenmaschinen) bezeichnet. Diese wörtliche Übersetzung wurde beibehalten.</p>\n<p>Der erste dänische Computer besaß den Eigennamen <em>analogimaskine</em> (Analogmaschine). Der Eigenname wurde in Kap. 1.6 wörtlich eingedeutscht.</p>\n<h3>data</h3>\n<p>Der Begriff <em>data</em> (Daten) wird im Buch explizit eingeführt: &bdquo;Jede beliebige Darstellung von Tatsachen oder Ideen auf eine formalisierte Art und Weise, die durch irgendeinen Prozess kommuniziert oder manipuliert werden kann&ldquo;. Der Begriff wurde wörtlich übersetzt und wird von Naur auch analog zum modernen Begriff verwendet.</p>\n<p>Die Wort-für-Wort-Übersetzung des dänischen Textes lautet wie folgt: enhver (jede beliebige) repræsentation (Darstellung) af (von) fakta (Tatsachen) eller (oder) ideer (Ideen) på (auf) en (eine) formaliseret (formalisierte) måde (Art), som (die) kan (kann) kommunikeres (kommuniziert werden) eller (oder) manipuleres (manipuliert werden) ved (durch) en eller anden (wörtl. &bdquo;einen oder anderen&ldquo;, dänische Phrase für &bdquo;irgendeinen&ldquo;) proces (Prozess)</p>\n<p>Die Übersetzung &bdquo;Jede beliebige formalisierte Darstellung...&ldquo; wäre im deutschen idiomatischer, wurde aber in dieser Übersetzung nicht gewählt, da diese die Satzstruktur verändert und Naur an einigen Stellen einzelne Teile diese Definition analysiert und dies in der Übersetzung ansonsten nicht gleichermaßen hätte dargestellt werden können. Mit dieser Wahl enthält die Definition weder im dänischen noch im deutschen im ersten Teil einen Hinweis auf die Notwendigkeit der formalisierten Darstellung.</p>\n<h3>datamodel, dataprocesser</h3>\n<p>Der Begriff <em>datamodel</em> (Datenmodell) wird von Naur benutzt, um ein Modell zu bezeichnen, das aus Daten in einem Datenautomaten. besteht. Naur führt diesen Begriff über Vergleiche mit existierenden Modellen in den Naturwissenschaften ein (2.2) und benutzt ihn konsequent für eine statische (darstellende) Sicht auf Daten. Der Begriff wurde wörtlich als Datenmodell übersetzt.</p>\n<p>Der Begriff <em>dataprocesser</em> (Datenprozesse) wird von Naur benutzt, um einen Prozess zu bezeichnen, der Daten verarbeitet. Naur führt diesen Begriff über Vergleiche mit Prozessen in der Industrie (Kap 2.3) und benutzt ihn konsequent für eine dynamische (verarbeitende) Sicht auf Daten. Der Begriff wurde wörtlich als Datenprozesse übersetzt.</p>\n<h3>Oplysning, Information</h3>\n<p>Der Begriff <em>oplysning</em> entstammt aus der Alltagssprache und bedeutet so viel wie Auskunft, Beleuchtung, oder Aufklärung. Naur benutzt den Begriff als Kontrast zu data, um Tatsachen oder Ideen zu bezeichnen, die eben nicht formalisiert dargestellt sind.</p>\n<p>Im Text ergibt das Begriffspaar data und oplysning damit einen Kontrast, der dem heutigen deutschen Begriffspaar Daten und Information gleicht. Aus diesem Grund wurde oplysning im Text auch als Information übersetzt, falls es sich auf die nicht formalisierte Darstellung von Tatsachen oder ideen bezieht.</p>\n<p>Erwähnenswert ist, dass der Begriff oplysning in der heutigen Fachsprache &ndash; analog zum nähesten deutschen Wort Auskunft &ndash; unpassend wäre und sich auch im heutigen Dänisch das Wort <em>information</em> (Information) durchgesetzt hat.</p>\n<h3>Datamaskine, Datamat, datamatisk</h3>\n<p>Naur möchte in seiner Begriffswahl die zuvor existierenden Maschinen mit einem festen Einsatzzweck von den wesentlich flexibleren und gesellschaftlich relevanteren programmierbaren general-purpose Maschinen abgrenzen. Deren wichtigste Eigenschaft ist, dass die Steuerung dieser Maschine durch Daten innerhalb der Maschine selbst geschieht.</p>\n<p>Naur spricht daher zunächst kurz von der titelgebenden <em>Datamaskine</em> (wörtlich Datenmaschine), welches wörtlich übersetzt wurde. Er sagt jedoch schnell, dass er den Bergiff <em>Datamat</em> vorzieht. Hierbei handelt es sich um ein Kunstwort aus <em>data</em> (Daten) und automat (Automat). Dieses Wort wurde im Deutschen nahe des ursprünglichen Kunstwortes als Datenautomat übersetzt.</p>\n<p>Die Übersetzung beider Begriffe als Computer wurde abgelehnt, weil es zu weit von der Sprachwahl Naurs gewesen wäre. Eine Verkürzung zu Datmat oder Datenmat wurde abgelehnt, weil es sich im Gegensatz zum dänischen Original eher schwer lesen lässt.</p>\n<p>Der Begriff <em>datamatisk</em> ist die Adjektivform zu datamat. Eine wörtliche Übersetzung wäre datenautomatisch. Dieser Begriff ist im deutschen jedoch sperrig und insb. ist es schwierig, im schriftlichen hier zwischem dem intendierten datenautomat-isch und dem ebenfalls lesbaren daten-automatisch zu unterscheiden.</p>\n<p>Aus diesem Grund wurde der Begriff sinngemäß als datenautomatbasiert (z.B. datamatisk proces als datenautomatenbasierter Prozess) bzw. datenautomatenkundig (z.B. datamatisk menneske als datenautomatenkundiger Mensch) übersetzt.</p>\n<h3>Datalogi</h3>\n<p>Naur stellt in diesem Buch fest, dass die automatische Verarbeitung von Daten einerseits hinreichend unterschiedlich von etablierten Wissenschaften ist &ndash; Naur studierte Astronomie und arbeitete später unter anderem am mathematischen Institut an der Universität Cambridge &ndash; und anderseits unabhängig von der Ingenieurskunst bei der Entwicklung konkreter Maschinen gedacht werden muss. Er sprach daher, als einer der ersten, von einem eigenen Wissenschaftsbereich der &bdquo;Lehre über Daten und Datenverarbeitung&ldquo;, welchen er selbst <em>Datalogi</em> nannte.</p>\n<p>Tatsächlich wurde Naur 4 Jahre nach Erscheinen des Buches als Professor für Datalogie an die Universität Kopenhagen berufen und gründete somit die erste dänische Forschungseinrichtung in der Informatik.</p>\n<p>Eine relevanter Aspekt der Übersetzung war, ob das Wort  aufgrund dieser historischen Bedeutung und der Relevanz im Text wörtlich als Datalogie übersetzt wird &ndash; oder mit dem heutigen Pendant Informatik (welcher sich mittlerweile, gegen den Willen Naurs, auch in Dänemark durchgesetzt hat). Die aktuelle Version des Textes enthält Vorschläge für die historische Variante in <span class=\"textcolor textcolor-blue\">blau</span> und einem modernen Pendant in <span class=\"textcolor textcolor-orange\">orange</span>. Die <span class=\"alt-term\">alte / neue</span> Variante ist wie in dieser Zeile zu sehen gesetzt.</p>\n<p>Wichtig ist, dass die Bezeichnung Computerwissenschaft (oder engl. computer science) direkt Naurs Intentionen widersprochen hätte, da sie den Fokus zu sehr auf die die Maschinen selbst legt.</p>\n<h3>datamatik, databehandling</h3>\n<p>Vereinzelt benutzt Naur, ohne einführende oder weitere Erläuterungen, auch die Begriff <em>datamatik</em> (abgeleitet vom Begriff Datamat bzw. datamatisk) und databehandling (Datenbehandlung). Unklar bleibt, warum Naur insgesamt sechs Mal diese &ndash; damals ebenfalls nicht etablierten &ndash; Begriffe benutzt, statt auf andere und häufig benutzte Begriffe zurückzugreifen. Zwei Übersetzungen sind denkbar: wahlweise als mit dem in diesem Kontext gut passenden Begriff der Datenverarbeitung &ndash; oder allgemeiner mit dem Begriff informatisch. In der aktuellen Version sind beide Varianten angegeben.</p>\n<h3>komplikationer</h3>\n<p>Der Begriff <em>komplikationer</em> (Komplikation) beschreibt im Text eine komplexe Operation auf Daten, die vorsichtig erstellt werden muss. Der Begriff wurde etwas freier als Funktion übersetzt, ist aber im Original ein gutes Stück näher am Begriff Funktionsweise, als am modernen &ndash; durch Funktionen in Hochsprachen geprägten &ndash; Funktionsbegriff.</p>\n<h3>datalagring</h3>\n<p>Der Begriff <em>datalagring</em> heißt wörtlich übersetzt Datenlagerung. Naurs Nutzung des Begriff im Kontext der Informatik war damals neu und erklärungswürdig, da mit dem Begriff eher Industriehallen als Computersysteme verknüpft waren. Naur war es jedoch primär wichtig (vgl. Kapitel 3), einen Begriff im dänischen zu finden der weniger psychologisierend ist als zum Beispiel der Begriff hukommelse (Erinnerung, im Sinne eines menschlichen Gedächtnisvorgangs).</p>\n<p>Der Begriff wurde im deutschen der besseren Lesbarkeit wegen nicht mit Datenlagerung, sondern mit dem deutschen Pendant Datenspeicherung übersetzt. Der deutsche Begriff speichern bzw. der englische Begriff save im Rahmen von Computersystemen hat in der dänischen Fachsprache kein direktes sprachliches Pendant &ndash; stattdessen ist es auch heute noch üblich, die Begriffe lagre (lagern) und gemme (aufbewahren) weitgehend synonym für diese Vorgänge zu verwenden.</p>\n<h3>dannelse, uddannelse, efterdannelse</h3>\n<p>Die Begriffe <em>dannelse</em> (Bildung), <em>uddannelse</em> (Aus-Bildung), und <em>efterdannelse</em> (Nach-Bildung) entsprechen etmylogisch sehr direkt den Begriffen Bildung, Ausbildung und (beruflicher) Weiterbildung und wurden als solche übersetzt.</p>\n<p>Das Begriffstrio wird im Buch jedoch nicht mit der Präzision benutzt, wie ein deutscher Bildungswissenschaftler die Begriffe benutzen würde. Dies liegt einerseits an feinen sprachlichen Unterschieden. Diese wurden im Rahmen der Übersetzung so weit wie möglich behoben. So wurde z.B. in Kapitel 6.8 das dänische uddannelsessystem zum deutschen Bildungssystem (auch wenn es etmylogisch Ausbildungssystem heißt).</p>\n<p>Darüber hinaus benutzt Naur die Begriffe als Fachwissenschaftler nicht mit sehr hoher Präzision. So beklagt er zum Beispiel in Kapitel 6.8 den Mangel an Ausbildungsmöglichkeiten. Im Kontext wird jedoch klar, dass es hier nicht primär um Ausbildungsplätze der beruflichen Ausbildung geht &ndash; sondern allgemein schulische und universitäre Bildung, als auch berufliche Aus- und Weiterbildungen etc. gemeint sind.</p>\n<h3>privatlivets fred</h3>\n<p>Die Phrase <em>privatlivets fred</em> bedeutet wörtlich übersetzt Privatlebens Freiheit und wurde mit dem heutigen Konzept der Privatsphäre übersetzt.</p>\n<h3>Anmerkung zur Übersetzung: Fußnote Seite 12/55</h3>\n<p>Das Prinzip, das Programm zur Lösung einer Aufgabe im gewöhnlichen internen Speicher des Datenautomaten zu speichern, sollte nach dem, was Maurice Wilkes 1967 in seiner ACM \"Turing Lecture\" angibt, richtigerweise Eckert und Mauchly, den Vätern der ersten elektronischen Rechenmaschine, zugeschrieben werden.</p>\n<p>Rechner für Wechselkurse: Dänemark (ab 1960): https://www.worlddata.info/europe/denmark/inflation-rates.php // https://www.dst.dk/en/Statistik/laer-om-statistik/prisberegner; Schweden (ab 1920): https://www.scb.se/hitta-statistik/sverige-i-siffror/prisomraknaren/;Norwegen https://www.ssb.no/en/kalkulatorer/priskalkulator</p>",
  "entries": [
    {
      "type": "section",
      "danish": [
        "Datamaskinernes Historie fra Pascal til Nutiden"
      ],
      "german": [
        "Die Geschichte der Datenmaschinen von Pascal bis Heute"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Det mål jeg har sat mig for denne og de følgende forelæsninger om datamaskinerne og samfundet er at forklare hvorfor datamaskinerne, eller som jeg hellere vil kalde dem, datamaterne, har fået så stor samfundsmæssig betydning, og hvorfor denne betydning må forventes at vokse i endnu ganske uoverskuelig grad.",
        "Denne betydning må betragtes som et kendt faktum, som iøvrigt let kan underbygges med konkrete tal, der for eksempel angiver væksten i antallet af datamater og dem der arbejder med dem, og i de kapitaler der er bundet i dem. Oplysninger af denne art vil jeg give hvor de passer i sammenhængen iøvrigt.",
        "Der er ingen grund til at undre sig over at drøftelsen af disse tings betydning vil kræve adskillige forelæsninger. Foreteelser der som datamaterne griber dybt ind i samfundet er ikke betinget af en enkelt idé, en enkelt opfindelse, eller et isoleret problem i samfundet. De fremkommer ved et samspil af mange omstændigheder, både principielle muligheder, bestemte tekniske opfindelser, og en mangfoldighed af samfundsmæssige, deriblandt økonomiske, forhold. I forelæsningerne vil jeg prøve at belyse alle disse forskellige sider af sagen.",
        "Til en begyndelse vil jeg i dag skitsere noget af den historiske baggrund for den øjeblikkelige situation, i særdeleshed den udvikling af de tekniske opfindelser som fører frem til nutidens elektroniske datamaskiner eller datamater."
      ],
      "german": [
        "Das Ziel, das ich mir für diese und die folgenden Vorlesungen über Datenmaschinen und die Gesellschaft gesetzt habe, ist zu erklären, warum Datenmaschinen, oder <em>Datenautomaten</em> wie ich sie lieber nennen möchte, eine so große gesellschaftliche Bedeutung erlangt haben, und warum man erwarten darf, dass diese Bedeutung noch weiter in einem noch ganz unvorhesehbaren Ausmaß wachsen wird.",
        "Diese Bedeutung muss als bekannte Tatsache betrachtet werden, die sich im Übrigen auch einfach mit konkreten Zahlen belegen lässt, wie zum Beispiel dem Wachstum der Anzahl der Datenautomaten und derer, die mit ihnen arbeiten, sowie dem Kapital das in ihnen gebunden ist. Auskünfte dieser Art werde ich dort angeben, wo sie in den umgebenden Zusammenhang passen.",
        "Es gibt keinen Grund sich darüber zu wundern, dass die Diskussion über die Bedeutung dieser Dinge mehrere Vorlesungen erfordern wird. Erscheinungen die, wie die Datenautomaten, tief in die Gesellschaft eingreifen, sind nicht durch eine einzelne Idee, eine einzige Erfindung oder ein isoliertes Problem in der Gesellschaft bedingt. Sie kommen aus einem Zusammenspiel vieler Umstände hervor: sowohl prinzipiellen Möglichkeiten, bestimmten technischer Erfindungen, als auch einer Vielfalt gesellschaftlicher, darunter auch wirtschaftlicher, Umstände. In diesen Vorlesungen will ich versuchen, all diese verschiedenen Seiten zu beleuchten.",
        "Heute will ich als Anfang einige historische Hintergründe zur aktuellen Situation skizzieren, insbesondere die Entwicklung von den technischen Erfindungen, die bis zu den heutigen elektronischen Datenmaschinen oder Datenautomaten geführt haben."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Pascal og Leibniz i 1600-tallet"
      ],
      "german": [
        "Pascal und Leibnitz im 17. Jahrhundert"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Den tidlige udvikling af datamater kan ikke skelnes fra udviklingen af mekaniske og automatiske apparater til at udføre regninger. Denne udvikling går tilbage til 1642 da Blaise Pascal, den store franske matematiker og filosof, byggede en maskine der kunne lægge sammen og trække fra. Det næste skridt fulgte tredive år senere, i 1671, da den tyske matematiker og filosof Gottfried Wilhelm Leibniz konstruerede en multiplikationsmaskine.",
        "Disse opfindelser var forløbere for en række andre opfindelser af maskiner, der ved hjælp af tandhjul og andre mekanismer kan udføre regninger. Efterhånden som den almindelige fabrikationsteknik blev forfinet er en række forskellige maskiner af denne art blevet almindeligt kendt fra utallige anvendelser."
      ],
      "german": [
        "Die frühe Entwicklung von Datenautomaten kann nicht von der Entwicklung mechanischer und automatischer Apparate zur Durchführung von Rechnungen getrennt werden. Diese Entwicklung geht auf das Jahr 1642 zurück, als Blaise Pascal, der große französische Mathematiker und Philosoph, eine Maschine baute, die addieren und subtrahieren konnte. Der nächste Schritt folgte dreißig Jahre später, im Jahr 1671, als der deutsche Mathematiker und Philosoph Gottfried Wilhelm Leibniz eine Multiplikationsmaschine konstruierte.",
        "Diese Erfindungen waren die Vorläufer einer Reihe anderer Erfindungen von Maschinen, die mithilfe von Zahnrädern und anderen Mechanismen Rechnungen ausführen können. Nach und nach, als die allgemeinen Fertigungstechniken verbessert wurden, wurden eine Reihe verschiedener Maschinen dieser Art allmählich aus unzähligen Anwendungen bekannt."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Charles Babbage — hundrede år forud for sin tid"
      ],
      "german": [
        "Charles Babbage — hundert Jahre seiner Zeit voraus"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Fra Leibniz er der et spring på halvandet hundrede år til den næste afgørende udvikling. Den er knyttet til navnet Charles Babbage, og er et ekstremt eksempel på ideer der er forud for deres tid. Charles Babbage var englænder, levede fra 1792 til 1871, og var hele livet optaget af matematiske og tekniske ideer og opfindelser. Omkring 1820 udtænkte han en såkaldt differensmaskine, en regnemaskine der var særlig egnet til at beregne tabeller som de bruges i astronomien og til navigation. Det lykkedes ham at opnå støtte fra den engelske regering og arbejdet med at konstruere maskinen blev sat i gang. Før den var fuldendt fik Babbage dog nye ideer til en langt mere ambitiøs konstruktion, den analytiske maskine. Samtidig viste det sig mere tidsrøvende og kostbart end forudset at konstruere differensmaskinen, og en stor del af de sidste halvtreds år af sit liv tilbragte Babbage med at slås for sine ideer, uden at det lykkedes ham at bringe sine projekter til fuldendelse. I sin egen tid gik Babbage for at være fantast, i dag er det klart at han mere end 100 år før tiden havde indset de muligheder der er realiseret i de moderne datamater.",
        "Det næste vigtige skridt i udviklingen af mekanisk regning var den praktiske brug af hulkort til at repræsentere tal. Denne ide har rødder helt tilbage til 1725 da den franske væver Bouchon fandt på at bruge en papirrulle med huller til at styre trådene under vævningen. Denne idé blev en af forløberne for den berømte Jacquard væv fra 1808. Til trods for at Babbage allerede omkring 1825 var fuldt klar over hulkortenes muligheder ved regninger, blev denne tanke først virkeliggjort omkring 1880 af Hollerith. Efter dette tidspunkt har alle højt udviklede regnemaskiner gjort brug af huller i papir, hvad enten papiret har haft form af kort eller strimler."
      ],
      "german": [
        "Es gibt einen Sprung von etwa huntertfünfzig Jahren von Leibniz bis zur nächsten maßgeblichen Entwicklung. Diese ist mit dem verbunden Namen Charles Babbage und sie ist ein extremes Beispiel für Ideen, die ihrer Zeit voraus sind. Charles Babbage war ein Engländer, lebte von 1792 bis 1871 und beschäftigte sich sein ganzes Leben lang mit mathematischen und technischen Ideen und Erfindungen. Etwa 1820 erfand er eine sogenannte Differenzmaschine, eine Rechenmaschine, die besonders geeignet war zum Berechnen von Tabellen, wie sie in der Astronomie und zur Navigation gebraucht wurden. Es ist ihm geglückt, die Unterstützung der englischen Regierung zu erhalten und die Arbeiten zur Konstruktion der Maschine wurden in Gang gesetzt. Bevor diese vollständig fertig wurde, bekam Babbage jedoch neue Ideen für eine weitaus ehrgeizigere Konstruktion, die analytische Maschine. Gleichzeitig zeigte es sich als zeitaufwändiger und teurer als erwartet, die Differenzmaschine zu konstruieren, und einen großen Teil seiner letzten fünzig Lebensjahre verbrachte Babbage damit, für seine Ideen zu kämpfen, ohne dass es ihm geglückt ist, seine Projekte zur Vollendung zu bringen. In seiner Zeit galt Babbage als Fantasist, heute ist klar dass er mehr als 100 Jahre vor der Zeit die Möglichkeiten moderner Datenautomaten erkannte.",
        "Der nächste wichtige Schritt in der Entwicklung der mechanischen Rechnung war der praktische Einsatz von Lochkarten zur Darstellung von Zahlen. Die Wurzeln dieser Idee reichen zurück bis 1725, als der französische Weber Bouchon die Verwendung einer Papierrolle mit Löchern erfand, um die Fäden beim Weben zu führen. Diese Idee wurde zu einem der Vorläufer des berühmten Jacquard-Webstuhls von 1808. Obwohl Babbage bereits etwa 1825 volle Klarheit über die Möglichkeiten von Lochkarten beim Rechnen hatte, wurde dieser Gedanke zuerst etwa 1880 durch Hollerith verwirklicht. Ab diesem Zeitpunkt haben alle hoch entwickelten Rechenmaschinen von Löchern im Papier Gebrauch gemacht, egal ob das Papier die Form von Karten oder Streifen hatte."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "De elektromekaniske giganters æra"
      ],
      "german": [
        "Die Zeit der elektromechanischen Giganten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Herefter skal vi helt frem til 1930-erne før der igen for alvor sker et spring i udviklingen. Fra omkring 1936 opstår der mellem hænderne på en tysk ingeniør, Konrad Zuse, en række indviklede, automatiske regnemaskiner. De første var rent mekaniske, men allerede fra omkring 1941 overtager elektriciteten de fleste funktioner. Den tredie af disse maskiner, Zuse Z3 fra 1941, kan betragtes som den første funktioneringsdygtige maskine, der realiserer Babbage's ideer, omend med andre midler end forudset i 1822.",
        "Omtrent samtidig opstår lignende maskiner ved Harvard universitetet og ved Bell Telephone Laboratorierne i U.S.A. Ved Harvard begyndte Howard Aiken i 1937 et samarbejde med firmaet IBM om udvikling af en stor regnemaskine. Maskinen var færdig i 1944 og efterfulgtes de følgende år af yderligere tre store maskiner. Ved Bell Telephone Laboratorierne skabte blandt andre George Stibitz fra 1939 til 1946 seks forskellige komplicerede og ydedygtige maskiner. Alle de nævnte maskiner var opbygget af mekaniske og elektromekaniske dele, tandhjul, vippearme, og elektromekaniske relæer, og deres historiske betydning var at de gjorde det klart at det var muligt og værdifuldt at bygge komplicerede regnemaskiner."
      ],
      "german": [
        "Hiernach müssen wir bis in die 1930er Jahre gehen, bevor es erneut zu einem ernsthaften Sprung in der Entwicklung kommt. Ab etwa 1936 entstand durch den deutschen Ingenieur Konrad Zuse eine Reihe komplizierter, automatischer Rechenmaschinen. Die erste war rein mechanisch, doch bereits ab etwa 1941 übernahm die Elektrizität die meisten Funktionen. Die dritte dieser Maschinen, die Zuse Z3 von 1941, kann als die erste funktionsfähige Maschine betrachtet werden, die Babbages Ideen verwirklichte &ndash; wenn auch mit anderen Mitteln als 1822 vorgesehen.",
        "Etwa zur gleichen Zeit tauchen ähnliche Geräte an der Harvard University und in den Bell Telephone Laboratories in den USA auf. In Harvard begann Howard Aiken 1937 eine Zusammenarbeit mit der Firma IBM zur Entwicklung einer großen Rechenmaschine. Die Maschine wurde 1944 fertiggestellt und in den folgenden Jahren folgten drei weitere große Maschinen. In den Bell Telephone Laboratories entwickelte unter anderem George Stibitz von 1939 bis 1946 sechs verschiedene komplizierte und leistungsstarke Maschinen. Alle genannten Maschinen bestanden aus mechanischen und elektromechanischen Teilen, Zahnrädern, Kipphebeln und elektromechanischen Relais und ihre historische Bedeutung bestand darin, dass sie deutlich machten, dass es möglich und wertvoll war, komplizierte Rechenmaschinen zu bauen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Elektroner og programlagring"
      ],
      "german": [
        "Elektronen und Programmspeicherung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Det næste skridt blev taget da Mauchly og Eckert ved University of Pennsylvania i Philadelphia i årene 1944 til 1946 udviklede den første regnemaskine der benytter elektronrør til at realisere de indre funktioner. Herved opnåede man en forøgelse i regnehastighed fra nogle få regneoperationer pr. sekund til flere tusinde.",
        "Hermed var vejen banet for et skridt der er ejendommeligt derved, at det på en vis måde kun er en gevinst i bekvemmelighed ved brugen af maskinerne, og dog må betegnes som den vigtigste principielle opfindelse på dette område siden Babbage's idé til den analytiske maskine. Denne udvikling skyldes matematikerne John Von Neumann og Herman Goldstine fra Princeton universitetet i U.S.A. <sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup> og ideen går ud på at de oplysninger der kræves til at styre maskinens funktioner under løsningen af en opgave, inde i maskinen opbevares på samme måde som de talværdier der bearbejdes. Ideen indebærer at maskinen opbygges omkring et centralt lager for oplysninger, som altså både rummer tal der er ved at blive bearbejdet og instruktioner for maskinens arbejde.",
        "Dette nye princip for opbygningen af maskiner satte skel mellem alle tidligere maskiner og de fleste senere. Ikke sådan at forstå at de nyere maskiner egentlig kan gøre andet end de ældre, men mere ved den flexibilitet de nye maskiner fik, den lethed hvormed de kan omstilles fra at løse én opgave til en anden. Dette fik konsekvenser langt ud over hvad man umiddelbart kunne vente, og har blandt andet fået os til at indse at disse maskiner slet ikke udelukkende, eller blot overvejende, bør betragtes som regnemaskiner, men at de som vi senere skal omtale nærmere er maskiner til at manipulere data af enhver art. Det er også baggrunden for at vi der arbejder med maskinerne, i dag er tilbøjelige til at føle betegnelsen »elektronisk regnemaskine« som vildledende. Jeg vil derfor i det følgende for de maskiner, der er bygget på princippet at gemme data og procesinstruktioner i det samme indre lager, benytte betegnelsen »datamat«.",
        "Von Neumann og Goldstine's ideer vandt meget hurtigt forståelse langt ud over verden. Det primære problem blev nu at udvikle teknisk set gode løsninger for det centrale element i datamaterne, lageret for data. I denne henseende blev England i nogle år igen førende. Faktisk var den første egentlige datamat der kunne arbejde tilfredsstillende den såkaldte Edsac, konstrueret af Wilkes og Renwick i Cambridge, og funktioneringsdygtig fra 1949. I Edsac bestod lageret af kviksølvfyldte rør, hvorigennem der cirkulerede lydimpulser svarende til tal og instruktioner. Snart efter fulgte Williams i Manchester med en datamat der byggede på et af ham selv udviklet lagerprincip, det såkaldte Williamsrør.",
        "Indtil dette tidspunkt var alle datamater enestående konstruktioner, udviklet af en institution, oftest et universitet, til sit eget brug, eller til levering efter kontrakt til en bestemt kunde. Omkring 1950 bliver en stor datamat for første gang tilbudt på det åbne marked. Det var Remington Rand som mødte med maskinen Univac. Firmaet havde til at udvikle denne maskine sikret sig fædrene til den første elektroniske regnemaskine, Eckert og Mauchly. Den første kunde blev det amerikanske folketællingsbureau, men snart efter fulgte et stort forsikringsselskab. Det er vanskeligt at sætte sig ind i den tankegang der dengang dominerede, selv hos kyndige der havde udviklingen nært inde på livet. Så sent som på dette tidspunkt udtalte en kendt ekspert at man næppe kunne vente at der ville blive bygget mere end måske en snes datamater ved universiteter verden over. Hermed, mente man, ville behovet for beregninger være dækket.",
        "Det skulle gå anderledes. I løbet af få år blev det klart at datamaternes værdi ingenlunde er begrænset til matematiske eller videnskabelige opgaver, men er langt bredere, og i særdeleshed omfatter en fylde af administrative opgaver, i første omgang regnskabsføring af enhver art. Efter nogle års tøven kastede IBM, der hidtil havde koncentreret sig om de simplere hulkortmaskiner og skrivemaskiner, sig ud i konstruktionen af store datamater, hvor de hurtigt blev dominerende på markedet. I løbet af 1950'erne blev konstruktionen af datamater til en storindustri, præget af hård konkurrence. Ikke få firmaer på dette felt er bukket under eller har måttet eliminere deres aktiviteter efter store tab. — Dette har dog ikke kunnet bremse udbredelsen af datamaterne; alene i U.S.A. var der i 1965 mere end 32.000 anlæg, hver til en gennemsnitsværdi af et par millioner kroner."
      ],
      "german": [
        "Der nächste Schritt erfolgte, als Mauchly und Eckert von der University of Pennsylvania in Philadelphia in den Jahren 1944 bis 1946 die erste Rechenmaschine entwickelten, die Elektronenröhren zur Realisierung der internen Funktionen nutzte. Hierdurch erreichte man eine Zunahme der Rechengeschwindigkeit von wenigen Rechenvorgängen pro Sekunde zu mehreren Tausenden.",
        "Hiermit wurde der Weg für einen Schritt geebnet, der dadurch eigenartig ist, weil er auf eine gewisse Art und Weise nur einen Gewinn in der Bequemlichkeit beim Umgang mit den Maschinen darstellt, und dennoch darf man dies als die wichtigste prinzipielle Erfindung auf diesem Gebiet seit Babbages Idee für die Analysemaschine bezeichnen. Diese Entwicklung ist den Mathematikern John Von Neumann und Herman Goldstine von der Princeton Universität in den USA zu verdanken <sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup>, und die Ideen läuft darauf hinaus, die Anweisungen die zur Steuerung der Maschinenfunktionen beim Lösen einer Aufgabe benötigt werden werden, in der Maschine selbst aufzubewahren - zusammen mit den Zahlenwerten die verarbeitet werden. Die Idee hat zur Folge, dass die Maschine um einen zentralen Informationsspeicher herum aufgebaut ist, der somit sowohl zu verarbeitende Zahlen als auch Anweisungen für die Arbeit der Maschine enthält.",
        "Dieses neue Prinzip für den Aufbau von Maschinen ist ein zentraler Unterschied zwischen allen früheren Maschinen und den später folgenden. Nicht in dem Sinne, dass die neueren Maschinen tatsächlich andere Dinge tun können als die älteren, sondern vielmehr in dem Sinne, wie flexibel die neuen Maschinen waren und wie einfach sie von einer Aufgabe auf eine andere umgestellt werden konnten. Dies führte zu Konsequenzen, die weit über das hinausgingen, was man sofort erwarten konnte, und hat uns unter anderem Einsicht gegeben, dass diese Maschinen gar nicht ausschließlich oder auch überwiegend als Rechenmaschine betrachtet werden sollten. Stattdessen sind diese Maschinen, wie wir später genauer erläutern werden, Maschinen zur Manipulation von Daten jeder Art. Dies ist auch der Hintergrund, warum wir, die mit diesen Maschinen arbeiten, heute geneigt sind, die Bezeichnung &bdquo;elektronische Rechenmaschine&ldquo; als irreführend zu empfinden. Im Folgenden möchte ich daher für die Maschinen, die auf dem Prinzip aufgebaut sind dass Daten und Prozessanweisungen im gleichen internen Speicher aufbewahrt werden, die Bezeichnung <em>Datenautomat</em> benutzen.",
        "Die Ideen von Neumann und Goldstine erlangten sehr schnell weit über die Welt hinaus Beachtung. Das Hauptproblem war nun, technisch gute Lösungen für das zentrale Element in den Datenautomaten, die Speicherung von Daten, zu entwickeln. In dieser Hinsicht war erneut England für einige Jahre führend. Tatsächlich war der sogenannte Edsac der erste eigentliche Datenautomat, der zufriedenstellend arbeitete. Er wurde von Wilkes und Renwick in Cambridge konstruiert und war ab 1949 funktionstüchtig. Bei Edsac bestand der Speicher aus quecksilbergefüllten Röhren, in denen zirkulierende Schallimpulse zu Zahlen bzw. Instruktionen korrespondieren. Kurz darauf folgte Williams in Manchester mit einem Datenautomaten, der auf Basis eines von ihm selbst entwickelten Speicherprinzips gebaut wurde, die sogenannte Williams-Röhre.",
        "Bis zu diesem Zeitpunkt waren alle Datenmaschinen einzigartige Konstruktionen, die von einer Institution, meistens einer Universität, für den eigenen Gebrauch oder zur Lieferung im Rahmen eines Vertrags an einen bestimmten Kunden entwickelt wurden. Etwa um 1950 wird zum ersten Mal ein großer Datenautomat auf dem freien Markt angeboten. Es war die Firma Remington Rand, die mit den Maschinen Univac auftrat <sup class=\"footnote-ref\" data-footnote-id=\"1.2\">1.2</sup>. Die Firma hatte sich für die Entwicklung dieser Maschinen die Väter für die erste elektronische Rechenmaschine, Eckert und Mauchly, gesichert. Der erste Kunde wurde das US Census Büro, doch bald folgte eine große Versicherungsgesellschaft. Es ist schwierig, sich in die damals vorherrschende Denkweise zu versetzen, selbst unter Experten, die die Entwicklung zeitnah erlebt haben. Selbst zu diesem Zeitpunkt gab ein namhafter Experte an, man könne kaum erwarten, dass mehr als vielleicht ein Dutzend Datenmaschinen an Universitäten weltweit gebaut würden. Hiermit, meinte man, wäre der Bedarf an Berechnungen gedeckt.",
        "Es sollte anders kommen. Im Lauf von wenigen Jahren wurde klar, dass der Wert von Datenmaschinen keinesfalls auf mathematische oder wissenschaftliche Aufgaben begrenzt war &ndash; sondern viel umfassender ist und insbesondere das Feld administrativer Aufgaben umfasst, insbesondere Buchhaltung jeglicher Art. Nach einigen Jahren des Zögerns warf sich IBM, das sich bisher auf die einfacheren Lochkartenmaschinen und Schreibmaschinen konzentriert hatte, auf die Konstruktion von großen Datenautomaten, wo diese schnell zu Marktführern wurden. Im Lauf der 1950er Jahre wurde die Konstruktion von Datenautomaten zu einer Großindustrie, geprägt von harter Konkurrenz. Nicht wenige Unternehmen aus diesem Bereich sind untergegangen oder mussten ihre Aktivitäten nach hohen Verlusten einstellen. — Dies hat jedoch nicht die Verbreitung von Datenautomaten gebremst; allein in den USA lag deren Anzahl bei mehr als 32.000 Anlagen mit einem durchschnittlichen Wert von ein paar Millionen dänischer Kronen <sup class=\"footnote-ref\" data-footnote-id=\"1.3\">1.3</sup>."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Programmeringens æra"
      ],
      "german": [
        "Die Ära der Programmierung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Der skulle ikke gå mange år efter at datamaterne var begyndt at blive leveret til almindelig brug før der viste sig nye, uventede problemer. Det var muligt for ingeniørerne at udvikle og bygge datamater med stadig forøget arbejdshastighed og stadig forbedret pålidelighed, men samspillet mellem datamaterne og de mennesker der formulerede opgaverne for dem gav brat voksende problemer. Maskinerne var der, men det kneb for brugerne at følge med i at fodre dem med opgaver der var tilstrækkelig fuldstændigt og korrekt formuleret til at maskinerne kunne få lejlighed til at strække ud i gennemførelsen af løsningen. En stadig voksende del af omkostningerne ved at drive datamaterne kom til at skyldes forgæves forsøg med ukorrekte programmer. Fra slutningen af 1950'erne kom udviklingen omkring datamaterne således til at stå i programmeringens tegn.",
        "Programmeringens problemer vil blive nøjere drøftet i den fjerde forelæsning. Her skal blot antydes at løsningen af problemet ligger nøje på linie med den voksende forståelse af datamaterne som generelle symbolmanipulationsapparater. — Den helt almindeligt anvendelige løsning af problemer med kommunikationen mellem mennesker og datamater er at lade datamaten komme mennesket i møde ved at den pålægges et stadig mere kompliceret arbejde med at analysere og omforme menneskets ytringer. Denne almindelige filosofi fandt først anvendelse på det mest påtrængende problem, det at formulere løsningsmetoder for datamaten selv. I stigende grad gik man over til at tillade dem der skulle formulere problemløsningerne for datamaterne at udtrykke sig på en for mennesker bekvem måde. Til dette formål udviklede man særlige skrivemåder, såkaldte programmeringssprog, som for eksempel Algol, Fortran, og Cobol.",
        "Efter at de mest påtrængende problemer med programmeringen af datamaterne er blevet løst på denne måde har interessen vendt sig mod andre sider af kommunikationen mellem datamaterne og mennesker. Indtil omkring 1960 foregik praktisk talt al kontakt ved hjælp af skrivemaskinelignende apparater. For at meddele sig til datamaten måtte brugeren derfor skrive sine meddelelser på et tastatur, og datamatens svar fremkom igen i form af maskinskrift. Ydermere var den enkelte brugers kontakt med datamaten begrænset til kortvarige kørsler med timers mellemrum. Meget af arbejdet med at udvikle datamaterne er i dag rettet mod at fjerne disse begrænsninger. Det er blevet mere almindeligt at lade datamaterne styre apparater der kan tegne, eller der fremviser billeder som på en fjernsynsskærm. \"Tilsvarende er det i dag muligt at lade datamater opfatte menneskers ytringer gennem at aflæse en pegepind der føres af mennesket, ligesom der har været lagt en del arbejde i apparater som kan opfatte menneskers tale. Dertil kommer at de højst udviklede datamatiske systemer af i dag tillader brugerne at være i kontakt med systemet så tit og så længe brugeren behøver det."
      ],
      "german": [
        "Nachdem angefangen wurde Datenautomaten für den allgemeinen Gebrauch zu liefern, sollte es nicht viele Jahre dauern bevor sich neue, unerwartete Probleme zeigten. Es war den Ingenieuren möglich, Datenautomaten mit stets höherer Arbeitsgeschwindigkeit und stets besserer Zuverlässigkeit zu entwickeln und zu bauen &ndash; doch das Zusammenspiel zwischen den Datenautomaten und den Menschen, die die Aufgaben für sie formulierten, bereitete wachsende Probleme. Die Maschinen waren da, aber die Benutzer hatten Mühe, sie mit Aufgaben zu füttern, die ausreichend vollständig und korrekt formuliert waren, damit die Maschine die Gelegenheit bekamen, der gewünschten Lösung nahe zu kommen <sup class=\"footnote-ref\" data-footnote-id=\"1.4\">1.4</sup>. Ein ständig wachender Teil der Kosten einen Datenautomat zu betreiben entstand aufgrund erfolgloser Versuche mit inkorrekten Programmen. Ab dem Ende der 1950er-Jahre standen die Entwicklung rund um die Datenmaschinen somit im Zeichen der Programmierung.",
        "Die Probleme der Programmierung werden in der vierten Vorlesung ausführlicher behandelt. An dieser Stelle genügt es bloß anzudeuten, dass die Lösung des Problems genau auf der Linie mit dem wachsenden Verständnis von Datenautomaten als allgemeine Symbolmanipulationsapparate liegt. — Die allgemein anwendbare Lösung des Problems der Kommunikation zwischen dem Mensch und dem Datenautomat besteht darin, den Datenautomaten zunächst mit einer (immer komplexer werdenden) Analyse menschlicher Anweisungen zu beauftragen, bevor diese Anweisungen ausgeführt werden. <sup class=\"footnote-ref\" data-footnote-id=\"1.5\">1.5</sup> Diese gewöhnliche Philosophie fand zuerst Anwendung bei dem dringendstem Problem, der Formulierung von Lösungsmethoden für die Datenautomaten selbst. Im steigenden Umfang ging man dazu über, demjenigen, der die Problemlösungen für den Datenautomaten formulieren sollte, zu erlauben, sich auf eine für den Menschen bequeme Art und Weise auszudrücken. Zu diesem Zweck entwickelte man besondere Schreibweisen, so genannte Programmiersprachen, wie zum Beispiel Algol, Fortran und Cobol.",
        "Nachdem die dringendsten Probleme der Programmierung von Datenautomaten auf diese Weise gelöst wurden, hat sich das Interesse auf andere Aspekte der Kommunikation zwischen Datenautomaten und Menschen verlagert. Bis etwa 1960 fanden praktisch gesprochen alle Kontakte mit Hilfe von schreibmaschinenartigen Geräte statt. Um sich dem Datenautomat mitzuteilen, musste der Benutzer daher seine Mitteilung mit einer Tastatur schreiben, und die Antwort des Datenautomaten erschien wieder in Form von Maschinenschrift. Darüber hinaus war der Kontakt einiger Benutzers mit dem Datenautomaten begrenzt auf Programmausführungen von kurzer Dauer zwisch denen jeweils Stunden lagen <sup class=\"footnote-ref\" data-footnote-id=\"1.6\">1.6</sup>. Ein Großteil der Arbeit bei der Auseinandersetzung mit Datenautomaten ist heute darauf gerichtet, diese Begrenzung zu entfernen. Es ist inzwischen üblich, dass Datenautomaten Apperaturen steuern, die zeichnen oder Bilder wie auf einem Fernsehbildschirm anzeigen können. Ebenso ist es heute möglich, dass Datenautomaten menschliche Äußerungen begreifen, indem sie einen von einem Menschen gehaltenen Zeigestock ablesen<sup class=\"footnote-ref\" data-footnote-id=\"1.7\">1.7</sup>, gleichsam wurde ein Teil der Arbeit in Appertaruren gesteckt, die menschliche Sprache begreifen können. Dazu kommt, dass die fortschrittlichsten datenautomatischen Systeme heute den Nutzern erlauben, so oft und so lange im Kontakt mit dem System zu sein, wie sie benötigen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamatikken i Danmark"
      ],
      "german": [
        "Datenverarbeitung in Dänemark"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Som supplement til denne datamaternes verdens historie vil jeg i dag slutte med en kort gennemgang af udviklingen her i landet. Den første spæde begyndelse til vor overgang til det datamatiske samfund blev gjort i slutningen af 1946 da Akademiet for de tekniske Videnskaber dannede ATV's regnemaskineudvalg. Den drivende kraft og formand i dette udvalg var professor i matematik ved Danmarks tekniske Højskole, dr. phil. Richard Petersen. I de første år koncentrerede man sig omkring bygningen af en såkaldt analogimaskine. I den samme periode skete der en glimrende udvikling i Sverige, efter at den svenske rigsdag i 1947 havde bevilget 2 millioner kroner til formålet. Denne udvikling blev også til stor nytte for os her i landet, idet en række personlige kontakter førte til at den svenske rigsdag i 1952 tiltrådte at alle planer og erfaringer fra udviklingen af den svenske maskine Besk ville blive stillet frit til rådighed for et dansk udviklingsarbejde under ATV”s regnemaskineudvalg. Den første konsekvens heraf blev at civilingeniør Bent Scharøe Petersen tilbragte et års tid ved Matematikmaskinnämnden i Stockholm. På dette tidspunkt var det danske Forsvarets Forskningsråd også blevet interesseret i sagen, og der var dannet et fællesudvalg med ATV's regnemaskineudvalg.",
        "Det lå dog tungt med pengene. Danske erhvervsvirksomheder var blottede for interesse, og den danske statslige videnskab blegnede ved talen om de beløb der krævedes. Først i 1955 lykkedes det at få en bevilling på 900.000 kr. af den såkaldte militære counterpart-bevilling, og i slutningen af året kunne man omdanne ATV's regnemaskineudvalg til et selvejende ATV-institut, Regnecentralen. Herefter kom der rask gang i at bygge den danske version af Besk, som blev kendt under navnet Dask.",
        "Snart efter at Dask var sat i drift fik Regnecentralen en opfordring fra Geodætisk Institut til at indgå et samarbejde om udviklingen af en ny, mindre datamat. Dette samarbejde førte til konstruktionen af Gier, den første helt dansk udviklede datamat. I teknisk henseende betød den et spring frem fra Dask derved at den ikke benytter vakuumrør, men transistorer, i de elektroniske kredsløb. Den første Gier blev leveret i 1960 og derefter har produktionen løbet jævnt, og datamater af denne type er købt af virksomheder både i Danmark og i en række andre europæiske lande.",
        "Også på området programmeringssprog kom vi ved denne tid godt med herhjemme. Allerede mens Dask var under udvikling var det klart at der her lå store problemer, men også store muligheder. Da der i 1958 kom gang i det internationale samarbejde omkring at fastlægge et fælles programmeringssprog sluttede vi os straks til arbejdet, og jeg selv var medlem af en international kommite der i 1960 fastlagde programmeringssproget Algol 60.",
        "Sideløbende hermed begyndte der at komme gang i anvendelsen af datamater til rent administrative opgaver og indkøb af udenlandske datamater tog fart. I 1959 dannede staten og en række kommuner interessentskabet Datacentralen med henblik på løsningen af større offentlige registeropgaver, ligesom en række firmaer har lagt dele af deres administration over på datamater, enten gennem leje af tid hos et af servicebureauerne eller gennem brug af egen datamat.",
        "Den tekniske aktivitet er også fortsat. Regnecentralen, der siden 1964 har været et aktieselskab, har således foruden flere mindre apparater udviklet en ny datamat, RC 4000, som udnytter den nyeste mikroelektronik.",
        "Resultatet af denne udvikling er at antallet af datamater her i landet i 1967 er omkring 180, med hastigt stigende tendens. I forhold til vort indbyggerantal er dette ikke et overvældende antal. Fra et snævert økonomisk synspunkt er tallet derimod ikke urimeligt, og endda måske lidt højt. Problemet er ikke blot at have datamatkapaciteten, men også at have tilstrækkelig kapacitet af kyndige brugere. Dette sidste punkt er i dag den alvorligste flaskehals for udnyttelsen af de muligheder som datamaterne frembyder. Det er også baggrunden for de mangfoldige bestræbelser der i disse år gøres for at få kundskaben om datamaterne bragt ind i alle niveauer af uddannelsen.",
        "På dette punkt står vi svagt, i første række på grund af den traditionalisme og usmidighed der præger vore højere uddannelsesinstitutioner. Det er klart at indpasningen af forholdsvis kostbart apparatur som datamater i universiteterne og de andre højere læreanstalter vil kræve en administrativ nydannelse. I hvor ringe grad vore højere læreanstalter har været i stand til aktivt og selvstændigt at løse dette problem fremgår blandt andet deraf at det største datamatiske anlæg der for tiden står til disse institutioners rådighed skyldes en tidsbegrænset gave fra et amerikansk datamatfirma.",
        "En anden grund til vore uddannelsesmæssige svagheder må søges i at det endnu kun i ganske utilstrækkelig grad er erkendt at en indsigt i de principper der ligger bag anvendelsen af datamater bidrager til en helt ny forståelse af et bredt felt af andre fag, hvad enten disse har brug for datamaternes hjælp eller ej. Nøglen til denne forståelse ligger i datalogien, læren om data og dataprocesser, som derfor skal være emnet for den anden forelæsning"
      ],
      "german": [
        "Als Ergänzung zu dieser Weltgeschichte der Datenautomaten will ich heute mit einem kurzen Rückblick auf die Entwicklung hier im Lande schließen <sup class=\"footnote-ref\" data-footnote-id=\"1.8\">1.8</sup>. Die ersten Anfänge unseres Übergangs zu einer datenautomatischen Gesellschaft wurden Ende 1946 gemacht, als die Akademie der Technischen Wissenschaften <sup class=\"footnote-ref\" data-footnote-id=\"1.9\">1.9</sup> den ATV-Rechenmaschinenausschuss gründete. Die treibende Kraft und der Vorsitzende dieses Ausschusses war der Professor für Mathematik an der Technischen Universität von Dänemark, Dr. phil. Richard Petersen. In den ersten Jahren konzentrierte man sich auf den Bau einer so genannten Analogmaschine. Im der gleichen Periode geschah in Schweden eine glänzende Entwicklung, nachdem 2 Millionen Kronen im Jahre 1947 vom schwedischen Reichstag zu diesem Zweck zur Verfügung gestellt wurden <sup class=\"footnote-ref\" data-footnote-id=\"1.10\">1.10</sup>. Diese Entwicklung brauchte auch hierzulande Vorteile, denn eine Reihe von persönlichen Kontakten führte dazu, dass der schwedische Reichstag 1952 beschloss, alle Pläne und Erfahrungen aus der Entwicklung der schwedischen Maschine &bdquo;Besk&ldquo; für die dänische Entwicklungsarbeit im Rahmen des ATV-Rechenmaschinenausschusses zur Verfügung zu stellen. Die erste Konsequenz hiervon war, dass Bauingenier Bent Scharøe Petersen ein Jahr Zeit am Mathematikmaschineninstitut <sup class=\"footnote-ref\" data-footnote-id=\"1.11\">1.11</sup> in Stockholm verbrachte. Zu diesem Zeitpunkt hatte sich auch der dänische Verteidigungsforschungsrat <sup class=\"footnote-ref\" data-footnote-id=\"1.12\">1.12</sup> Interesse am Thema gezeigt, und es wurde ein gemeinsamer Ausschuss mit dem ATV-Rechenmaschinenausschuss gebildet.",
        "Dennoch gab es Probleme mit der Finanzierung. Die dänischen Unternehmen zeigten kein Interesse, und die dänische staatliche Wissenschaft erbleichte bei den Beträgen die benötigt wurden. Erst 1955 glückte eine Bewilligung von 900.000 dänischen Kronen aus der so genannten militärischen Counterpart-Bewilligung <sup class=\"footnote-ref\" data-footnote-id=\"1.13\">1.13</sup>, und Ende des Jahres wurde der ATV-Rechenmaschinenausschuss in ein unabhängiges ATV-Institut Regnecentralen <sup class=\"footnote-ref\" data-footnote-id=\"1.14\">1.14</sup>, umgewandelt. Hiernach wurde die dänische Version von Besk, die unter dem Namen &bdquo;Dask&ldquo; bekannt wurde, schnell gebaut.",
        "Kurz nach der Inbetriebnahme von Dask erhielt Regnecentralen eine Anfrage des Geodätischen Instituts, bei der Entwicklung eines neuen, kleineren Datenautomaten zusammenzuarbeiten. Diese Zusammenarbeit führte zum Bau von &bdquo;Gier&ldquo;, dem ersten vollständig in Dänemark entwickelten Datenautomaten. In technischer Hinsicht bedeutet dieser ein Sprung vorwärts von Dask, da er keine Vakuumröhren benutzt, sondern Transistoren mit elektrischem Kreislauf. Der erste Gier wurde 1960 ausgeliefert, und seither wurde die Produktion kontinuierlich fortgesetzt, und Datenautomaten dieses Typs wurden von Unternehmen sowohl in Dänemark als auch in einer Reihe anderer europäischer Länder gekauft.",
        "Auch im Bereich der Programmiersprachen kamen wir zu dieser Zeit hierzulande gut voran. Schon während der Entwicklung von Dask war klar, dass es große Probleme, aber auch große Chancen gab. Als 1958 die internationale Zusammenarbeit begann, um eine gemeinsame Programmiersprache zu etablieren, beteiligten wir uns sofort an der Arbeit, und ich selbst war Mitglied eines internationalen Komitees, das 1960 die Programmiersprache Algol 60 festlegte.",
        "Gleichzeitig hiermit begann die Anwendung von Datenautomaten für rein administrative Aufgaben in Gang zu kommen, und der Einkauf von ausländischen Datenautomaten gewann an Fahrt. 1959 bildeten die Regionen <sup class=\"footnote-ref\" data-footnote-id=\"1.15\">1.15</sup> und eine Reihe von Kommunen die Partnerschaft &bdquo;Datacentralen&ldquo; mit Hinblick auf die Lösung von großen Registrierungsaufgaben, gleichwohl verlagerte eine Reihe Firmen ihre Verwaltung auf Datenautomaten, indem sie entweder Zeit in einem der Dienstleistungszentren anmieteten oder ihren eigenen Datenautomaten benutzten.",
        "Die technische Tätigkeit wurde auch fortgesetzt. Regnecentralen, die seit 1964 eine Aktiengesellschaft waren <sup class=\"footnote-ref\" data-footnote-id=\"1.16\">1.16</sup>, hat neben mehreren kleinen Apperaten außerdem einen neuen Datenautomat, den RC 4000, entwickelt, der die neueste Mikroelektronik nutzt.",
        "Das Ergebnis dieser Entwicklung ist, dass die Zahl der Datenautomaten hier im Lande im Jahr 1967 bei etwa 180 lag, mit stark steigender Tendenz. Im Verhältnis zu unserer Einwohnerzahl ist dies keine überwältigende Anzahl. Von einem engen wirtschaftlichen Standpunkt ist die Zahl jedoch nicht unvernünftig, vielleicht sogar ein wenig hoch. Das Problem ist nicht nur die Datenautomatkapazitäten, sondern auch eine ausreichende Anzahl sachkundiger Benutzer. Dieser letzte Punkt ist heute der größte Flaschenhals bei der Nutzung der Möglichkeiten, die Datenmaschinen bieten. Dies ist auch der Hintergrund für die zahlreichen Bestrebungen, die in diesem Jahr unternommen werden, um das Wissen über Datenautomaten in allen Niveaus der Ausbildung einzuführen.",
        "Auf diesen Punkt stehen wir schwach dar, in erster Linie wegen den des Traditionalismus und der Unflexibilität, die unsere Bildungsinstitutionen prägen. Es ist klar, dass die Integration von verhältnismäßig teuren Apperaturen wie Datenautomaten in die Universitäten und anderen Lehrinstitutionen eine neue Verwaltungsstruktur erfordern wird. Inwieweit unsere höheren Lehrinstitutionen im Stand waren, dieses Problem aktiv und unabhängig zu lösen, ergibt sich unter anderem daraus, dass das größten datenautomatischen Anlagen, die diesen Einrichtungen derzeit zur Verfügung steht, ein zeitlich begrenztes Geschenk einer amerikanischen Computerfirma ist.",
        "Ein anderer Grund für unsere bildungsmäßige Schwachheit liegt darin, dass immer noch zu wenig erkannt wird, dass die Einsicht in die Prinzipien die hinter der Anwendungen von Datenautomaten liegen zu einem neuen Verständnis von einer Vielzahl anderer Fächer beiträgt, unabhängig davon, ob diese die Hilfe von Datenautomaten benötigen oder nicht. Der Schlüssel zu diesem Verständnis liegt in der <span class=\"alt-term\">Datalogie / Informatik</span>, der Lehre von den Daten und den Datenprozessen, die deshalb das Thema der zweiten Vorlesung sein wird."
      ]
    },
    {
      "type": "section",
      "danish": [
        "DATALOGI, LÆREN OM DATA"
      ],
      "german": [
        "<span class=\"alt-term\">Datalogie / Informatik</span>, Lehren über Daten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "I den første af disse forelæsninger stillede jeg Dem i udsigt at besvare spørgsmålet: Hvorfor er de elektroniske datamaskiner, eller datamaterne, som jeg foretrækker at kalde dem, af så væsentlig samfundsmæssig betydning? Jeg gennemgik kort regnemaskinernes historie og skitserede den vældige udvikling de har undergået i de sidste årtier, den udvikling der blandt andet har medført at vi i dag betragter disse apparater som datamanipulatorer, og ikke i første række som regnemaskiner."
      ],
      "german": [
        "In der ersten dieser Vorlesungen stellte ich Ihnen in Aussicht, die Frage zu beantworten: Warum sind elektronische Datenmaschinen, oder Datenautomaten, wie ich vorziehe sie zu nennen, von so großer gesellschaftlicher Bedeutung? Ich habe einen kurzen Rückblick auf die Geschichte der Rechenmaschinen gegeben und die enorme Entwicklung skizziert, die diese in den letzten Jahrzehnten durchlaufen haben, diese Entwicklung, die unter anderem mit sich brachte, dass wir diese Geräte heute als Datenmanipulatoren und nicht in erster Linie als Rechenmaschinen betrachten."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Data, datarepræsentationer og dataprocesser"
      ],
      "german": [
        "Daten, Datendarstellungen und Datenprozesse"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "I dag skal vi beskæftige os med nogle helt andre grunde til datamaternes enestående betydning. Jeg vil skitsere det der ligger i begreberne data og de dertil nøje knyttede datarepræsentationer og dataprocesser, og forsøge at vise at disse begreber i sig rummer et helt nyt syn på en mangfoldighed af menneskets ytringsformer, både matematikken og mere dagligdags foreteelser som sproget. Gennem deres intime forbindelse med disse almenmenneskelige ting bliver datamaternes samfundsmæssige betydning langt mere forståelig.",
        "For nu med det samme at få det værste overstået, her er den internationale definition af ordet »data«:",
        "DATA: enhver repræsentation af fakta eller ideer på en formaliseret måde, som kan kommunikeres eller manipuleres ved en eller anden proces.",
        "Denne definition lyder formentlig ret så tam, eller endda tom, men just deri ligger det uhyre omfattende i begrebet. For at give Dem en mere håndgribelig forståelse vil jeg nu gennemgå nogle eksempler og sammenholde dem med definitionen.",
        "Lad os begynde med sædvanlig sprogbrug. Som eksempel har jeg her på papiret foran mig skrevet en sætning. Sætningen læser:",
        "»På væggen hænger en sollysende høstscene« Disse tegn på papiret foran mig er i følge definitionen data. Lad os for at forvisse os herom først overveje den første del af definitionen, der siger: »Enhver repræsentation af fakta eller ideer«. Her er der tale om forholdet mellem sætningen på papiret og visse andre omstændigheder i verden, maleriet, væggen, det at maleriet hænger der, og tanken om maleriets motiv. Det er dette forhold mellem sætningen og virkeligheden, der udtrykkes ved at disse data repræsenterer fakta og ideer. Den anden del af definitionen siger at repræsentationen må være formaliseret på en sådan måde at den kan kommunikeres eller manipuleres ved en eller anden proces. Hvad angår den nævnte proces da kan jeg uden videre nævne en sådan, nemlig den der består i at jeg lader mit blik følge teksten og læser den op for Dem som jeg netop gjorde før. Derigennem har jeg kommunikeret disse data til Dem. \"Tilbage står kravet om at repræsentationen skal være formaliseret. Her tænkes der på den omstændighed at en tekst som den omtalte består af enkelte tegn, bogstaverne, der holder sig inden for et meget begrænset sæt af former, nemlig de henved tredive bogstaver i alfabetet, og ydermere at små uregelmæssigheder i det enkelte tegns fremtræden på papiret er uden betydning. Denne omstændighed er betingelsen for at man kan tale om en perfekt kommunikation af teksten. Hvis for eksempel en af mine tilhørere har nedskrevet sætningen så kan vi gå ud fra at blot han er fortrolig med dansk retskrivning så vil hans version af sætningen være aldeles den samme som min, bogstav for bogstav.",
        "Definitionen af data gemmer dog på endnu mere, gennem det den ikke siger. Den udtaler sig aldeles ikke om nogen bestemt måde data kan eksistere og lader derved alle muligheder stå åbne. Allerede den anførte illustration giver en række eksempler herpå. De primære data findes som tryksværte på papir her foran mig. Alene derigennem at jeg har læst sætningen højt og at den er blevet overført til lytterne gennem radioen er disse samme fakta og ideer blevet repræsenteret på en række andre måder, først som en serie lyde jeg udtaler, derefter som elektriske signaler af flere forskellige former, før den omsider igen omsættes til lyd i Deres højttaler. Hver af disse former kan opfattes som data der repræsenterer de samme fakta og ideer.",
        "Endnu en væsentlig ting skal bemærkes ved den givne definition af data, nemlig den udtrykgelige tale om processer. En ting eller begivenhed er ikke i sig selv data, men bliver det først når den indgår i en proces hvori dens repræsentation af fakta og ideer er det afgørende. Hvis jeg brænder et beskrevet stykke papir så underkastes skrifttegnere en forbrændingsproces, men dette gør dem ikke i sig selv til data. Dette er derimod tilfældet hvis en person læser dem. Vi ser heraf at databegrebet beskæftiger sig med en måde som mennesker forholder sig på til visse fænomener."
      ],
      "german": [
        "Heute werden wir uns mit einigen ganz anderen Gründen für die einzigartige Bedeutung von Datenautomaten beschäftigen. Ich werde skizzieren, was sich hinter den Begriffen <em>Daten</em> und den damit eng verbundenen Begriffen <em>Datendarstellungen</em> und <em>Datenprozessen</em> verbirgt. Daneben versuche ich zu zeigen, dass diese Begriffe eine an sich völlig neue Sichtweise auf eine Vielzahl menschlicher Ausdrucksformen, sowohl auf die Mathematik, als auch auf alltägliche Phänomene wie die Sprache, enthalten. Durch ihre enge Verbindung mit diesen allgemeinen Dingen wird die gesellschaftliche Bedeutung von Datenautomaten viel mehr verständlich.",
        "Um jetzt sofort das schlimmste zu überstehen, hier ist die internationale Definition des Wortes &bdquo;Daten&ldquo;:",
        "DATEN: Jede beliebige Darstellung von Tatsachen oder Ideen auf eine formalisierte Art und Weise, die durch irgendeinen Prozess kommuniziert oder manipuliert werden kann <sup class=\"footnote-ref\" data-footnote-id=\"2.1\">2.1</sup>.",
        "Diese Definition klingt vermutlich recht zahm, oder sogar leer, aber genau darin das äußerst umfassende des Begriffs. Um Ihnen ein greifbareres Verständnis zu geben, will ich nun einige Beispiele durchgehen und diese mit der Definition vergleichen.",
        "Beginnen wir mit dem gewöhnlichen Sprachgebrauch. Als Beispiel habe ich einen Satz auf das Papier vor mir geschrieben. Der Satz lautet:",
        "&bdquo;An der Wand hängt eine sonnenbeschienene Ernteszene&ldquo; Diese Zeichen auf dem Papier vor mir entsprechen der Definition von Daten. Lasst uns, um uns dessen zu vergewissern, zuerst über den ersten Teil der Definition nachdenken, welche besagt: &bdquo;Jede beliebige Darstellung von Tatsachen oder Ideen&ldquo;. Hier ist die Sprache von der Beziehung zwischen den Sätzen auf Papier und gewissen anderen Umständen auf der Welt, dem Gemälde, der Wand an der das Gemälde hängt, und dem Gedanken vom Motiv des Gemäldes. Es ist diese Beziehung zwischen dem Satz und der Wirklichkeit, die dadurch ausgedrückt wird, dass diese Daten Tatsachen und Ideen darstellen. Der zweite Teil der Definition besagt, dass die Darstellung auf so eine Weise formalisiert sein muss, dass sie durch irgendeinen Prozess kommuniziert oder manipuliert werden kann. Was diesen erwähnten Prozess angeht, kann ich ohne weiteres so einen benennen, nämlich den der darin besteht, dass ich meinen Blick den Text folgen lasse und diesen Ihnen vorlese, wie ich es gerade getan habe. Dadurch habe ich Ihnen diese Daten kommuniziert. Es bleibt die Forderung dass die Darstellung formalisiert sein muss. Dies bezieht sich auf den Umstand, dass ein Text wie der erwähnte aus einzelnen Zeichen, den Buchstaben, besteht, die sich in einem sehr begrenzten Satz von Formen, nämlich den fast dreißig Buchstaben des Alphabets, aufhält, und darüber hinaus darauf, dass kleine Unregelmäßigkeiten im Auftreten von einzelnen Zeichen auf dem Papier ohne Bedeutung sind. Dieser Umstand ist eine Voraussetzung für eine perfekte Kommunikation des Textes. Wenn zum Beispiel einer meiner Zuhörer den Satz aufgeschrieben hat, können wir davon ausgehen, dass, sofern er mit der dänischen Rechtschreibung vertraut ist, seine Version des Satzes Buchstabe für Buchstabe genau mit der meinen übereinstimmt. Die Definition von Daten versteckt jedoch noch mehr durch das, was sie <em>nicht</em> sagt. Sie sagt absolut nichts über eine bestimmte Art und Weise in der Daten existieren können, und lässt damit alle Möglichkeiten offenstehen. Bereits die angegebene Illustration gibt eine Reihe von Beispielen hierfür. Die primären Daten finden sich als Druckerschwärze auf dem Papier hier vor mir. Allein dadurch dass ich den Satz laut vorgelesen hätte und dass er zum Hören durch das Radio übertragen worden wäre, wären diese Tatsachen und Ideen auf eine Reihe anderer Art und Weise dargestellt worden, zuerst als eine Serie von Lauten die ich ausspreche, anschließend als elektronische Signale von mehreren unterschiedlichen Formen, bevor diese zu guter Letzt wieder zu Lauten in Ihrem Lautsprechern übersetzt werden. Jede dieser Formen kann als Daten aufgefasst werden, die dieselben Tatsachen und Ideen darstellen.",
        "Eine weitere wesentliche Bemerkung soll bezüglich dieser gegebenen Definition von Daten gemacht werden, nämlich die ausdrückliche Sprache von <em>Prozessen</em>. Ein Ding oder eine Begebenheit ist nicht in sich selbst ein Datum, sondern wird das zuerst, sobald es in einen Prozess hineingeht, in dem seine Darstellung von Tatsachen und Ideen das entscheidende ist. Falls ich ein beschriebenes Stück Papier verbrenne, so unterziehe ich den Schriftzeichen einen Verbrennungsprozess, aber dies macht diese nicht in sich selbst zu Daten. Dies ist hingegen der Fall, wenn eine Person diese liest. Wir sehen hieraus dass sich der Datenbegriff mit einer Art und Weise beschäftigt, wie sich ein Mensch bezüglich diese Erscheiungen verhält."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Kunst og modeller som data"
      ],
      "german": [
        "Kunst und Modelle als Daten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Databegrebet ligger nær op ad symbol- og modelbegreberne. Ordet symbol bruges både om matematiske symboler, hvor det knap kan skelnes fra data, og i kunsten. Brugen af symboler i kunsten er dog en kompliceret sag. Nok er der tale om at én ting på en ejendommelig måde peger på, eller henviser til, en anden, men der gives ikke nødvendigvis et krav om en formalisering som ved databegrebet. Således er der forskel mellem et maleri og data. Maleriet er ikke formaliseret og ingen kopi af det vil regnes for lige så god som originalen.",
        "At formelle processer ikke er kunsten uvedkommende fremgår på den anden side af forbindelsen mellem litteraturen og bogtrykkunsten, som må betragtes som en tidlig triumf for mekanisk databehandling. Ved at fremdrage dette eksempel håber jeg også at berolige dem der føler sig uhyggeligt til mode ved de moderne datamater. Vi har alle for længst vænnet os til at omgås særdeles personligt med data som er frembragt gennem mekaniske processer. Der er ingen der føler sig stødt af at kærlighedsdigte er reproduceret ved hjælp af ganske følelsesløse trykkemaskiner. Af og til kan man dog iagttage at der måske er en grænse for hvor vidt vi er parat til at akceptere dette upersonlige mellemled. Jeg selv føler mig snydt når jeg modtager en julehilsen der er trykt og hvor afsenderen ikke engang har umaget sig til at tilføje sin egenhændige underskrift. Fornemmelsen kan dog også vendes om. Nutildags regnes et festtelegram jo for en fuldt ud passende form for hyldest, næsten bedre end et brev, til trods for at telegramteksten som bekendt har været udsat for en langt mere omfattende håndtering af uvedkommende personer og maskiner.",
        "Databegrebets forbindelse til modelbegrebet er måske ikke ved første øjekast indlysende, da man ved en model normalt tænker på en ting som i sin fremtoning har stærk lighed med det den er en model af, som for eksempel ved modelfly. Modelbegrebet er imidlertid for længst overtaget i de empiriske videnskaber, fysikken, astronomien, biologien, og mange andre, og bruges der om langt mere abstrakte konstruktioner. I astronomien taler man for eksempel om stjernemodeller, der består af kurver eller tabeller, altså data."
      ],
      "german": [
        "Der Datenbegriff liegt nahe am Symbol- oder Modellbegriff. Das Wort Symbol wird sowohl für mathematische Symbole verwendet, wo es kaum von Daten zu unterscheiden ist, als auch in der Kunst. Der Gebrauch von Symbolen in der Kunst ist jedoch eine komplizierte Sache. Wohl ist die Sprache davon, dass ein Ding sich auf eigentümliche Art und Weise auf ein anderes bezieht oder verweist, aber es gibt keine Notwendigkeit für die Anforderung nach einer Formalisierung wie beim Datenbegriff. Es gibt also so einen Unterschied zwischen einem Gemälde und Daten. Das Gemälde ist nicht formalisiert, und keine Kopie davon ist genauso gut wie das Original.",
        "Dass formelle Prozesse für die Kunst nicht fremd sind, zeigt sich auf der anderen Seite durch die Verbindung zwischen der Literatur und der Buchdruckkunst, die als ein früher Triumph der mechanischen Datenverarbeitung betrachtet werden darf. Mit Voranbringen dieses Beispiels hoffe ich auch diejenigen zu beruhigen, die sich leicht unwohl bis mulmig mit den modernen Datenautomaten fühlen. Wir alle haben uns längst daran gewöhnt, äußerst persönlich mit Daten umzugehen, die durch mechanische Prozesse erzeugt wurden. Es gibt niemanden, der sich von einem Liebesgedicht, das mit Hilfe von gefühllosen Druckmaschinen reproduziert wurde, beleidigt fühlt. Ab und zu kann man aber beobachten, dass es vielleicht eine Grenze gibt, wie weit wir bereit sind, dieses unpersönlichen Zwischenglied zu akzeptieren. Ich selbst fühle mich beleidigt, wenn ich einen Weihnachtsgruß erhalte, der gedruckt ist und bei dem sich der Absender nicht einmal die Mühe gemacht hat, seine Unterschrift eigenhändig hinzuzufügen. Das Gefühl kann sich aber auch umkehren. Heutzutage wird ein Weihnachtstelegramm ja als vollkommen passende Form des Glückwunsches gezählt, fast besser als ein Brief, obwohl der Telegrammtext, wie man weiß, einer weitaus umfangreicheren Handhabung durch unbefugte Personen und Maschinen ausgesetzt ist.",
        "Die Verbindung des Datenbegriffs mit dem Modellbegriff ist vielleicht nicht auf den ersten Blick einleuchtend, da man sich unter einem Modell normalerweise ein Ding vorstellt, das in seinem Aussehen eine starke Ähnlichkeit mit dem hat, wovon es ein Modell ist, wie zum Beispiel ein Modellflugzeug. Der Modellbegriff wurde jedoch längst in die empirischen Wissenschaften übernommen, die Physik, die Astronomie, die Biologie, und viele andere, und wird dort für viel abstraktere Konstruktionen gebraucht. In der Astronomie spricht man zum Beispiel von Sternmodellen, die aus Kurven oder Tabellen, also Daten, bestehen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Data som værktøj"
      ],
      "german": [
        "Daten als Werkzeug"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Men hvis databegrebet på alle disse måder er foregrebet eller indeholdt 1 disse kendte begreber, hvad bringer det da af nyt, må vi spørge. Svaret herpå ligger allerede i det sagte, på den ene side i den ubegrænsede frihed til som data at vælge hvilken art fænomener som helst, lyde, tryksværte på papir, elektriske strømme, magnetfelter, osv., dels i interessen for processerne. I denne sidste interesse ligger noget aktivt. Data er ikke noget der eksisterer eller som man har, det er noget man bruger, et værktøj for mennesker i deres virksomhed.",
        "Denne opfattelse kan umiddelbart bekræftes ved en overvejelse af sproget. For så vidt sproget anvendes til kommunikation af fakta og ideer mellem mennesker, og ikke som medium for fri fabuleren, da tjener sproget åbenbart som hjælpemiddel, værktøj, — og er vel endda det vigtigste menneskelige værktøj overhovedet.",
        "Men med en helt fri opfattelse af data åbner vi vejen for en langt mere effektiv udnyttelse af dem. Sagen er at den lethed hvormed vi kan gennemføre en given dataproces i høj grad afhænger af præcis hvilke data vi har valgt til at repræsentere virkeligheden, eller som jeg kort vil sige, af datarepræsentationen. Dette forhold er velkendt fra sædvanlig brug af de sproglige repræsentationer, tale og skrift. Blandt de processer der her er tale om kan nævnes adskillige, for eksempel: at udveksle ideer blandt personer; at give en fuldstændig beskrivelse af et forhold; at registrere nu tilgængelige fakta for at undgå at de fortabes; at udbrede en enkelt persons ideer til mange. Som enhver ved vælger man sin sproglige form, tale eller skrift, under hensyn til hvorledes processen vil forløbe mest effektivt. Til at udveksle ideer bruger man helst samtale, fordi den skriftlige form er for tung og langsom. Fuldstændige beskrivelser udformes bedst skriftligt, fordi dette er mere fordelagtigt for den der skal bruge dem. Til at registere tilgængelige fakta bruger mange af os skriftlige notater, men det afhænger af vor indbyggede procesformåen, og nogle af os opnår en sikrere registrering ved at bruge hukommelsen. Til at udbrede en enkelt persons ideer til mange benytter man i ikke helt simple tilfælde en kombination af tale og skrift, som vi for eksempel stadig kan iagttage det i arbejdet for at udbrede politiske ideer.",
        "Den helt fri opfattelse af data har i praksis for længst slået sig igennem hvad angår den dataproces der hedder kommunikation. Vi benytter frit en blanding af de gammelkendte repræsentationer, tale og skrift, og en mangfoldighed af andre, telegrafi, telefoni, radio- og fjernsynsoverføring, idet vi i hver livssituation vurderer den indbyrdes fordel af disse i forhold til den kommunikationsproces vi har brug for at få udført.",
        "På området datalagring, som kan opfattes som den proces at kommunikere med en forsinkelse af ubekendt varighed, har en voksende frigørelse fra sædvanlig nedskrivning ligeledes fundet sted med fremkomsten af båndoptagere.",
        "Fra datalogiens synspunkt må denne udvikling opfattes blot som en begyndelse, da den kun berører de allersimpleste dataprocesser. Fremkomsten af datamaterne betyder at langt mere komplicerede dataprocesser meget effektivt kan udføres uden at mennesker behøver at deltage. Vejen er derved blevet åbnet for at arbejdet med datamodeller bliver i høj grad automatiseret og effektiviseret."
      ],
      "german": [
        "Aber wir dürfen fragen, was neues dieser Datenbegriff bringt, wenn er auf all diese Weisen vorweggenommen oder in diesen bekannten Begriffen bereits enthalten ist. Die Antwort liegt hierbei im bereits Gesagten: auf der einen Seite in der unbegrenzten Freiheit, beliebige Phänomene, Töne, Druckerschwärze auf Papier, elektrische Ströme, Magnetfelder, und viele weiteren, als Daten zu wählen &ndash; und andererseits in den Fokus an den Prozessen. In diesem letzten Fokus liegt etwas aktives. Daten sind nicht etwas, das existiert oder das man hat &ndash; sie sind etwas, das man gebraucht, ein Werkzeug für die Menschen in ihrer Tätigkeit.",
        "Diese Auffassung lässt sich unmittelbar durch die Berücksichtigung von Sprache. Sofern die Sprache für die Kommunikation von Tatsachen und Ideen zwischen Menschen angewendet wird, und nicht als Medium für freie Fantasien, dann dient die Sprache offensichtlich als Hilfsmittel, als Werkzeug - und ist sogar das wichtigste menschliche Werkzeug überhaupt.",
        "Aber mit einer völlig freien Auffassung von Daten öffnen wir Wege für eine viel effektivere Verwendung von diesen. Der Fall ist, dass die Leichtigkeit mit der wir einen gegebenen Datenprozess durchführen können, im hohen Grad abhängig davon abhängig ist, welche Daten genau wir gewählt haben, um die Wirklichkeit darzustellen, oder wie ich kurz sagen will, von <em>Datendarstellungen</em>. Dieser Zusammenhang ist aus dem üblichen Gebrauch von sprachlichen Darstellungen, der Sprache und der Schrift, gut bekannt. Zu den Prozessen, über die wir hier sprechen, können mehrere als Beispiel genannt: der Austausch von Ideen zwischen Personen; die vollständige Beschreibung eines Zusammenhangs; die Aufzeichnung von jetzt verfügbaren Fakten, um zu verhindern dass diese verloren gehen; die Verbreitung der Ideen einer einzelnen Person an viele. Wie jeder weiß, wählt man seine sprachliche Form, Sprache oder Schrift, unter der Berücksichtigung wie der Prozess am effektivsten abläuft. Für den Austausch von Ideen benutzt man am liebsten das Gespräch, weil die schriftliche Form zu schwerfällig und langsam ist. Vollständige Beschreibungen lassen sich am besten schriftlich ausformulieren, da dies für denjenigen, der diese benötigt, vorteilhafter ist. Um verfügbare Fakten aufzuzeichen, verwenden viele von uns schriftliche Notizen, aber das hängt von unserer angeborenen Verarbeitungsfähigkeit ab, und einige von uns erreichen eine zuverlässigere Aufzeichnung, wenn sie die Erinnerung benutzen. Um die Ideen einer einzelnen Person an viele Benutzer weiterzugeben, wird in nicht ganz so einfachen Fällen eine Kombination aus Sprache und Schrift verwendet, wie wir zum Beispiel bei den Arbeit zur Verbreitung politischer Ideen immer noch beobachten können.",
        "Die völlig freie Auffassung von Daten hat sich in der Praxis längst durchgesetzt, wenn es um den Datenprozess geht, der Kommunikation heißt. Wir benutzen frei eine Mischung aus altbekannten Darstellungen, Sprache und Schrift, und eine Vielzahl von anderen, Telegrafie, Telefonie, Radio- und Fernsehübertragung, wobei wir in jeder Lebenssituation den jeweiligen Vorteil dieser, in Bezug auf den Kommunikationsprozess den wir fertig stellen wollen, beurteilen.",
        "Im Bereich der Datenspeicherung, die man als Kommunikation mit einer Verzögerung von unbekannter Dauer auffassen kann, fand mit dem Aufkommen der Tonbandaufnahme ebenfalls eine wachsende Freiten von der üblichen Niederschrift statt.",
        "Vom Standpunkt der <span class=\"alt-term\">Datalogie / Informatik</span> darf man die Auswirkungen dieser Entwicklungen nur als ein Anfang auffassen, da sie bisher nur die einfachsten Datenprozesse betrifft. Die Entstehung von Datenautomaten bedeutet, dass viel kompliziertere Datenprozesse sehr effektiv durchgeführt werden können, ohne dass menschliches Verhalten beteiligt ist. Dadurch ist der Weg dafür geöffnet, dass die Arbeit mit Datenmodellen im hohen Grad automatisiert und effektiver wird."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamodeller i samfundslivet"
      ],
      "german": [
        "Datenmodelle im gesellschaftlichen Leben"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Betydningen af datamodeller for samfundslivet kan næppe overvurderes. De er grundlaget for enhver planlægning, fra forretningsmandens tabeller og kurver over den erhvervsmæssige udvikling, over ingeniørens arbejde med beregninger og tegninger der beskriver den bro han er ved at konstruere, til fysikerens matematiske teori for atomkernen. På hvert af disse områder tillader arbejdet med data at man skaffer sig viden om hvordan den virkelige verden vil opføre sig under forskellige omstændigheder. Datamodellerne tillader at vi eksperimenterer med virkeligheden, men uden at vi behøver opføre bekostelige eksperimentopstillinger og uden at tabe ret meget hvis eksperimentet mislykkes. Værdien heraf er især slående ved planlægningen af ting som skibe, flyvemaskiner, broer, og atomreaktorer, hvor et fejlslagent virkeligt eksperiment øjensynlig kan være katastrofalt. Derimod betyder det ikke alverden om det ved en beregning viser sig at en påtænkt reaktorkonstruktion vil eksplodere.",
        "Hvad er nu betydningen af det datalogiske synspunkt for denne brug af modeller? Her er der to ting at nævne. For det første befrier datalogien os for fordomme om at arbejdet med en bestemt, given problemstilling er knyttet til en bestemt datarepræsentation. Sådanne fordomme er uhyre udbredte. For eksempel arbejder ingeniører og arkitekter traditionelt med tegninger af deres konstruktioner som primære data. Det vil umiddelbart vække modstand hvis man foreslår at denne form måske slet ikke bør være enerådende. Ikke desto mindre er det en kendsgerning at der nu til dags i betydeligt omfang oregår udviklingen af komplicerede konstruktioner, som vejanlæg og skibe, uden nævneværdig brug af tegninger.",
        "Hermed er ikke sagt at den hidtidige brug af tegninger har været en datalogisk fejltagelse. Hvad datalogien siger er at datarepræsentationen må afpasses efter den transformation der skal udføres og det procesværktøj der er til rådighed. Indtil de moderne datamaters fremkomst omkring 1945 var arkitekter og ingeniører i det væsentlige henvist til at arbejde kun med mennesker som procesværktøj. I relation til den måde vi mennesker arbejder med hovedet og til vor synsmekanik er tegninger en særdeles velvalgt datarepræsentation.",
        "Den anden værdi af datalogien for odelbyggeren ligger i selve opbygningen af en datamodel og i beskrivelsen af alle detailler i de processer der indgår i dens brug. Den nøje formulering af en datamodel virker i høj grad stimulerende for forståelsen af enhver art problem, stimulerende på en måde som må opleves for at forstås. Denne dybere forståelse af problemerne er slet ikke knyttet kun til mere komplicerede problemer. En betydelig del af gevinsten kan også høstes uden at man kommer i berøring med datamater. Det afgørende er oplevelsen af hvordan dataprocesser kan udvikles, beskrives og bearbejdes",
        "Det fremgår af disse betragtninger at datalogien ikke har nogen nødvendig forbindelse med datamaterne og at den datalogiske betragtningsmåde indeholder meget gammelkendt, som blot ikke hidtil har været samlet under samme synspunkt. Datamaterne har dog det med sagen at gøre at de ved deres fremkomst fremtvinger en ny og velfunderet datalogisk stillingtagen til problemernes løsning. Den hurtighed, sikkerhed og prisbillighed hvormed nutidens datamater gennemfører komplicerede dataprocesser betyder et så afgørende spring sammenlignet med hvad der hidtil har været kendt, at enhver menneskelig aktivitet der i nævneværdig grad har brug for dataprocesser må blive påvirket deraf. Vanskeligheden ved overgangen beror i vid udstrækning på at dyrkerne af de mange specialfag slet ikke er vant til at se deres fag på den led som situationen kræver. Den ingeniør der bygger broer er vant til at vurdere konsekvenserne af nye materialer og nye konstruktive ideer, men ikke i nær så høj grad af nye beskrivelsesformer, nye datarepræsentationer. Samtidig griber en ændring i den datarepræsentation der benyttes under projekteringen så dybt ind i arbejdet at den ikke kan overlades til fremmede eksperter alene, men kræver meget aktiv medvirken af det enkelte fags dyrkere.",
        "Dertil kommer at datamaterne selv undergår en udvikling, således at tilpasningen af de enkelte fags problemer til dette værktøj ingenlunde er noget der kan klares én gang for alle."
      ],
      "german": [
        "Die Bedeutung von Datenmodellen für das gesellschaftliche Leben kann kaum überschätzt werden. Sie sind die Grundlage für alle Planungen, von den Tabellen und Kurven des Geschäftsmannes über die berufliche Entwicklung, zur Arbeit eines Ingenieurs mit Berechnungen und Zeichnungen die die Brücke die er konstruiert, bis zur mathematischen Theorien des Physikers über den Atomkern. In jedem dieser Bereiche ermöglicht uns die Arbeit mit Daten, dass man sich Wissen darüber schafft, wie die wirkliche Welt sich unter Verschiedenen Umständen verhält. Die Datenmodellierung erlaubt es uns, mit der Realität zu experimentieren, ohne dass wir kostspielige Experimentieraufstellungen aufbauen müssen und ohne dass wir recht viel verlieren, wenn das Experiment missglückt. Der Wert hiervon ist besonders auffällig bei der Planung von Dingen wie Schiffe, Flugzeuge, Brücken, oder Atomreaktoren, wo ein Fehlschlag echter Experimente offensichtlich katastrophal sein kann. Darüber hinaus bedeutet das, dass nicht die ganze Welt darüber Bescheid weiß, wenn eine Berechnung zeigt, dass ein angedachtes Reaktordesign explodieren wird.",
        "Was ist nun die Bedeutung von diesem <span class=\"alt-term\">datalogischem / informatischen</span> Standpunkt für diesen Gebrauch von Modellen? Hier sind zwei Dinge zu benennen. Erstens befreit uns die <span class=\"alt-term\">Datalogie / Informatik</span> von dem Vorurteil, dass die Arbeit mit einer bestimmten, gegebenen Problemstellung an eine bestimmte Datendarstellung gebunden ist. Solche Vorurteile sind ungeheuer weit verbreitet. So arbeiten zum Beispiel Ingenieure und Architekten traditionell mit Zeichnungen ihrer Entwürfe als primäre Daten. Es wird unmittelbar Widerstand wecken, falls man vorschlägt, dass diese Form vielleicht gar nicht alleine bestimmend sein sollte. Nicht desto weniger ist es eine Tatsache, dass heutzutage in erheblichem Umfang Entwicklungen von komplizierte Konstruktionen, wie Straßenbau und Schiffe, voranschreiten, ohne nennenswerten Gebrauch von Zeichnungen.",
        "Hiermit wird nicht gesagt, dass die bisherige Verwendung von Zeichnungen ein <span class=\"alt-term\">datalogischer / informatischer</span> Fehler ist. Was die <span class=\"alt-term\">Datalogie / Informatik</span> sagt ist, dass die Datendarstellung an die Transformation die durchgeführt werden soll und das Prozesswerkzeug, das zur Verfügung steht, angepasst werden muss. Bis zum Aufkommen moderner Datenautomaten etwa um 1945 waren Architekten und Ingenieure im Wesentlichen darauf angewiesen, nur mit Menschen als Prozesswerkzeuge zu arbeiten. In Bezug auf die Art und Weise, wie wir Menschen mit dem Kopf und für unserer Sehmechanik arbeiten, sind Zeichnungen eine besonders gut gewählte Datendarstellung.",
        "Der zweite Wert der <span class=\"alt-term\">Datalogie / Informatik</span> für Modellbauer liegt in der Struktur eines Datenmodell selbst und in der Beschreibung aller Details der Prozesse, die mit seiner Nutzung einhergehen. Die sorgfältige Formulierung eines Datenmodells wirkt im hohen Grade stimulierend für das Verständnis von einem Problem jeder Art &ndash; stimulierend auf eine Art und Weise die man erfahren muss um sie zu verstehen. Dieses tiefere Verständnis der Probleme ist gar nicht nur verbunden mit komplizierteren Problemen. Ein bedeutender Teil des Gewinns kann auch geerntet werden, ohne dass man mit Datenautomaten in Berührung kommt. Das Entscheidende ist die Erfahrung, wie Datenprozesse entwickelt, beschrieben und verarbeitet werden.",
        "Es folgt aus diesen Betrachtungen, dass <span class=\"alt-term\">Datalogie / Informatik</span> nicht notwendigerweise eine Verbindung mit Datenautomaten hat und dass die <span class=\"alt-term\">datalogische / informatische</span> Betrachtungsweisen viel bekanntes beinhaltet, das bis jetzt nur noch nicht unter diesen Standpunkt gesammelt wurden. Datenautomaten haben jedoch durch ihr Erscheinen einen neuen und gut begründeten <span class=\"alt-term\">datalogischen / informatischen</span> Standpunkt zur Lösung von Problemen erzwungen. Die Schnelligkeit, Sicherheit und Bezahlbarkeit mit der Datenautomaten heutzutage komplizierte Datenprozesse verarbeiten bedeutet einen so essentiellen Sprung, verglichen mit was wir bis hierher gekannt hatten, dass jede menschliche Aktivität die im nennenswerten Grad Datenprozesse braucht, davon betroffen sein wird. Die Schwierigkeit des Übergangs betrifft zu einem großen Teil die Beschäftigten von den vielen Spezialfächern, die es gar nicht gewohnt sind, ihr Fach auf diese Weise, wie es die Situation erfordert, zu sehen. Der Ingenieur, der Brücken baut, ist es gewohnt, die Folgen neuer Materialien und neuer Konstruktionsideen zu bewerten, aber bei weitem nicht so sehr, die neue Beschreibungsformen oder neuer Datendarstellungen. Gleichzeitig greift eine Änderung in die Datendarstellungen, die bei der Planung benutzt werden, so tief in die Arbeit ein, dass diese nicht fremden Experten alleine überlassen werden kann, sondern eine sehr aktive Mitwirkung von den einzelnen Fächern benötigt.",
        "Dazu kommt, dass Datenautomaten selbst eine Entwicklung durchlaufen, so dass die Anpassung auf die Probleme der einzelnen Fächer zu diesen Werkzeugen gar nicht etwas ist, das ein für alle Mal erledigt werden kann."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datalogi i uddannelsen"
      ],
      "german": [
        "<span class=\"alt-term\">Datalogie / Informatik</span> in Ausbildungen"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Har man således indset at datalogien på den ene side sammenfatter en lang række centrale menneskelige aktiviteter og begrebsdannelser under ét samlende synspunkt, og på den anden side formår at befrugte og forny tankegangen i en lige så lang række fag, da kan man ikke være i tvivl om at datalogien må have en plads i almenuddannelsen. For at nå til en rimelig forestilling om hvordan denne placering bør være er det naturligt at sammenligne med fag af lignende karakter. Man vil da nå frem til sproglære og matematik, som er de nærmeste analoge. Både datalogien og disse to fagområder beskæftiger sig med tegn og symboler der er opfundet af mennesker som hjælpemidler. Fælles for de tre emner er også deres karakter af redskaber for mange andre fag. I uddannelsen må de derfor indgå på to måder, dels som hjælpefag ved studier af mange andre fag, dels som hovedfag ved uddannelsen af specialister i selve disse emner. Vi har jo alle måttet gennemgå meget betydelige mængder sprog, regning og matematik i skolen, uanset at kun ganske få af os er blevet lingvister eller matematikere. På lignende måde må datalogien bringes ind i skoleundervisningen og forberede os alle på tilværelsen i datamaternes tidsalder, ganske som læsning og skrivning anses som en nødvendig forudsætning for tilværelsen i et samfund der er præget af tryksager.",
        "Datalogien kan tænkes placeret i skoleundervisningen, enten som et selvstændigt fag, eller som en del af matematikken. Det afgørende er indholdet af undervisningen. Hovedtemaerne må være data, datarepræsentationer, og dataprocesser. Disse fundamentale begreber må belyses gennem en række konkrete eksempler som bekvemt kan tages fra områder inden for skoleelevernes erfaringsområde, talregning, stavning, opslag i registre, og lignende. Der bør også indgå simple eksempler på brugen af mekaniske og elektriske fænomener til datarepræsentation. Disse eksempler bør belyses ved simple forsøg. Datamaterne bør også omtales, men ikke som det centrale i faget, snarere som en afsluttende orientering.",
        "Når datalogien er blevet vel etableret i almen uddannelsen vil den mystik der omgiver datamaterne i manges forestillinger opløse sig i intet. Dette må betragtes som den måske allervigtigste begrundelse for at fremme forståelsen af datalogien. Det vil nemlig være betingelsen for at herredømmet over datamaterne og deres anvendelse ikke bliver en sag for en lille gruppe af eksperter, men bliver en sædvanlig politisk sag, og således gennem det politiske system kommer til at ligge hvor det bør, hos os alle."
      ],
      "german": [
        "Hat man also erkannt, dass <span class=\"alt-term\">Datalogie / Informatik</span> auf der einen Seite eine lange Reihe zentraler menschlicher Aktivitäten und Begriffsbildungen unter einen gemeinsamen Standpunkt zusammenfasst, und dass sie auf der anderen Seite fähig ist, in einer genauso langen Reihe Fächer die Denkweise zu befruchten und zu erneuern, so kann man nicht im Zweifel darüber bleiben, dass <span class=\"alt-term\">Datalogie / Informatik</span> einen Platz in der Allgemeinbildung haben muss. Um eine vernünftige Vorstellung davon zu bekommen, wie dieser Platz sein sollte, ist es natürlich, mit Fächern von ähnlichem Charakter zu vergleichen. Dies führt zu der Sprachlehre und Mathematik, die am ehesten vergleichbar sind. Sowohl die <span class=\"alt-term\">Datalogie / Informatik</span> als auch diese beiden Themenbereiche beschäftigen sich mit Zeichen und Symbolen, die von Menschen als Hilfsmittel erfunden wurden. Gleich für diese drei Fächer ist auch deren Charakter als Werkzeuge für viele andere Fächer. In der Ausbildung müssen sie daher auf zwei Arten eingehen: teils als Hilfsfächer für das Studieren von vielen anderen Fächern, teils als Hauptfächer bei der Ausbildung von Spezialisten in diesen Fächern selbst. Wir haben ja schließlich alle in großen Umfang Sprache, Rechnung und Mathematik in der Schule gelernt, auch wenn nur ganz wenige von uns Linguisten oder Mathematiker geworden sind. In ähnlicher Weise muss die <span class=\"alt-term\">Datalogie / Informatik</span> in die Schullehre gebracht werden und uns alle auf die Existenz im Zeitalter der Datenautomaten vorbereiten, ganz so wie Lesen und Schreiben als notwendige Voraussetzung für die Existenz in einer Gesellschaft, die von Drucksachen geprägt ist, angesehen werden.",
        "<span class=\"alt-term\">Datalogie / Informatik</span> kann im Schulunterricht entweder als eigenständiges Fach, oder als ein Teil der Mathematik, gedacht werden. Entscheidend ist der Inhalt des Unterrichts. Die Hauptthemen sollten Daten, Datendarstellungen und Datenprozesse sein. Diese fundamentalen Begriffe müssen durch eine Reihe von konkreten Beispielen veranschaulicht werden, die bequem aus dem Erfahrungsbereich der Schüler genommen werden können &ndash; wie Zahlrechnung, Rechtschreibung, Nachschlagen in Registern, und dergleichen. Es sollten auch einfache Beispiele für den Gebrauch von mechanischen und elektrischen Phänomene zur Datendarstellung enthalten sein. Diese Beispiele sollten durch einfache Versuche veranschaulicht werden. Datenautomaten sollten auch erwähnt werden, aber nicht als Kernstück des Faches, sondern eher als abschließende Orientierung.",
        "Wenn die <span class=\"alt-term\">Datalogie / Informatik</span> also erst einmal in der Allgemeinbildung etabliert ist, wird sich die Mystik, die die Datenautomaten in vielen Vorstellungen umgibt, auflösen. Dies darf vielleicht als die allerwichtigste Begründung für die Förderung des Verständnisses von <span class=\"alt-term\">Datalogie / Informatik</span> verstanden werden. Dies wird nämlich die Voraussetzung dafür sein, dass die Herrschaft über Datenautomaten und deren Anwendung nicht eine Sache von einer kleinen Gruppe von Experten bleibt, sondern eine übliche politische Sache wird, und somit durch das politische System dorthin gelangt, wo sie sein sollte, nämlich bei uns allen."
      ]
    },
    {
      "type": "section",
      "danish": [
        "DATAMATERNES STRUKTUR OG ARBEJDEMÅDE"
      ],
      "german": [
        "Die Struktur und Arbeitsweise der Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Verden over findes der i dag omkring 50.000 datamater i brug og tallet er hastigt stigende. Hvert af disse anlæg repræsenterer en investering af gennemsnitlig omkring en million kroner. Blot disse tal siger noget om datamaternes samfundsmæssige betydning. Ved denne forelæsning skal vi se lidt nærmere på hvordan disse mange anlæg er opbygget. Vi skal altså supplere den første forelæsnings historiske perspektiv med et billede af hvor vi står i dag.",
        "Nutidens datamater adskiller sig indbyrdes i nogen grad med hensyn til størrelse og hurtighed, mens der er betydelige ligheder i deres indre struktur. Denne strukturelle lighed er ikke tilfældig, den afspejler et hierarki som vi allerede kender fra den måde hvorpå data håndteres uden for datamaterne. Det er nemlig her vi bør begynde gennemgangen, ved datamaternes lagring af data. Denne side af datamaterne er ofte blevet betegnet som deres hukommelse, et ord der dog er unødigt psykologiserende. Jeg vil derfor holde mig til ordene lager og lagring."
      ],
      "german": [
        "Weltweit sind derzeit rund 50.000 Datenautomaten im Einsatz und ihre Zahl steigt stark. Jede dieser Anlagen stellt eine Investition von durchschnittlich etwa einer Million Kronen dar <sup class=\"footnote-ref\" data-footnote-id=\"3.1\">3.1</sup>. Allein diese Zahlen sagen etwas über die gesellschaftliche Bedeutung der Datenautomaten. In dieser Vorlesung werden wir uns etwas genauer ansehen, auf welche Weise diese vielen Anlagen aufgebaut sind. Wir werden somit die historische Perspektive des ersten Vorlesungsteils um ein Bild ergänzen, wo wir heute stehen.",
        "Die heutigen Datenautomaten unterscheiden sich untereinander in gewissem Maße in Bezug auf Größe und Geschwindigkeit, während es bedeutende Ähnlichkeiten in ihrer inneren Struktur gibt. Diese strukturelle Ähnlichkeit ist nicht zufällig: sie spiegelt eine Hierarchie wider, die wir bereits von der Art und Weise kennen, wie Daten außerhalb der Datenautomaten gehandhabt werden. Zu diesem Zeitpunkt sollten wir damit beginnen, uns mit der Speicherung von Daten in den Datenautomaten zu befassen. Dieser Aspekt der Datenautomaten wurde oft als ihr Gedächtnis bezeichnet &ndash; ein Wort, das jedoch unnötig psychologisierend ist. Ich werde deshalb die Worte <em>Speicher</em> und <em>speichern</em> benutzen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datalagring i datamater"
      ],
      "german": [
        "Datenspeichern im Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Det der lagres i en datamat er data, eller for at repetere definitionen fra den anden forelæsning: en repræsentation af fakta eller forestillinger på en formaliseret måde, der kan kommunikere eller manipulere ved en eller anden proces. Hvad det er for fakta eller forestillinger der repræsenteres i vore datamater vil vi tale mere om i senere forelæsninger. For øjeblikket er det tilstrækkeligt at tænke sig at det kan være tekster af enhver art, for eksempel navne og adresser, rapporter, eller talmaterialer. Hvad der interesserer os nu er repræsentationen af teksterne. Her er det praktisk først at slå fast at disse repræsentationer falder i tre grupper, for det første sådanne som er egnede til at sende data udefra ind i datamaten, for det andet dem som kan bruges ved overføring den omvendte vej, fra datamaten og ud til omverdenen, og for det tredie sådanne repræsentationer som er egnede for datamatens helt interne arbejde.",
        "For nu at begynde med de sidstnævnte, de interne repræsentationer, så må vi konstatere at selve den idé at udskille denne funktion som noget særskilt, der ikke teknisk behøver at løses på en måde der minder om dem der benyttes ved datamaternes ydre kommunikation, denne idé er af største betydning. Det er kun ved at erkende at man ved den indre datalagring ikke behøver at skele til muligheden af at de data som findes lagrede skal kunne aflæses af andre end datamaten selv, at man har kunnet opnå de store arbejdshastigheder.",
        "Det krav der må stilles til den interne datarepræsentation er at datamaten sikkert og hurtigt må kunne kommunikere de data der findes lagret. De lagrede data må altså kunne aflæses af datamaten, men tillige må der være steder at aflevere det der aflæses. Man indser snart at man enten må have et system der ubegrænset kan vedblive at rumme flere data, eller også må vi benytte repræsentationer der tillader at data slettes, som man sletter en tavle med en våd svamp. Det er selvsagt den anden af disse fremgangsmåder der er mest økonomisk og det er også den der må betragtes som grundlæggende i datamaterne.",
        "Som yderligere understregning af dette princip, at slette data, kan man drage en sammenligning med det der foregår i de fleste hjem hver dag. Hvis man får en daglig avis er dette en vis mængde data, som sædvanligvis lægges fremme på et bestemt sted, måske et avisbord. Den daglige ombytning af den gamle avis med en ny er nøje analog med sletningen af data på et bestemt sted i en datamat og lagringen af ny data på det samme sted. De processer datamaten udfører på de lagrede data svarer i dette billede til at avisen læses og at indholdet diskuteres og på anden måde bruges af familien.",
        "Til intern datalagring i datamater kan man dog ikke bruge så grove ting som papir og tryksværte, men man må for at opnå den ønskede letbevægelighed og derved hurtighed benytte svage ændringer i små faste genstande, for eksempel ændringer i magnetiseringen i små keramiske ringe, såkaldte ferritkerner. Man sørger også for at bruge forandringer der kun er forbigående, således at den samme ring kan ændres til at lagre nye data om og om igen så tit man ønsker det. Denne arbejdsmåde svarer til det der sker på et fjernsynsrørs skærm, hvor de enkelte punkter stadig modtager ny impulser som dele af stadig nye billeder. Der er dog den forskel at hver lagercelle 1 en datamat normalt indrettes til at bevare de sidst modtagne data uændret indtil datamatens arbejde direkte ændrer dem. Et datalager opbygget af ferritkerner tillader at enhver del af de lagrede data er tilgængelig for datamatens procesdel inden for nogle få milliontedele af et sekund.",
        "Moderne datamater udstyres normalt med et primært lager med en kapacitet af mellem 10.000 og nogle millioner tegn. Dette er ikke nogen overvældende størrelse sammenlignet med omfanget af de datamængder man er interesseret i at håndtere. Til sammenligning kan nævnes at en enkelt avisside kan rumme omkring 40.000 tegn.",
        "For at kunne beherske mere omfattende datamængder suppleres det primære lager med sekundære lagre eller baggrundslagre af langt større kapacitet, men med større tilgangstider, hvorved de store kapaciteter kan realiseres inden for økonomisk fornuftige rammer. Blandt de vigtigste lagringsmetoder der bruges på denne måde må nævnes indspilning på magnetbånd, efter det samme princip som kendes fra båndoptagere til hjemmebrug. En anden lagringsform er det såkaldte tromlelager, hvor man til datarepræsentationen igen benytter stoffers magnetisering, men hvor det magnetiserbare stof findes som et tyndt lag på overfladen af en roterende cylinder hvorved det stadig passerer forbi faststående ind- og afspillehoveder, der virker som i båndoptageren.",
        "Til at klargøre datamaternes lagerstruktur kan man igen drage en analogi til den sædvanlige tilværelse. Vi har allerede talt om avisbordet med dagens avis. Hvis vi vil se en analogi til de større datamængder der findes i en datamats baggrundslagre, kan man tænke på hjemmets bogsamling. Hvis denne er lille kan den godt være direkte for hånden, men det vil være mere besværligt at finde frem til en søgt oplysning jo større samlingen er. I et bogelskende hjem vil bogsamlingen ofte være spredt omkring i værelserne og det kan være nødvendigt at søge omkring efter en bestemt bog. De forskellige hylder og deres tilgængelighed er da analoge med de forskellige former for baggrundslagre og besværet med at finde en bog svarer til tilgangstiden for disse lagre. Det forstås også umiddelbart at man ved brugen af datamaten må lægge stor vægt på at placere de forskellige dele af de data der indgår i et problem således at de der bruges hyppigst til enhver tid er tilgængelige i de hurtigste lagre, ligesom man i sit hjem vil tage de bøger man for tiden er ved at bruge frem fra deres mere faste pladser på hylderne og for eksempel midlertidigt lade dem ligge på natbordet."
      ],
      "german": [
        "Was in einem Datenautomaten gespeichert wird, sind <em>Daten</em>, oder um die Definition aus der zweiten Vorlesung zu wiederholen: Jede beliebige Darstellung von Tatsachen oder Ideen auf eine formalisierte Weise, die durch irgendeinen Prozess kommuniziert oder manipuliert werden kann.",
        "Was es für Tatsachen oder Ideen sind, die in unseren Datenautomaten dargestellt werden, werden wir in späteren Vorlesungen näher erörtern. Für den Moment reicht es, zu denken, dass es sich um Texte jeder Art handeln kann, wie zum Beispiel Namen und Adressen, Berichte oder Zahlenmaterial. Was uns jetzt interessiert, ist die Darstellung der Texte. Hier ist es zunächst praktisch festzustellen, dass diese Darstellungen in drei Gruppen fallen: erstens solche, die geeignet sind, Daten von außen in den Datenautomaten zu senden; zweitens solche, die für die Übertragung in die entgegengesetzte Richtung, vom Datenautomaten nach außen, verwendet werden können; und drittens solche Darstellungen, die für die gänzlich interne Arbeit des Datenautomaten geeignet sind.",
        "Um nun mit den zuletzt genannten, den internen Darstellungen, zu beginnen, so müssen wir feststellen, dass allein die Idee, diese Funktion als etwas Eigenständiges abzusondern, von größter Bedeutung ist. Die interne Darstellung muss technisch nicht in einer Weise gelöst werden, die den bei der externen Kommunikation der Datenautomaten verwendeten Methoden ähnelt. Nur durch diese Erkenntnis, also dass man bei der internen Datenspeicherung nicht darauf achten muss, dass die gespeicherten Daten von anderen als dem Datenautomaten selbst gelesen werden können, konnte man diese hohen Arbeitsgeschwindigkeiten erreichen.",
        "Die Anforderung, die an die interne Datendarstellung gestellt werden muss, ist, dass der Datenautomat die (in ihm) gespeicherten Daten sicher und schnell kommunizieren können muss. Die gespeicherten Daten müssen also vom Datenautomaten gelesen werden können, aber es muss auch Orte geben, um das Gelesene auszugeben. Man erkennt bald, dass man entweder ein System haben muss, das unbegrenzt fortfahren kann, mehr Daten zu speichern, oder wir müssen Darstellungen verwenden, die erlauben, dass Daten gelöscht werden, wie man eine Tafel mit einem nassen Schwamm löscht. Selbstverständlich ist die zweitgenannte dieser Vorgehensweisen die wirtschaftlichste, und sie ist auch die, die als grundlegend in den Datenautomaten betrachtet werden muss.",
        "Zur weiteren Betonung dieses Prinzips &ndash; des Löschens von Daten &ndash; kann man einen Vergleich mit dem ziehen, was in den meisten Haushalten jeden Tag passiert. Wenn man eine Tageszeitung bekommt, ist dies eine bestimmte Menge an Daten, die normalerweise an einem bestimmten Ort, vielleicht auf einem Zeitungstisch, bereitgelegt wird. Der tägliche Austausch der alten Zeitung durch eine neue ist genau analog zum Löschen von Daten an einem bestimmten Ort in einem Datenautomaten und dem Speichern neuer Daten am selben Ort. Die Prozesse, die der Datenautomat auf den gespeicherten Daten ausführt, entsprechen in diesem Vergleich dem Lesen der Zeitung, dem Diskutieren des Inhalts und der anderweitigen Nutzung durch die Familie.",
        "Für die interne Datenspeicherung in Datenautomaten kann man jedoch nicht so grobe Dinge wie Papier und Druckerschwärze verwenden, sondern man muss, um die gewünschte Beweglichkeit und damit Geschwindigkeit zu erreichen, schwache Veränderungen in kleinen festen Gegenständen nutzen, zum Beispiel Veränderungen in der Magnetisierung kleiner keramischer Ringe, den sogenannten <em>Ferritkernen</em> <sup class=\"footnote-ref\" data-footnote-id=\"3.2\">3.2</sup>. Man sollte auch Veränderungen verwenden, die nur vorübergehend sind, sodass derselbe Ring immer wieder verändert werden kann, um neue Daten so oft zu speichern, wie man möchte. Diese Arbeitsweise entspricht dem, was auf dem Bildschirm eines Fernsehgeräts passiert, wo die einzelnen Punkte ständig neue Impulse empfangen, als Teile immer neuer Bilder. Es gibt jedoch den Unterschied, dass jede Speicherzelle in einem Datenautomaten normalerweise so eingerichtet ist, dass sie die zuletzt empfangenen Daten unverändert aufbewahrt, bis die Arbeit des Datenautomaten sie direkt verändert. Ein aus Ferritkernen aufgebauter Datenspeicher ermöglicht es, dass jeder Teil der gespeicherten Daten für den Prozessor des Datenautomaten innerhalb von einigen Millionstel Sekunden zugänglich ist.",
        "Moderne Datenautomaten sind normalerweise mit einem primären Speicher mit einer Kapazität von zwischen 10.000 und einigen Millionen Zeichen ausgestattet. Dies ist, verglichen mit dem Umfang der Datenmengen, die man zu bearbeiten interessiert ist, keine überwältigende Größe. Zum Vergleich kann erwähnt werden, dass eine einzelne Zeitungsseite etwa 40.000 Zeichen enthalten kann.",
        "Um umfangreichere Datenmengen beherrschen zu können, wird der primäre Speicher durch sekundäre Speicher oder Hintergrundspeicher mit deutlich größerer, jedoch mit längeren Zugriffszeiten, ergänzt. Hierdurch können große Kapazitäten innerhalb wirtschaftlich vernünftiger Rahmenbedingungen realisiert werden. Unter den wichtigsten Speichermethoden, die auf diese Weise verwendet werden, muss die Aufzeichnung auf Magnetbändern erwähnt werden, die nach dem gleichen Prinzip wie bei Tonbandgeräten für den Heimgebrauch passiert. Eine andere Speicherform ist der sogenannte Trommelspeicher, bei dem zur Datendarstellung erneut die Magnetisierung von Materialien verwendet wird &ndash; wobei das magnetisierbare Material als eine dünne Schicht auf der Oberfläche eines rotierenden Zylinders vorhanden ist, der ständig an feststehenden Les- und Schreibköpfen vorbeikommt, die wie in einem Tonbandgerät funktionieren.",
        "Um die Speicherstruktur der Datenautomaten zu verdeutlichen, kann man erneut einen Vergleich mit dem gewöhnlichen Alltag ziehen. Wir haben bereits über den Zeitungstisch mit der Tageszeitung gesprochen. Wenn wir eine Analogie zu den größeren Datenmengen sehen wollen, die in den Hintergrundspeichern eines Datenautomaten vorhanden sind, kann man an die Büchersammlung zu Hause denken. Wenn diese klein ist, kann sie leicht griffbereit sein, aber es wird schwieriger sein, eine gesuchte Information zu finden, je größer die Sammlung ist. In einem buchliebenden Zuhause wird die Büchersammlung oft über mehrere Zimmer verteilt sein, und es kann notwendig sein, nach einem bestimmten Buch zu suchen. Die verschiedenen Regale und ihre Zugänglichkeit sind dann analog zu den verschiedenen Formen von Hintergrundspeichern, und die Mühe, ein Buch zu finden, entspricht der Zugriffszeit auf diese Speicher. Es versteht sich auch sofort, dass man bei der Nutzung des Datenautomaten großen Wert darauf legen muss, die verschiedenen Teile der Daten, die zu einem Problem gehören, so zu platzieren, dass die am häufigsten verwendeten jederzeit in den schnellsten Speichern verfügbar sind, so wie man zu Hause die Bücher, die man gerade verwendet, von ihren festen Plätzen in den Regalen nimmt und sie beispielsweise vorübergehend auf dem Nachttisch liegen lässt."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamaternes ydre kommunikation"
      ],
      "german": [
        "Die äußere Kommunikation der Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "De apparater der i dag benyttes ved kommunikation mellem datamater og mennesker er allerede kort omtalt i den første forelæsning og omfatter blandt andet skrivemaskiner, tegnemaskiner, fjernsynsskærme med tilhørende pegepinde, højttalere, mikrofoner, og skriftlæsere. En betydningsfuld del af den måde kommunikationen foregår er knyttet til datamatens betjering af forskellige apparater der samtidig er forbundet med den. Der ligger et problem i at undgå at det meste af datamatens tid kommer til at gå med at vente på disse forholdsvis langsomme apparater, eller på mennesker der betænker sig. I nutidens mere avancerede datamatiske systemer løses dette problem ved at datamaten er i stand til at dele sin proceskapacitet mellem mange forskellige opgaver. Ordningen ligner den man bruger på et kontor der både må tage sig af kunder og andet arbejde. Kontoristerne deler her deres tid mellem at betjene kunderne, når de er der, og at udføre andet arbejde i pauserne mellem kunderne. Systemet er betinget af at kontoristerne regelmæssig kaster et blik mod betjeningsdisken og konstaterer om der er kommet nye kunder til. Nutidens datamater kan på lignende måde veksle mellem at betjene kommunikation udadtil og at gennemføre mere omfattende interne processer. Med deres store hastighed kan de veksle mellem disse aktiviteter mange gange i sekundet og mennesker der kommunikerer med dem vil få den illusion at de betjenes uafbrudt.",
        "Med denne teknik bliver det muligt at benytte løse forbindelser mellem datamaten og det apparat der er i hænderne på brugeren. I særdeleshed kan man bruge sædvanlige telefonlinier og det bliver muligt at mange abonnenter har hver sin skrivemaskine og kan kalde en central datamat så tit de vil. Dette system har for længst vundet indpas til særlige formål, for eksempel pladsbestillingssystemer, men er også ved at trænge frem til almindelige formål.",
        "Ved kommunikation mellem datamater og andet apparatur benyttes papirstrimler, hulkort, eller magnetbånd som databærende medier, idet valget afgøres af procesbekvemmeligheden og hurtigheden. Magnetbånd tillader de største overføringshastigheder. Det er ikke usædvanligt at de pr. sekund kan overføre op mod 100.000 tegn, altså adskillige avissiders tekst.",
        "Endnu større overføringshastigheder er mulige ved en direkte transmission af data fra én datamat til en anden. Hvis denne teknik benyttes kan det dog knap nok betegnes som kommunikation ud ad datamaten, der er snarere tale om at de to datamater må betragtes som ét mere omfattende datamatisk system. kation ud ad datamaten, der er snarere tale om at de to datamater må betragtes som ét mere omfattende datamatisk system."
      ],
      "german": [
        "Die Geräte, die heute bei der Kommunikation zwischen Datenautomaten und Menschen verwendet werden, wurden bereits kurz im der ersten Vorlesungseinheit erwähnt und umfassen unter anderem Schreibmaschinen, Zeichenmaschinen, Fernseherbildschirme mit dazugehörigen Zeigestiften, Lautsprecher, Mikrofone und Schriftlesegeräte. Ein bedeutender Teil der Art und Weise, wie die Kommunikation abläuft, ist mit der Steuerung verschiedener Geräte durch den Datenautomaten verbunden, die gleichzeitig mit ihm verbunden sind. Ein (zu lösendes) Problem ist, zu vermeiden, dass der größte Teil der Zeit des Datenautomaten darauf verwendet wird, auf diese relativ (zum Datenautomaten) langsamen Geräte oder auf nachdenkende Menschen zu warten. In den heutigen fortschrittlicheren <span class=\"alt-term\">datenverarbeitenden / informatischen</span> Systemen wird dieses Problem gelöst, indem der Datenautomat in der Lage ist, seine Prozesskapazität zwischen vielen verschiedenen Aufgaben zu teilen. Das System ähnelt dem, das man in einem Büro verwendet, das sowohl Kunden als auch andere Arbeiten betreuen muss. Die Büroangestellten teilen hier ihre Zeit zwischen dem Bedienen der Kunden, wenn diese da sind, und dem Ausführen anderer Arbeiten in den Pausen zwischen den Kunden. Das System beruht darauf, dass die Büroangestellten regelmäßig einen Blick auf den Schalter werfen und überprüfen, ob neue Kunden angekommen sind. Die heutigen Datenautomaten können auf ähnliche Weise zwischen dem Bedienen der externen Kommunikation und dem Durchführen umfangreicherer interner Prozesse wechseln. Mit ihrer großen Geschwindigkeit können sie viele Male pro Sekunde zwischen diesen Aktivitäten wechseln, sodass Menschen, die mit ihnen kommunizieren, die Illusion haben, dass sie ununterbrochen bedient werden würden.",
        "Mit dieser Technik wird es möglich, lose (also nicht fest verbundene) Verbindungen zwischen dem Datenautomaten und dem Gerät, das sich in den Händen des Benutzers befindet, zu verwenden. Insbesondere kann man gewöhnliche Telefonleitungen verwenden, und es wird möglich, dass viele Abonnenten ihre eigene Schreibmaschine haben und eine zentrale Datenmaschine so oft anrufen können, wie sie möchten. Dieses System hat längst für besondere Zwecke, wie zum Beispiel Platzreservierungssysteme, Einzug gehalten, setzt sich aber aktuell auch für allgemeine Zwecke durch.",
        "Bei der Kommunikation zwischen Datenautomaten und anderen Geräten werden Papierstreifen, Lochkarten oder Magnetbänder als datentragende Medien verwendet, wobei die Wahl durch die Prozessbequemlichkeit und -geschwindigkeit bestimmt wird. Magnetbänder ermöglichen die höchsten Übertragungsgeschwindigkeiten. Es ist nicht ungewöhnlich, dass sie pro Sekunde bis zu 100.000 Zeichen übertragen können, also den Text von mehreren Zeitungsseiten.",
        "Noch höhere Übertragungsgeschwindigkeiten sind bei der direkten Übertragung von Daten von einem Datenautomaten zu einem anderen möglich. Wenn diese Technik verwendet wird, kann es jedoch kaum als Kommunikation aus dem Datenautomaten heraus bezeichnet werden, es handelt sich vielmehr darum, dass die beiden Datenautomaten als ein umfassenderes <span class=\"alt-term\">datenverarbeitendes / informatisches</span> System betrachtet werden müssen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Dataprocesser i datamaterne"
      ],
      "german": [
        "Datenprozesse in den Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Datalagringen er kun den ene side af datamaterne, den anden, og nok mere spændende, side er procesdelen eller styreenheden. For at give en forståelse af det der foregår her må vi berøre tre forskellige forhold. Det første er selve procesbegrebet, det andet er hvad det er for processer der overhovedet kommer på tale i en datamat, og det tredie er spørgsmålet om hvad det er for processer der bringes til udførelse ved en konkret brug af en datamat. Af disse er det tredie spørgsmål så omfattende at det vil behøve hele den næste forelæsning, mens vi i dag skal tale om de to første.",
        "Altså, procesbegrebet. Heri ligger at noget sker igennem en vis periode i tiden. I kemien taler man om processer hvor der sker en omdannelse af stoffer fra én form til en anden. I datalogien beskæftiger vi os med omdannelser af data. Et velkendt eksempel er almindelig talregning, som børnene lærer den i skolen. For at lægge en kolonne tal sammen går vi skridtvis frem, begynder med etterne og danner via en række mellemresultater summen af dem, som vi nedskriver som sidste ciffer af resultatet og som mente. Derefter går vi videre med tierne på samme måde, osv. Disse forestillinger om de enkelte elementære skridt på vejen og om mellemresultater der kun har interesse en kort stund, er vigtige omstændigheder ved dataprocesbegrebet.",
        "Det der foregår i en datamats styreenhed kan groft betragtes som netop en følge af elementære processer, idet vi ser bort fra at der i de fleste datamater også i et begrænset omfang tillades et samtidigt forløb af flere processer. Blandt de mulige elementære processer som en datamats styreenhed kan kalde til udførelse har vi allerede omtalt flytning af data. Der kan her skelnes mellem tre arter, svarende til kommunikation ind i datamaten, ud fra datamaten, eller fra et sted i det indre lager til et andet, idet man samtidig sletter hvad der stod i forvejen.",
        "Elementære dataprocesser der er mere indviklede end flytninger foregår i det væsentlige efter opskriften: tag de data der står lagret i et eller nogle få opgivne steder i det indre lager, lad disse dataværdier blive kombineret efter en bestemt opgivet forskrift således at der dannes nye data som resultat, og flyt derefter dette til et opgivet sted i lageret. Som eksempler på de forskrifter der kan komme på tale kan man nævne sammenligning for at konstatere hvorvidt de to dataværdier er ens, en proces der kun kan føre til et af to resultater, ja eller nej. Andre eksempler er regneprocesser som addition, subtraktion, multiplikation, og division, hvor de to dataværdier øjensynlig må repræsentere tal.",
        "De elementære dataprocesser der fra konstruktørens side bygges ind i nutidens datamater er alle ret simple. Division af to tal er faktisk noget nær det mest indviklede. Alle yderligere komplikationer i de processer man ønsker at få gennemført må realiseres ved at man lader datamaten udføre en følge af elementære processer. Hvis vi for eksempel ønsker at danne summen af tre tal går vi frem i to tempi, adderer altså først de to af dem og derefter resultatet heraf til det tredie, Normalt vil der til at løse mere indviklede dataprocesproblemer indgå et stort antal elementære processer, antal af tusinder eller millioner er ikke usædvanlige.",
        "Når sådanne opgaver alligevel er praktisk gennemførlige beror det på at de moderne datamater kan udføre de elementære processer så hurtigt. Datamater der pr. sekund kan udføre 10.000 elementære processer regnes i dag for langsomme, mens de mest ydedygtige når op på en million processer pr. sekund eller mere.",
        "Disse tal er ikke mindre forbavsende for dem der selv har været med til at udvikle apparaturet end for den udenforstående menigmand. Hver gang man som bruger af en datamat tænker på hvad hvad der foregår når den arbejder — ofte gennemfører den på få sekunder hvad man selv har været uger eller måneder om at udtænke — så må man forbløffes påny. Lad os derfor som afslutning på denne forelæsning overveje hvorpå denne hurtighed beror. Dette vil også kaste nyt lys over datalogiens grundbegreber."
      ],
      "german": [
        "Die Datenspeicherung ist nur die eine Seite der Datenautomaten. Die andere, und wahrscheinlich spannendere, Seite ist der Prozessbereich bzw. die Steuereinheit. Um ein Verständnis dessen zu geben, was hier vor sich geht, müssen wir drei verschiedene Aspekte ansprechen. Der erste ist das eigentliche Prozesskonzept, der zweite ist, welche Prozesse überhaupt in einem Datenautomaten in Betracht kommen, und der dritte ist die Frage, welche Prozesse bei der konkreten Nutzung eines Datenautomaten ausgeführt werden. Von diesen ist die dritte Frage so umfassend, dass sie die gesamte nächste Vorlesung erfordert, während wir heute über die ersten beiden sprechen werden.",
        "Also, das Prozesskonzept. Hierin liegt, dass etwas über einen bestimmten Zeitraum hinweg geschieht. In der Chemie spricht man von Prozessen, bei denen eine Umwandlung von Stoffen von einer Form in eine andere geschieht. In der Informatik beschäftigen wir uns mit der Umwandlung von Daten. Ein bekanntes Beispiel ist die gewöhnliche Zahlenrechnung, wie sie die Kinder in der Schule lernen. Um eine Spalte von Zahlen zusammenzuzählen, gehen wir schrittweise vor, beginnen mit den Einern und bilden über eine Reihe von Zwischenergebnissen die Summe, die wir als letzte Ziffer des Ergebnisses und als Übertrag notieren. Danach machen wir mit den Zehnern auf die gleiche Weise weiter, usw. Diese Vorstellungen von den einzelnen elementaren Schritten auf dem Weg und von Zwischenergebnissen, die nur für kurze Zeit von Interesse sind, sind wichtige Aspekte des Datenprozesskonzepts.",
        "Das, was in der Steuereinheit eines Datenautomaten vor sich geht, kann grob als eine Abfolge elementarer Prozesse betrachtet werden, wobei wir außer Acht lassen, dass in den meisten Datenautomaten auch in begrenztem Umfang das gleichzeitige Ablaufen mehrerer Prozesse erlaubt ist. Unter den möglichen elementaren Prozessen, die die Steuereinheit eines Datenautomaten zur Ausführung aufrufen kann, haben wir bereits die Datenverschiebung erwähnt. Hier kann zwischen drei Arten unterschieden werden, entsprechend der Kommunikation in den Datenautomaten hinein, aus dem Datenautomaten heraus oder von einem Ort im internen Speicher zu einem anderen, wobei gleichzeitig das gelöscht wird, was zuvor dort stand.",
        "Elementare Datenprozesse, die komplizierter sind als Verschiebungen, laufen im Wesentlichen nach dem Schema ab: Nimm die Daten, die an einem oder einigen wenigen angegebenen Stellen im internen Speicher gespeichert sind, lass diese Datenwerte nach einer bestimmten vorgegebenen Vorschrift kombiniert werden, sodass als Ergebnis neue Daten entstehen, und verschiebe diese dann zu einer angegebenen Stelle im Speicher. Als Beispiele für die Vorschriften, die in Betracht kommen können, kann man den Vergleich nennen, um festzustellen, ob die beiden Datenwerte gleich sind – ein Prozess, der nur zu einem von zwei Ergebnissen führen kann: ja oder nein. Andere Beispiele sind Rechenprozesse wie Addition, Subtraktion, Multiplikation und Division, wobei die beiden Datenwerte offensichtlich Zahlen repräsentieren müssen.",
        "Die elementaren Datenprozesse, die seitens des Konstrukteurs in heutige Datenautomaten eingebaut werden, sind alle recht simpel. Die Division von zwei Zahlen ist tatsächlich so ziemlich das Komplizierteste. Alle weiteren Funktionen in den Prozessen, die man durchführen möchte, müssen dadurch realisiert werden, dass man den Datenautomaten eine Abfolge elementarer Prozesse ausführen lässt. Wenn wir zum Beispiel die Summe von drei Zahlen bilden möchten, gehen wir in zwei Schritten vor. Wir addieren zuerst zwei von ihnen und dann das Ergebnis hiervon zur dritten Zahl. Normalerweise wird für die Lösung komplizierterer Datenprozessprobleme eine große Anzahl elementarer Prozesse erforderlich sein, eine Anzahl von Tausenden oder Millionen ist nicht ungewöhnlich.",
        "Dass solche Aufgaben dennoch praktisch durchführbar sind, beruht darauf, dass moderne Datenautomaten die elementaren Prozesse sehr schnell ausführen können. Datenautomaten, die pro Sekunde 10.000 elementare Prozesse ausführen können, gelten heute als langsam, während die leistungsfähigsten auf eine Million Prozesse pro Sekunde oder noch mehr kommen.",
        "Diese Zahlen sind nicht weniger erstaunlich für diejenigen, die selbst bei der Entwicklung der Geräte mitgewirkt haben, als für den außenstehenden Durchschnittsmenschen. Jedes Mal, wenn man als Benutzer eines Datenautomaten darüber nachdenkt, was geschieht, wenn er arbeitet -– oft führt er in wenigen Sekunden das durch, wofür man selbst Wochen oder Monate gebraucht hat, um es zu entwickeln –- dann muss man aufs Neue erstaunt sein. Lassen Sie uns daher zum Abschluss dieser Vorlesung überlegen, worauf diese Geschwindigkeit beruht. Dies wird auch neues Licht auf die Grundbegriffe der Datalogie werfen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamaternes hurtighed"
      ],
      "german": [
        "Die Geschwindigkeit der Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Vi må huske at data er sædvanlige begivenheder i verden og at bearbejdning af data altid må gennemføres ved tilsvarende ændringer af virkelige, og ikke blot tænkte, ting i verden.",
        "Vi har imidlertid en ubegrænset frihed til at vælge hvorledes vore data repræsenteres og hvad det er for forandringer der svarer til processerne. Dette er i direkte modsætning til bearbejdning af genstande der bruges som de er. En bil, for eksempel, bruges til at køre i sådan som den er. For den der fremstiller bilen er der ingen vej udenom at forme og flytte rundt med selve de jernstykker der indgår i den. Ved dataprocesser har vi derimod en høj grad af frihed, selv når den form hvori de endelige resultater ønskes er fastlagt på forhånd. Til mellemresultaterne kan vi ofte helt glemme den endelige form og vælge en datarepræsentation der er bekvem for processen. Ved at udnytte denne frihed fuldt ud opnår vi den enorme hurtighed i dataprocesserne.",
        "Ved at forfølge denne tankegang kan man uden videre forstå den tekniske udviklingslinie der er fulgt i de seneste årtier. Overgangen fra at bruge mekaniske dele, som tandhjul, til at bruge elektronrør betød at man gik over fra at dataprocessen krævede en flytning af dele der var store nok til at bearbejdes mekanisk til at den blot krævede en flytning af de umådelig meget lettere elektroner. Den senere udvikling har betydet en stadig reduktion i størrelsen af de elektriske komponenter, først fra elektronrør på omkring 5 centimeter til transistorer på nogle millimetre, og i de seneste år til mikroelektroniske enheder, hvor hver enhed er en brøkdel af en millimeter. Hver sådan reduktion i størrelsen betyder at den mængde elektroner der skal flyttes idet en given dataproces udføres bliver mindre. Det betyder igen at den med samme kraftpåvirkning vil forløbe hurtigere, eller alternativt at man med mindre energiomsætning kan opnå samme hurtighed.",
        "En af grænserne for hvor hurtige dataprocesser man vil kunne realisere afgøres af hvor små elektroniske komponenter det er muligt at fremstille og forbinde sammen. Antagelig vil udviklingen endnu i en overskuelig fremtid kunne fortsætte med en stadig mere forfinet teknik til fremstilling af mikroskopiske elektroniske kredsløb. Der nås dog en absolut grænse når man nærmer sig molekylerne i størrelse, da disse som bekendt ikke kan deles uden at miste deres ydre egenskaber. Selv hvis vi ser bort fra teknologiske problemer er der dog også en anden grænse som vil gøre sig gældende, nemlig de elektriske signalers udbredelseshastighed. Mens en datamat arbejder udveksler dens forskellige dele indbyrdes et stort antal signaler. Disse signaler kan dog ikke løbe hurtigere end lyshastigheden, som er 300.000 km i sekundet i tomrum og noget mindre i luft. En enkelt procestid kan ikke gøres kortere end den tid et signal behøver for at forplante sig fra den ene ende af datamaten til den anden. Nu er tiden for at signalet forplanter sig en meter mere end tre milliartedele af et sekund. En datamat af denne størrelse vil derfor aldrig kunne bringes til at udføre mere end 300 millioner processer i sekundet. Til at illustrere de teknologiske gennembrud i årene 1940 til 1965 kan man på denne baggrund næppe finde et bedre vidnesbyrd end det faktum at procesantallet pr. sekund i denne periode blev øget fra omkring én til over en million."
      ],
      "german": [
        "Wir müssen uns daran erinnern, dass Daten gewöhnliche Ereignisse in der Welt sind und dass die Verarbeitung von Daten immer durch entsprechende Veränderungen an realen und nicht nur gedachten Dingen in der Welt durchgeführt werden muss.",
        "Wir haben jedoch eine unbegrenzte Freiheit zu wählen, wie unsere Daten dargestellt werden und welche Veränderungen den Prozessen entsprechen. Dies steht im direkten Gegensatz zur Bearbeitung von Gegenständen, die so verwendet werden, wie sie sind. Ein Auto wird beispielsweise so verwendet, wie es ist, um zu fahren. Für denjenigen, der das Auto herstellt, gibt es keinen Weg darum herum, die Eisenstücke zu formen und zu bewegen, die in das Auto eingehen. Bei Datenprozessen haben wir hingegen einen hohen Grad an Freiheit, selbst wenn die Form, in der die Endergebnisse gewünscht werden, im Voraus festgelegt ist. Für die Zwischenergebnisse können wir oft die endgültige Form völlig vernachlässigen und eine Datenrepräsentation wählen, die für den Prozess besonders gut geeignet ist. Indem wir diese Freiheit vollständig nutzen, erreichen wir die enorme Geschwindigkeit der Datenprozesse.",
        "Wenn man diesem Gedankengang folgt, kann man leicht die technische Entwicklungslinie verstehen, die in den letzten Jahrzehnten verfolgt wurde. Der Übergang von der Verwendung mechanischer Teile, wie Zahnräder, zur Verwendung von Elektronenröhren bedeutete, dass man von der Verarbeitung durch Bewegung von Teilen, die groß genug waren, um mechanisch bearbeitet zu werden, zur Verarbeitung durch Bewegung der unermesslich leichter (zu bearbeitenden) Elektronen überging. Die spätere Entwicklung führte zu einer stetigen Verkleinerung der elektrischen Komponenten, zunächst von Elektronenröhren von etwa 5 Zentimetern zu Transistoren von einigen Millimetern und in den letzten Jahren zu mikroelektronischen Einheiten, bei denen jede Einheit nur einen Bruchteil eines Millimeters groß ist. Jede derrtige Größenreduzierung bedeutet, dass die Menge an Elektronen, die während eines gegebenen Datenprozesses bewegt werden muss, kleiner wird. Das bedeutet wiederum, dass der Prozess bei gleichem Krafteinsatz schneller ablaufen wird, oder alternativ, dass man mit geringerem Energieverbrauch die gleiche Geschwindigkeit erreichen kann.",
        "Eine der Grenzen, wie schnelle Datenprozesse man realisieren kann, wird davon bestimmt, wie klein elektronische Komponenten hergestellt und miteinander verbunden werden können. Vermutlich wird sich die Entwicklung noch in absehbarer Zukunft mit einer immer besseren Technik zur Herstellung mikroskopischer elektronischer Schaltkreise fortsetzen. Es wird jedoch eine absolute Grenze erreicht, wenn man sich der Größe von Molekülen nähert, da diese bekanntlich nicht geteilt werden können, ohne ihre äußeren Eigenschaften zu verlieren. Selbst wenn wir technologische Probleme außer Acht lassen, gibt es jedoch auch eine andere Grenze, die wirksam wird: nämlich die Ausbreitungsgeschwindigkeit elektrischer Signale. Während ein Datenautomat arbeitet, tauschen seine verschiedenen Teile untereinander eine große Anzahl von Signalen aus. Diese Signale können jedoch nicht schneller laufen als die Lichtgeschwindigkeit, die im Vakuum 300.000 km pro Sekunde beträgt und in Luft etwas weniger. Eine einzelne Prozesszeit kann nicht kürzer gemacht werden als die Zeit, die ein Signal benötigt, um sich von einem Ende des Datenautomaten zum anderen fortzupflanzen. Die Zeit, die ein Signal benötigt, um sich einen Meter fortzupflanzen, beträgt etwas mehr als drei milliardstel Sekunden. Ein Datenautomat dieser Größe wird daher nie mehr als 300 Millionen Prozesse pro Sekunde ausführen können. Um die technologischen Durchbrüche in den Jahren 1940 bis 1965 zu veranschaulichen, kann man vor diesem Hintergrund kaum ein besseres Zeugnis finden als die Tatsache, dass die Anzahl der Prozesse pro Sekunde in diesem Zeitraum von etwa einem auf über eine Million gesteigert wurde."
      ]
    },
    {
      "type": "section",
      "danish": [
        "PROGRAMMERING - GRUNDLAGET FOR DATAMATERNES FLEKSIBILITET"
      ],
      "german": [
        "Programmierung - Die Grundlage für die Flexibilität der Datenautomaten"
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Programmer og maskiner"
      ],
      "german": [
        "Programme und Maschinen"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Vi skal i dag vende os til endnu et af aspekterne af svaret på spørgsmålet om datamaternes samfundsmæssige betydning. Den del af svaret jeg i dag skal belyse i enkeltheder lyder i korthed: på grund af deres enestående evne til at omstilles fra at løse ét problem til et andet, eller endnu kortere: på grund af deres fleksibilitet. Vi skal tale om forudsætningerne for denne fleksibilitet, der hænger sammen med det der betegnes deres programmering.",
        "Begrebet programmering er almindelig kendt i flere sammenhæng der ikke har noget med datamater at gøre, Selve ordet program bruges om en liste over begivenheder der skal finde sted, for eksempel ved en koncert. For så vidt som de medvirkende benytter et foreliggende program som vejledning ved deres optræden er et koncertprogram et simpelt eksempel på det vi her skal tale om. Et andet velkendt eksempel, som viser hvordan en mekanisme kan udføre programmet, er styringen af en moderne vaskemaskine. Som bekendt kan sådanne maskiner udføre flere forskellige funktioner, vask, skylning, centrifugering og tørring. Ved hver brug af maskinen har man mulighed for at vælge mellem en række forskellige programmer, det vil sige udvalg af disse funktioner i visse rækkefølger.",
        "Dette sidste eksempel viser allerede de træk der er karakteristiske for programmering af maskiner. Fordelen er fleksibiliteten, muligheden for at det samme apparat bruges til flere formål. Prisen for denne fordel er at maskinen som den leveres endnu ikke er parat til at udføre nyttigt arbejde. Der kræves stadig en indsats fra brugeren, nemlig at han blandt de foreliggende muligheder vælger den som passer for den opgave han ønsker at få løst.",
        "For nu at komme til vort egentlige emne, datamaterne, så skal vi først indse hvorfra de har fået deres helt enestående fleksibilitet. Vi har allerede i den tredie forelæsning omtalt hvorledes løsningen af en opgave i en datamat må udtrykkes ved en lang serie af elementære processer, der udføres i en bestemt rækkefølge. Det springende punkt er nu at indse at det der kræves til at beskrive styringen af en datamat til at løse en bestemt opgave i sig selv kan repræsenteres ved data, og dernæst at drage konsekvensen af denne erkendelse.",
        "Den første del heraf er simpel nok. Der er ikke svært at forstå at hver af de elementære processer kan betegnes ved passende bogstaver eller ord, og at den samlede følge af dem kan beskrives ved at opskrive disse ord i den rigtige rækkefølge. Når dette er gjort er processen beskrevet ved data."
      ],
      "german": [
        "Wir werden uns heute einem weiteren Aspekt der Antwort auf die Frage nach der gesellschaftlichen Bedeutung der Datenautomaten zuwenden. Der Teil der Antwort, den ich heute im Detail erläutern werde, lautet in Kürze: aufgrund ihrer einzigartigen Fähigkeit, sich von der Lösung eines Problems auf ein anderes umzustellen, oder noch kürzer: aufgrund ihrer Flexibilität. Wir werden über die Voraussetzungen für diese Flexibilität sprechen, die mit dem zusammenhängt, was als ihre <em>Programmierung</em> bezeichnet wird.",
        "Der Begriff Programmierung ist allgemein bekannt in mehreren Zusammenhängen, die nichts mit Datenautomaten zu tun haben. Das Wort &bdquo;Programm&ldquo; selbst wird für eine Liste von Ereignissen verwendet, die stattfinden sollen, zum Beispiel bei einem Konzert. Soweit die Mitwirkenden ein vorliegendes Programm als Anleitung bei ihrem Auftritt verwenden, ist ein Konzertprogramm ein einfaches Beispiel für das, worüber wir hier sprechen werden. Ein weiteres bekanntes Beispiel, das zeigt, wie ein Mechanismus das Programm ausführen kann, ist die Steuerung einer modernen Waschmaschine. Wie bekannt ist, können solche Maschinen mehrere verschiedene Funktionen ausführen: Waschen, Spülen, Schleudern und Trocknen. Bei jeder Verwendung der Maschine hat man die Möglichkeit, zwischen einer Reihe verschiedener Programme zu wählen, das heißt, eine Auswahl dieser Funktionen in bestimmten Reihenfolgen.",
        "Dieses letzte Beispiel zeigt bereits die Merkmale, die für die Programmierung von Maschinen charakteristisch sind. Der Vorteil ist die Flexibilität, also die Möglichkeit, dasselbe Gerät für mehrere Zwecke zu verwenden. Der Preis für diesen Vorteil ist, dass die Maschine, wie sie geliefert wird, noch nicht bereit ist, nützliche Arbeit zu verrichten. Es erfordert weiterhin einen Einsatz des Benutzers, dass er nämlich unter den vorhandenen Möglichkeiten diejenige wählt, die für die Aufgabe passt, die er gelöst haben möchte.",
        "Um nun zu unserem eigentlichen Thema, den Datenautomaten, zu kommen, müssen wir zuerst erkennen, woher sie ihre ganz außergewöhnliche Flexibilität erhalten haben. Wir haben bereits in der dritten Vorlesung erwähnt, wie die Lösung einer Aufgabe in einem Datenautomaten ausgedruckt werden muss: durch eine lange Serie elementarer Prozesse, die in einer bestimmten Reihenfolge ausgeführt werden. Der entscheidende Punkt ist nun zuerst zu erkennen, dass das, was zur Beschreibung der Steuerung eines Datenautomaten erforderlich ist, um eine bestimmte Aufgabe zu lösen, selbst durch Daten dargestellt werden kann, und anschießend die Konsequenz aus dieser Erkenntnis zu ziehen.",
        "Der erste Teil hiervon ist einfach genug. Es ist nicht schwer zu verstehen, dass jeder der elementaren Prozesse durch passende Buchstaben oder Wörter bezeichnet werden kann und dass die gesamte Abfolge von ihnen beschrieben werden kann, indem man diese Wörter in der richtigen Reihenfolge niederschreibt. Wenn dies getan ist, wird der Prozess durch Daten beschrieben."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Lagring af programmet"
      ],
      "german": [
        "Speichern des Programmes"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Den anden del af sagen gemmer en af den slags ideer som kun opstår hos et geni, men som alle vi andre bagefter hilser med reaktionen: ja, naturligvis, det siger da sig selv. Ideen opstod hos matematikerne Von Neumann og Goldstine <sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup> omkring 1946, da der allerede var bygget store og komplicerede regnemaskiner som ikke benytter ideen. Ideen går ud på at de data som beskriver den proces vi ønsker at datamaten skal gennemføre, lagres i datamatens indre lager, ligesom de data der skal bearbejdes ved procescen.",
        "Nutildags forekommer denne idé så indlysende og simpel at unge mennesker der stifter bkendtskab med datamaterne oftest slet ikke bemærker den. For at forstå den enorme gevinst denne idé indebærer må man tænke på hvordan arbejdet med de tidligere store regnemaskiner foregik. Et godt eksempel er maskinen Eniac, den første elektroniske regnemaskine fra 1946. Eniac blev styret af impulser der blev ledet gennem kabler der frit kunne forbindes gennem en stikprop i hver ende, på lignende måde som det foregår ved en gammeldags telefoncentral. For at sætte maskinen i sving med at løse en bestemt opgave måtte man først montere alle de nødvendige kabler mellem de rigtige punkter rundt i maskinen. For en enkelt opgave løb antallet af kabler der skulle anbringes op på hundreder eller tusinder. Dertil kom en mulighed for at indstille talværdier ved at dreje på knapper, der ligeledes var fordelt over maskinen i et stort antal. Det er ikke svært at forestille sig at denne måde at forberede maskinen til at løse en opgave normalt tog flere dage. Igennem hele denne tid lå maskinen uvirksom hen.",
        "Ved en datamat, altså en maskine der styres gennem et program der ligger i dens lager, kræves der til at forberede den til at løse en bestemt opgave at programmet overføres fra et ydre datamedium til datamatens indre lager. Allerede ved de datamater der byggedes omkring 1950 kunne denne overføring foregå med en hastighed af mange tegn i sekundet, og hvor man tidligere måtte regne maskinernes omstillingstid i dage kunne fra dette tidspunkt selv omfattende programmer overføres på få minutter eller sekunder.",
        "Når man hertil føjer at de programmer der kan rummes i datamaterne repræsenterer en hidtil ukendt mangfoldighed med hensyn til metoder og komplikationer, så skulle datamaternes enestående fleksibilitet være godtgjort."
      ],
      "german": [
        "Der andere Teil der Sache enthält eine dieser Ideen, die nur bei einem Genie entstehen, aber die wir alle nachträglich mit der Reaktion begrüßen: Ja, natürlich, das versteht sich doch von selbst. Die Idee entstand bei den Mathematikern Von Neumann und Goldstine <sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup> um 1946 herum, als bereits große und komplizierte Rechenmaschinen gebaut worden waren, die die Idee nicht nutzten. Die Idee besteht darin, dass die Daten, die den Prozess beschreiben, den wir möchten, dass der Datenautomat ausführt, im internen Speicher des Datenautomaten gespeichert werden, ebenso wie die Daten, die beim Prozess bearbeitet werden sollen.",
        "Heutzutage erscheint diese Idee so offensichtlich und einfach, dass junge Menschen, die mit Datenautomaten in Berührung kommen, sie oft gar nicht bemerken. Um den enormen Gewinn dieser Idee zu verstehen, muss man darüber nachdenken, wie die Arbeit mit den früheren großen Rechenmaschinen ablief. Ein gutes Beispiel ist die Maschine Eniac, die erste elektronische Rechenmaschine von 1946. Eniac wurde durch Impulse gesteuert, die durch Kabel geleitet wurden, die frei durch einen Stecker an jedem Ende verbunden werden konnten, analog zu einer (bereits zur Zeit Naurs) altmodischen Telefonzentrale. Um die Maschine dazu zu bringen, eine bestimmte Aufgabe zu lösen, musste man zuerst alle notwendigen Kabel zwischen den richtigen Punkten in der Maschine anbringen. Für eine einzige Aufgabe mussten hunderte oder tausende Kabel angebracht werden. Dazu kam die Möglichkeit, Zahlenwerte durch Drehen an Knöpfen einzustellen, die ebenfalls in großer Zahl über die Maschine verteilt waren. Es ist nicht schwer, sich vorzustellen, dass diese Art, die Maschine für die Lösung einer Aufgabe vorzubereiten, normalerweise mehrere Tage dauerte. Während dieser ganzen Zeit konnte die Maschine nicht genutzt werden.",
        "Um einen Datenautomaten &ndash; also einer Maschine, die durch ein Programm gesteuert wird, das sich in ihrem Speicher befindet &ndash; auf die Lösung einer bestimmten Aufgabe vorzubereiten, ist es notwendig, dass das Programm von einem externen Datenträger in den internen Speicher des Datenautomaten übertragen wird. Schon bei den Datenautomaten, die um 1950 gebaut wurden, konnte diese Übertragung mit einer Geschwindigkeit von vielen Zeichen pro Sekunde erfolgen, und während man früher die Umstellungszeit der Maschinen in Tagen berechnete, konnten ab diesem Zeitpunkt selbst umfangreiche Programme in wenigen Minuten oder Sekunden übertragen werden.",
        "Wenn man hinzufügt, dass die Programme, die in den Datenautomaten untergebracht werden können, eine bislang unbekannte Vielfalt in Bezug auf Methoden und Funktionen darstellen, dann sollte die außergewöhnliche Flexibilität der Datenautomaten bewiesen sein."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Programmeringens problemer"
      ],
      "german": [
        "Die Probleme der Programmierer"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Ethvert afgørende gennembrud indebærer nye problemer, simpelthen derigennem at der i en vis sammenhæng altid er ét problem der er det værste og som derfor trænger sig på. Den lette adgang til at omstille datamaterne fra den ene opgave til den anden forrykkede problemet med at få de nyttige resultater ud af datamaterne, fra at være primært knyttet til apparaterne over til brugerne og deres skriveborde. Det viste sig meget hurtigt at dette var et problem af betydelige dimensioner. Brugeren af en datamat må udforme en beskrivelse af den måde datamaten skal gå frem under løsningen af hans opgave, han må med andre ord skrive et program for løsningen. Programmet består af en række instruktioner til datamaten, som hver svarer til en af de elementære processer som den er bygget til at kunne udføre. Brugeren må derfor gennemarbejde løsningen af sin opgave på en sådan form at den fremtræder som en følge af disse simple processer.",
        "Denne situation har givet anledning til problemer af to helt forskellige arter, som vi skal tage op i tur og orden. For det første har det givet store vanskeligheder for dem der udarbejder programmerne at beherske de komplikationer der kan tillades i processer der kan udføres i nutidens datamater. Man kan også udtrykke det på den måde at maskinkonstruktørerne er forud for brugerne. Nutidens datamater kan inden for få minutter udføre processer der består af millioner af elementære procestrin. Men at beherske procesbeskrivelser af en sådan komplicerethed, samtidig med at der kræves den yderste, pinlige korrekthed i beskrivelsen, er et problem uden sidestykke i nogen hidtil kendt menneskelig aktivitet. De få år der hidtil er forløbet siden dette krav første gang blev stillet har ikke været tilstrækkelige til at vi blot kan skimte problemets endelige løsning."
      ],
      "german": [
        "Jeder entscheidende Durchbruch bringt neue Probleme mit sich &ndash; einfach dadurch, dass es in einem bestimmten Zusammenhang immer ein Problem gibt, dass das größte ist und sich daher aufdrängt. Der leichte Zugang zur Umstellung der Datenautomaten von der einen Aufgabe zur anderen verschob das Problem, nützliche Ergebnisse aus den Datenautomaten zu erhalten, von den primären Verbindungen innerhalb der Geräte hin zu den Benutzern an ihren Schreibtischen. Es zeigte sich sehr schnell, dass dies ein Problem von beträchtlichem Ausmaß war. Der Benutzer eines Datenautomaten muss eine Beschreibung der Vorgehensweise ausarbeiten, wie der Datenautomat bei der Lösung seiner Aufgabe vorgehen soll. Mit anderen Worten: er muss ein Programm für die Lösung schreiben. Das Programm besteht aus einer Reihe von Anweisungen an den Datenautomaten, die jeweils einer der elementaren Prozesse entsprechen, zu deren Ausführung er konstruiert ist. Der Benutzer muss daher die Lösung seiner Aufgabe in einer Form beschreiben, die einer Abfolge dieser einfachen Prozesse entspricht.",
        "Diese Situation hat Anlass zu Problemen von zwei völlig unterschiedlichen Arten gegeben, die wir der Reihe nach aufgreifen werden. Erstens hat es große Schwierigkeiten verursacht für diejenigen, die die Programme ausarbeiten, die Funktionen zu beherrschen, die in Prozessen zugelassen werden können, die in den heutigen Datenautomaten ausgeführt werden können. Man kann es auch so ausdrücken, dass die Maschinenkonstrukteure den Benutzern voraus sind. Die heutigen Datenautomaten können innerhalb weniger Minuten Prozesse ausführen, die aus Millionen elementarer Prozessschritte bestehen. Aber das Beherrschen von Prozessbeschreibungen einer solchen Komplexität, gleichzeitig mit der Anforderung an äußerste, peinliche Genauigkeit in der Beschreibung, ist ein Problem ohne Beispiel in irgendeiner bisher bekannten menschlichen Tätigkeit. Die wenigen Jahre, die bisher vergangen sind, seit diese Anforderung zum ersten Mal gestellt wurde, haben nicht ausgereicht, damit wir auch nur die endgültige Lösung des Problems erahnen können."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Højere programmeringssprog"
      ],
      "german": [
        "Höhere Programmiersprachen"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Der er dog sket store forbedringer, og den hidtil skete udvikling giver en klar pegepind i den retning vi må vente fremtidens udvikling. Mottoet for denne er klar nok: lad datamaterne selv hjælpe brugerne også på dette område. Den første afgørende anvendelse af denne tanke har allerede siden omkring 1960 været i helt almindelig brug ved de fleste datamater. Denne anvendelse kan kort beskrives som følger: tillad brugerne at beskrive deres løsninger på en for mennesker bekvem form og overlad det til datamaten selv at oversætte disse beskrivelser til den form som kræves i datamaten selv. Tankegangen er at det som umiddelbart kan udføres ved en elementær proces i en datamat er meget lidt, samtidig med at den besked som datamaten forlanger for at udføre processen fra vort synspunkt er meget omstændelig. Ved at indføre en oversættelse som mellemled kan denne forskel mellem datamaten og brugerne få lov til at bestå uden væsentlig ulempe for nogen af parterne.",
        "Lad os for at illustrere denne tanke betragte et helt simpelt regnestykke, det at lægge to tal sammen. Fra den elementære matematik er vi vant til at betegne talstørrelser ved bogstaver, a og b for eksempel, og sammenlægningen udtrykkes som a+b. Et sådant udtryk optræder naturligvis ikke isoleret, men i en større sammenhæng hvor bogstaverne a og b benyttes på ensartet måde til at betegne bestemte, vedtagne ting. Vi mennesker er vant til og har let ved at opfatte sådanne tegn i en større sammenhæng — hele vor brug af sproget beror derpå.",
        "I en datamat kan vi slet ikke benytte os af en sådan evne til at forstå ting i en større sammenhæng. Datamaten kræver for at kunne udføre sammenlægningen af tallene en ganske udtrykkelig besked om hvor i dens lager de befinder sig. Denne besked består i en angivelse af nummeret på de celler der opbevarer værdierne. Disse numre kan ikke udtrykkes ved et enkelt tegn, da der normalt må kunne skelnes mellem mange tusinde forskellige. Alene til at udtrykke hvilke to tal der skal lægges sammen kræver datamaten derfor omkring otte tegn. Dertil kræves besked om at vi netop ønsker en addition, hvilket yderligere kræver et tegn eller to i den besked vi må give datamaten.",
        "Det er denne omstændelighed i datamaternes måde at beskrive de elementære processer som gør den direkte programmering af dem så ubekvem for mennesker. Denne ubekvemmelighed fjernes når man bruger de højere programmeringssprog som siden omkring midten af 1950erne har vundet stadig mere indpas ved anvendelsen af datamater. Disse programmeringssprog, der er kendt ved navne som Fortran, Algol, og Cobol, tillader netop brugerne at udtrykke sig på en bekvem og koncis form og sparer derfor brugerne både for besvær og fejltagelser."
      ],
      "german": [
        "Es sind jedoch große Verbesserungen geschehen, und die bisherige Entwicklung gibt einen klaren Hinweis auf die Richtung, in der wir die zukünftige Entwicklung erwarten müssen. Das Motto dafür ist klar genug: lasst die Datenautomaten den Benutzern auch in diesem Bereich helfen. Die erste entscheidende Anwendung dieses Gedankens ist bereits seit etwa 1960 im ganz normalen Gebrauch bei den meisten Datenautomaten. Diese Anwendung kann kurz wie folgt beschrieben werden: erlaubt den Benutzern, ihre Lösungen in einer für Menschen bequemen Form zu beschreiben, und überlasst es dem Datenautomaten selbst, diese Beschreibungen in die Form zu übersetzen, die im Datenautomaten selbst erforderlich ist. Der Gedanke dahinter ist, dass das, was unmittelbar durch einen elementaren Prozess in einem Datenautomaten ausgeführt werden kann, sehr wenig ist, während gleichzeitig die Anweisung, die der Datenautomat verlangt, um den Prozess auszuführen, aus unserer Sicht sehr umständlich ist. Durch die Einführung einer Übersetzung als Zwischenstufe kann dieser Unterschied zwischen dem Datenautomaten und den Benutzern bestehen bleiben, ohne wesentlichen Nachteil für eine der Parteien.",
        "Lasst uns, um diesen Gedanken zu veranschaulichen, ein ganz einfaches Rechenbeispiel betrachten: nämlich das Addieren zweier Zahlen. Aus der elementaren Mathematik sind wir es gewohnt, Zahlenwerte durch Buchstaben zu bezeichnen, a und b zum Beispiel, und die Addition wird als a+b ausgedrückt. Ein solcher Ausdruck erscheint natürlich nicht isoliert, sondern in einem größeren Zusammenhang, wo die Buchstaben a und b erneut verwendet werden, um bestimmte, vereinbarte Dinge zu bezeichnen. Wir Menschen sind daran gewöhnt und haben es leicht, solche Zeichen in einem größeren Zusammenhang zu erfassen —- unsere gesamte Verwendung der Sprache beruht darauf.",
        "In einem Datenautomaten können wir uns überhaupt nicht einer solchen Fähigkeit bedienen, Dinge in einem größeren Zusammenhang zu verstehen. Stattdessen verlangt der Datenautomat, um die Addition der Zahlen ausführen zu können, eine ganz ausdrückliche Anweisung darüber, wo sie sich in seinem Speicher befinden. Diese Anweisung beinhaltet daher die Angabe der Nummern der Speicherzellen, die die Werte speichern. Diese Nummern können nicht durch ein einzelnes Zeichen ausgedrückt werden, da normalerweise zwischen vielen tausenden (derartiger Speicherzellen) unterschieden werden muss. Allein um auszudrücken, welche zwei Zahlen addiert werden sollen, verlangt der Datenautomat daher etwa acht Zeichen. Dazu wird eine Anweisung benötigt, dass wir eine Addition wünschen, was zusätzlich ein oder zwei Zeichen in der Anweisung erfordert, die wir dem Datenautomaten geben müssen.",
        "Es ist diese Umständlichkeit in der Art, wie die Datenautomaten die elementaren Prozesse beschreiben, die die direkte Programmierung von ihnen für Menschen so unbequem macht. Diese Unbequemlichkeit wird beseitigt, wenn man die höheren Programmiersprachen verwendet, die seit etwa Mitte der 1950er Jahre immer mehr Verbreitung bei der Nutzung von Datenautomaten gefunden haben. Diese Programmiersprachen, die unter Namen wie Fortran, Algol und Cobol bekannt sind, erlauben es den Benutzern, sich in einer bequemen und prägnanten Form auszudrücken und ersparen den Benutzern dadurch sowohl Mühe als auch Fehler."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Programoversættelse"
      ],
      "german": [
        "Programmübersetzung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Til gengæld kan et program der er udtrykt på denne form ikke umiddelbart udføres i en datamat. Det må først oversættes til den mere omstændelige form som datamaten kræver. Denne oversættelse kan dog udføres af datamaten selv når først der foreligger et oversætterprogram. At udarbejde et oversætterprogram er en ret omfattende, men dog overkommelig, opgave, og den behøver kun at gennemføres én gang for en bestemt datamat og et bestemt programmeringssprog, derefter kan oversætteren bruges til at oversætte stadig nye programmer i det uendelige. En væsentlig fordel ved mellemvejen over en oversætter er at denne kan udformes således at den giver rapport til brugeren om visse typer af fejltagelser, stavefejl, og lignende, som brugeren kan have begået selv i det bekvemme programmeringssprog.",
        "Når der bruges et højere programmeringssprog foregår en kørsel med datamaten på følgende måde. Først udarbejder brugeren sit program som et sædvanligt skrevet manuskript. Når dette er færdigt overføres det til et af de datamedier som datamaten kan læse, for eksempel hulstrimmel eller hulkort. Dette arbejde udføres af hullepersonale der læser teksten og trykker på taster på en skrivemaskine, der er koblet til en hullemaskine. Når datamaten derefter bliver til rådighed sættes den først til at adlyde oversætterprogrammet. Dette må muligvis først læses ind i dens lager fra et datamedium, men hertil vælges normalt et hurtigt medium således at tiden dertil er ubetydelig. Under styring af oversætterprogrammet læses nu brugerens tekst fra hulstrimlen eller hulkortene og underkastes dels en nøje kontrol for fejl, dels en omdannelse til instruktioner af den form som kan styre datamaten selv. Mens oversættelsen står på behandles disse instruktioner blot som data der skal gemmes til side til senere brug. Først når hele brugerens program er oversat til instruktioner på den form som datamaten kræver overtager det styringen af datamaten og først på dette stadium udføres den proces som brugeren har foreskrevet. Denne proces vil også normalt kræve tilført data udefra, for eksempel fra magnetbånd, ligesom den må aflevere sine resultater på et ydre medium som kan bruges uafhængigt af datamaten.",
        "Hele denne følge af skift mellem forskellige arter af processer gennemføres under styring af programmer i datamaten selv og en ringe mængde indgreb fra en operatør. For mindre programmer med beskedne datamængder kan det hele afvikles på få sekunder. Hvis en kørsel varer mere end få minutter er det som oftest fordi der er en stor mængde data at bearbejde."
      ],
      "german": [
        "Im Gegenzug kann ein Programm, das in dieser Form ausgedrückt ist, nicht direkt in einem Datenautomaten ausgeführt werden. Es muss stattdessen zuerst in die umständlichere Form übersetzt werden, die der Datenautomat benötigt. Diese Übersetzung kann jedoch vom Datenautomaten selbst durchgeführt werden, sobald ein Übersetzungsprogramm vorliegt. Die Erstellung eines Übersetzungsprogramms ist eine ziemlich umfangreiche, aber dennoch machbare Aufgabe, und sie muss nur einmal durchgeführt werden, für einen bestimmten Datenautomaten und eine bestimmte Programmiersprache &ndash; danach kann der Übersetzer verwendet werden, um immer wieder neue Programme beliebig oft zu übersetzen. Ein wesentlicher Vorteil des Umwegs über einen Übersetzer ist, dass dieser so gestaltet werden kann, dass er dem Benutzer Bericht erstattet über bestimmte Arten von Fehlern, Rechtschreibfehlern und Ähnliches, die der Benutzer selbst in der bequemen Programmiersprache gemacht haben könnte",
        "Wenn eine höhere Programmiersprache verwendet wird, erfolgt ein Lauf mit dem Datenautomaten folgendermaßen: Zuerst erstellt der Benutzer sein Programm wie ein gewöhnlich geschriebenes Manuskript. Wenn dies fertig ist, wird es auf eines der Datenträger übertragen, die der Datenautomat lesen kann, zum Beispiel Lochstreifen oder Lochkarten. Diese Arbeit wird vom Lochkartenpersonal ausgeführt, das den Text liest und auf die Tasten einer Schreibmaschine drückt, die mit einer Lochmaschine verbunden ist. Wenn der Datenautomat dann zur Verfügung steht, wird er zunächst so eingestellt, dass er dem Übersetzungsprogramm folgt. Dieses muss möglicherweise zuerst von einem Datenträger in seinen Speicher geladen werden, aber dafür wird normalerweise ein schnelles Medium gewählt, sodass die Zeit dafür unbedeutend ist. Unter der Steuerung des Übersetzungsprogramms wird der Text des Benutzers nun von den Lochstreifen oder Lochkarten gelesen und einerseits einer genauen Fehlerüberprüfung unterzogen und anderseits in Anweisungen umgewandelt, die den Datenautomaten selbst steuern können. Während der Übersetzung werden diese Anweisungen lediglich als Daten behandelt, die zur späteren Verwendung beiseitegelegt werden. Erst wenn das gesamte Programm des Benutzers in Anweisungen übersetzt ist, in die Form, die der Datenautomat verlangt, übernimmt es die Steuerung des Datenautomaten, und erst in diesem Stadium wird der Prozess ausgeführt, den der Benutzer vorgeschrieben hat. Dieser Prozess erfordert normalerweise auch Daten von außen, zum Beispiel von Magnetbändern, ebenso wie er seine Ergebnisse auf einem externen Medium ausgeben muss, das unabhängig vom Datenautomaten verwendet werden kann.",
        "Die gesamte Abfolge von Wechseln zwischen verschiedenen Arten von Prozessen wird unter der Steuerung von Programmen im Datenautomaten selbst durchgeführt und mit geringem Eingreifen eines Bedieners. Für kleinere Programme mit bescheidenen Datenmengen kann das Ganze in wenigen Sekunden abgewickelt werden. Wenn ein Lauf länger als ein paar Minuten dauert, liegt es meist daran, dass eine große Menge an Daten bearbeitet werden muss."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Fuldstændige beskrivelser af dataprocesser"
      ],
      "german": [
        "Vollständige Beschreibung von Datenprozessen"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "De problemer vedrørende datamaternes programmering vi indtil nu har omtalt har været af forholdsvis triviel natur; et fremtrædende tema har været den større eller mindre bekvemmelighed. Vi skal nu drøfte et problem af en ganske anden art, som rummer langt dybere perspektiver, nemlig det bagved programmeringen liggende problem at udtrykke kendte aktiviteter i form af klart definerede processer.",
        "Lad os først bemærke at selve begrebet en fuldt defineret proces ikke hidtil har været ukendt. Når vi i de første skoleår træner børnene i regning er det netop sådanne mekaniske dataprocesser der indøves. Men lad os også med det samme erkende at dette begreb har ført en noget hensygnende tilværelse, i alle tilfælde i skoleundervisningen. Det er især bemærkelsesværdigt at selve de regneprocesser der indøves med så stor iver i de tidlige skoleår ikke i den senere matematikundervisning betragtes som eksempler på mere generelle dataprocesser.",
        "Enhver vejledning i at gøre noget er en procesbeskrivelse, og af sådanne træffer vi mange i dagliglivet. Man behøver blot at minde om hobbymandens byggevejledning og pigernes strikkeopskrifter. Inden for forvaltning og erhversliv træffer vi procesbeskrivelser i form af instrukser, ligesom en væsentlig del af lovgivningen består af procesbeskrivelser, for eksempel de love efter hvilke skatten beregnes, eller valgloven med reglerne for hvordan mandatfordelingen beregnes. Også en stor del af mere krævende konstruktivt arbejde drejer sig om processer. Hvad enten man ønsker at konstruere huse, broer, eller biler er det afgørende at finde frem til en fornuftig arbejdsgang, hvilket igen kræver en beskrivelse af arbejdsprocessen.",
        "Ved de fleste af de her nævnte eksempler er de processer der er tale om hidtil blevet udført af mennesker. Følgen heraf har været, dels at beskrivelserne har kunnet være temrnaelig ufuldstændige, da mennesker besidder en overordentlig evne til fornuftigt at indføje det manglende, dels at den opfattelse har været gældende at de pågældende processer simpelthen krævede menneskers medvirken ved deres gennemførelse, altså ikke ville kunne automatiseres.",
        "Denne situation har ændret sig radikalt ved datamaternes fremkomst. Datamaterne stiller ubønhørlige krav om en komplet beskrivelse af de processer de skal udføre. I første omgang er dette en ny og besværlig belastning for dem der skal løse opgaverne. Det har dog i utallige tilfælde vist sig at dette nye krav om præcision snart har udviklet sig til et betydeligt gode, gennem den tankemæssige klarhed det bringer i sit kølvand. Ved at arbejde med fuldstændigt formaliserede beskrivelser af det vi har med at gøre lærer vi det at kende på en ny og inspirerende måde, vi opdager muligheder ved dem vi ikke før har set, og vi indser hvordan overflødigheder kan fjernes, med en tilsvarende gevinst i klarhed og økonomi.",
        "Utallige fagfolk fra vidt forskellige områder har ved deres første praktiske brug af en datamat til at løse problemer inden for deres eget felt erkendt sandheden i følgende udtalelse, som tilskrives den kendte amerikanske datalog, Alan Perlis: »Når man lærer om et emne tror man at man forstår det. Når man underviser 1 det er man overbevist om at man forstår det. Men man forstår det først når man har programmeret det for en datamat.«"
      ],
      "german": [
        "Die Probleme bezüglich der Programmierung von Datenautomaten, die wir bisher besprochen haben, waren von relativ trivialer Natur; ein hervorstechendes Thema war die größere oder geringere Bequemlichkeit. Wir werden nun ein Problem ganz anderer Art erörtern, das viel tiefere Perspektiven eröffnet, nämlich das der Programmierung zugrunde liegende Problem, bekannte Aktivitäten in Form klar definierter Prozesse auszudrücken.",
        "Lasst uns zuerst bemerken, dass das eigentliche Konzept eines vollständig definierten Prozesses bisher nicht unbekannt war. Wenn wir in den ersten Schuljahren die Kinder im Rechnen schulen, sind es genau solche mechanischen Datenprozesse, die eingeübt werden. Aber lassen Sie uns auch sofort anerkennen, dass dieses Konzept ein eher kümmerliches Dasein geführt hat &ndash; zumindest im Schulunterricht. Es ist besonders bemerkenswert, dass gerade die Rechenprozesse, die mit so großem Eifer in den frühen Schuljahren eingeübt werden, im späteren Mathematikunterricht nicht als Beispiele für allgemeinere Datenprozesse betrachtet werden.",
        "Jede Anleitung, etwas zu tun, ist eine Prozessbeschreibung, und solchen begegnen wir häufig im Alltag. Man braucht nur an die Bauanleitungen des Hobbyhandwerkers und die Strickmuster <sup class=\"footnote-ref\" data-footnote-id=\"4.1\">4.1</sup> der Mädchen zu denken. Im Bereich der Verwaltung und der Wirtschaft begegnen wir Prozessbeschreibungen in Form von Instruktionen, ebenso wie ein wesentlicher Teil der Gesetzgebung aus Prozessbeschreibungen besteht, zum Beispiel die Gesetze, nach denen die Steuern berechnet werden, oder das Wahlgesetz mit den Regeln, wie die Mandatsverteilung berechnet wird. Auch ein großer Teil anspruchsvollerer Konstruktionsarbeiten dreht sich um Prozesse. Ob man nun Häuser, Brücken oder Autos entwerfen möchte, ist es entscheidend, einen vernünftigen Arbeitsablauf zu finden, was wiederum eine Beschreibung des Arbeitsprozesses erfordert.",
        "Bei den meisten der hier genannten Beispiele wurden die betreffenden Prozesse bisher von Menschen ausgeführt. Die Folge davon war einerseits, dass die Beschreibungen recht unvollständig sein konnten, da Menschen eine außerordentliche Fähigkeit besitzen, fehlende Informationen vernünftig zu ergänzen, und anderseits, dass die Auffassung vorherrschte, die betreffenden Prozesse erforderten einfach die Mitwirkung von Menschen bei ihrer Durchführung &ndash; das heißt, sie könnten nicht automatisiert werden.",
        "Diese Situation hat sich durch das Aufkommen der Datenautomaten radikal verändert. Die Datenautomaten stellen unerbittliche Anforderungen an eine vollständige Beschreibung der Prozesse, die sie ausführen sollen. Zunächst ist dies eine neue und schwierige Belastung für diejenigen, die die Aufgaben lösen müssen. Es hat sich jedoch in unzähligen Fällen gezeigt, dass diese neue Anforderung an Präzision sich bald als ein erhebliches Gut erwiesen hat, durch die geistige Klarheit, die es mit sich bringt. Durch die Arbeit mit vollständig formalisierten Beschreibungen dessen, womit wir es zu tun haben, lernen wir es auf eine neue und inspirierende Weise kennen, wir entdecken Möglichkeiten, die wir vorher nicht gesehen haben, und wir erkennen, wie Überflüssiges entfernt werden kann, mit einem entsprechenden Gewinn an Klarheit und Effizienz.",
        "Unzählige Fachleute aus ganz verschiedenen Bereichen haben bei ihrem ersten praktischen Einsatz eines Datenautomaten zur Lösung von Problemen in ihrem eigenen Fachgebiet die Wahrheit der folgenden Aussage erkannt, die dem bekannten amerikanischen <span class=\"alt-term\">Datalogen / Informatiker</span> Alan Perlis zugeschrieben wird: &bdquo;Wenn man über ein Thema lernt, glaubt man, dass man es versteht. Wenn man es lehrt, ist man überzeugt, dass man es versteht. Aber man versteht es erst, wenn man es für einen Datenautomaten programmiert hat.&ldquo;"
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamaterne og planlægningen"
      ],
      "german": [
        "Datenautomaten und Planung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Som sidste punkt i denne forelæsning er der grund til at tale et par ord om datamaternes forhold til planlægningen, som er så stærkt fremme i den offentlige debat. Herom kan der siges to ting. For det første burde det nu være klart at programmeringen af en datamat frem for alt drejer sig om planlægning. Et program er simpelthen en detailleret plan for hvad datamaten skal gøre, hvordan den skal opføre sig over for alle de eventualiteter der kan opstå under dataprocessernes afvikling. Der kan ikke gives nogen bedre træning i planlægningens tankegang end praktisk arbejde med programmering af datamater. Som en vigtig erfaring fra dette arbejde bør fremhæves menneskers begrænsninger overfor denne type af arbejde. Det er ganske enkelt dagens orden at et program der afleveres fra en programmør, selv en mester i faget, har fejl i sig, måske kun trivielle, men sådanne som når programmet prøvekøres i datamaten får den til at løbe helt vild. Lad denne kendsgerning være et memento til dem der vil have os til at tro at alle problemer kan løses gennem mere planlægning.",
        "En helt anden side er datamaternes eventuelle brug som hjælpemidler i planlægning. Dertil er først at sige at for så vidt planlægning forudsætter opsamling og bearbejdning af data om situationen som den eksisterer for øjeblikket vil datamaterne naturligvis være nyttige. Det er dog vigtigt at bemærke at datamaternes muligheder rækker langt videre, idet de gør det muligt at erstatte planlægning med styring, det vil sige en stadig overvågning af situationens udvikling og en sideløbende beregning af de til enhver tid mest gunstige forholdsregler. Min personlige vurdering er at der vil komme den dag da planlægning vil forekomme forældet som hjælpemiddel i samfundslivet, fordi datamaterne vil gøre det muligt for politikerne at gennemføre en hensigtsmæssig styring."
      ],
      "german": [
        "Als letzter Punkt in dieser Vorlesungseinheit gibt es Anlass, ein paar Worte über das Verhältnis der Datenautomaten zur Planung zu sagen, die so stark in der öffentlichen Debatte im Vordergrund steht. Dazu können zwei Dinge gesagt werden. Erstens sollte jetzt klar sein, dass die Programmierung eines Datenautomaten vor allem eine Frage der Planung ist. Ein Programm ist schlicht und einfach ein detaillierter Plan darüber, was der Datenautomat tun soll und wie er sich gegenüber allen Eventualitäten verhalten soll, die während der Durchführung der Datenprozesse auftreten können. Es gibt kein besseres Training für die Denkweise der Planung als praktische Arbeit mit der Programmierung von Datenautomaten. Als wichtige Erkenntnis aus dieser Arbeit sollte hervorgehoben werden, dass die Begrenzungen des Menschen gegenüber dieser Art von Arbeit bestehen. Es ist ganz einfach an der Tagesordnung, dass ein Programm, das von einem Programmierer, selbst von einem Meister des Fachs, abgegeben wird, Fehler enthält, vielleicht nur triviale, aber solche, dass, wenn das Programm im Datenautomaten getestet wird, es dazu führt, dass er völlig außer Kontrolle gerät. Lasst diese Tatsache eine Mahnung sein für diejenigen, die uns glauben machen wollen, dass alle Probleme durch mehr Planung gelöst werden können.",
        "Eine ganz andere Seite ist der mögliche Einsatz von Datenautomaten als Hilfsmittel in der Planung. Dazu ist zuerst zu sagen, dass Datenautomaten hier natürlich nützlich sein werden, wenn diese Planung die Erfassung und Verarbeitung von Daten über die Situation, wie sie im Moment besteht, voraussetzt. Es ist jedoch wichtig zu bemerken, dass die Möglichkeiten der Datenautomaten weit darüber hinausreichen, indem sie es ermöglichen, Planung durch Steuerung zu ersetzen &ndash; also durch eine ständige Überwachung der Entwicklung der Situation und eine gleichzeitige Berechnung der zu jedem Zeitpunkt günstigsten Maßnahmen. Meine persönliche Einschätzung ist, dass der Tag kommen wird, an dem Planung als Hilfsmittel im gesellschaftlichen Leben veraltet erscheinen wird, weil die Datenautomaten es den Politikern ermöglichen werden, eine zweckmäßige Steuerung durchzuführen."
      ]
    },
    {
      "type": "section",
      "danish": [
        "DATAMATERNES ANVENDELSE I DAG"
      ],
      "german": [
        "Die heutige Anwendung von Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "I dag skal vi gennemgå nogle anvendelser af datamaterne, sådan som de finder sted ved de talrige datamater der er spredt ud over kloden. En sådan gennemgang inden for rammerne af denne forelæsning må nødvendigvis blive stærkt selektiv. De udvalg jeg har foretaget har delvis været ledet af ønsket om at give endnu et aspekt af svaret på hvorfor datamaterne er så samfundsmæssigt betydningsfulde. Jeg har derfor valgt en række anvendelser af forholdsvis jordnær art, som er forholdsvis lette at forstå hvis man blot har en smule kendskab til de pågældende aktiviteter. Disse eksempler har jeg suppleret med anvendelser som ikke er så indlysende, men som man kan belyse nogle af de metoder der ligger bag anvendelserne."
      ],
      "german": [
        "Heute werden wir einige Anwendungen der Datenautomaten durchgehen, wie sie bei den zahlreichen Datenautomaten stattfinden, die über den ganzen Erdball verteilt sind. Eine solche Durchsicht im Rahmen dieser Vorlesung muss notwendigerweise stark selektiv sein. Die Auswahl, die ich getroffen habe, wurde teilweise von dem Wunsch geleitet, noch einen Aspekt zur Antwort, warum die Datenautomaten so gesellschaftlich bedeutsam sind, hinzuzufügen. Ich habe daher eine Reihe von relativ bodenständigen Anwendungen ausgewählt, die relativ leicht zu verstehen sind, wenn man nur ein wenig Kenntnis der zugehörigen Tätigkeiten hat. Diese Beispiele habe ich durch Anwendungen ergänzt, die nicht so offensichtlich sind, bei denen man jedoch einige der Methoden beleuchten kann, die hinter den Anwendungen liegen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Informationssøgning"
      ],
      "german": [
        "Informationssuche"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Jeg vil begynde med nogle anvendelser af datamater til at håndtere tekster fra sædvanligt sprog. Herigennem får jeg atter engang lejlighed til at betone at vi allerede for længst er ude over det stadium da beregninger var det vigtigste arbejdsområde for dem. Vi skal herunder tale dels om informationssøgning, dels om sprogoversættelse.",
        "Informationssøgning er blandt andet af interesse ved den videnskabelige litteratur, der som bekendt er vokset enormt i omfang i de senere år. For mange fag gælder det at den mængde faglitteratur der fremkommer i tidsskrifter er så stor at den enkelte forsker er ude af stand til blot at se det igennem for at vide om der er fremkommet nyheder af interesse for ham. Her kan datamaterne hjælpe. Dertil kræves at den pågældende litteratur, enten den fuldstændige tekst eller titlen og passende beskrivende nøgleord, overføres til et medium som kan læses af datamaten, for eksempel magnetbånd. Man har nu lavet et program for en datamat der efter at have fået opgivet visse søgeord gennemsøger hele denne tekst og som nårsomhelst det i teksten støder på et af søgeordene sørger for at aflevere oplysninger om den videre sammenhæng på dette sted i teksten, i særdeleshed hvad det er for en afhandling det stammer fra. Opgaven for den forsker der vil gøre brug af dette program er at angive de ord programmet skal bruge som søgeord. Man vil forstå at systemet ikke er betinget af nogen klassifikation af litteraturen. Det vil derfor uden vanskelighed kunne behandle stadig nye ord og emner. Tillige vil brugeren uden videre som søgeord kunne angive højt specialiserede ord, sære tekniske betegnelser, og vil derved fra datamaten få et meget begrænset svar, koncentreret om netop det han har spurgt om.",
        "Blandt videnskaberne er det først og fremmest kemien der lider under den enorme vækst i litteraturen. På dette område er den datamatiske litteratursøgning efter de omtalte principper blevet taget op i stor skala i U.S.A. Den primære, besværlige overføring af titler for alle nye kemiske afhandlinger udføres løbende af en enkelt central institution og er derefter til rådighed for alle andre mod passende vederlag. Materialet er herhjemme tilgængeligt gennem Danmarks tekniske Bibliotek, der som det første i Europa har sluttet sig til dette arbejde."
      ],
      "german": [
        "Ich möchte mit einigen Anwendungen der Datenautomaten beginnen, um Texte in gewöhnlicher Sprache zu verarbeiten. Dadurch bekomme ich erneut die Gelegenheit zu betonen, dass wir das Stadium längst hinter uns gelassen haben, in dem Berechnungen ihr wichtigstes Arbeitsfeld waren. Wir werden dabei teilweise über Informationssuche und teilweise über Sprachübersetzung sprechen.",
        "Die Informationssuche ist unter anderem von Interesse bei der wissenschaftlichen Literatur, die, wie bekannt, in den letzten Jahren enorm an Umfang zugenommen hat. Für viele Fächer gilt, dass die Menge an Fachliteratur, die in Zeitschriften erscheint, so groß ist, dass der einzelne Forscher außerstande ist, sie nur zu überblicken, um zu wissen, ob Neuigkeiten von Interesse für ihn aufgetaucht sind. Hier können die Datenautomaten helfen. Dazu ist es erforderlich, dass die betreffende Literatur, entweder der vollständige Text oder der Titel und passende beschreibende Schlüsselwörter, auf ein Medium übertragen wird, das vom Datenautomaten gelesen werden kann, wie zum Beispiel ein Magnetband. Man hat nun ein Programm für einen Datenautomaten erstellt, das, nachdem es bestimmte Suchwörter erhalten hat, den gesamten Text durchsucht und wann immer es im Text auf eines der Suchwörter stößt, dafür sorgt, Auskunft über den weiteren Zusammenhang an dieser Stelle im Text zu liefern, insbesondere, aus welcher Abhandlung es stammt. Die Aufgabe des Forschers, der dieses Programm nutzen möchte, besteht darin, die Wörter anzugeben, die das Programm als Suchwörter verwenden soll. Man wird verstehen, dass das System nicht von einer (bestimmten) Klassifikation der Literatur abhängt. Es wird daher ohne Schwierigkeiten in der Lage sein, ständig neue Wörter und Themen zu verarbeiten. Außerdem wird der Benutzer ohne Weiteres hoch spezialisierte Wörter oder seltsame technische Begriffe als Suchwörter angeben können, und wird dadurch vom Datenautomaten eine sehr begrenzte Antwort erhalten, die konzentriert auf genau das ist, wonach er gefragt hat.",
        "Unter den Wissenschaften ist es vor allem die Chemie, die unter dem enormen Wachstum der Literatur leidet. In den USA wurde (bereits) in diesem Bereich die datenautomatengestützte Literatursuche nach den genannten Prinzipien in großem Maßstab aufgenommen. Die primäre, mühsame Übertragung der Titel aller neuen chemischen Abhandlungen wird fortlaufend von einer einzigen zentralen Institution durchgeführt und steht dann allen anderen gegen eine entsprechende Gebühr zur Verfügung. Das Material ist hierzulande durch die Dänische technische Bibliothek <sup class=\"footnote-ref\" data-footnote-id=\"5.1\">5.1</sup> zugänglich, die sich als erste in Europa diesem Projekt angeschlossen hat."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Sprogoversættelse"
      ],
      "german": [
        "Sprachübersetzung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "En anden sprogmæssig opgave, der har været genstand for megen interesse, er oversættelse. Denne interesse kan ikke undre i vor tid, med det store behov for kommunikation tværs over sproggrænserne. Det kan også umiddelbart forekomme at være en nærliggende opgave for en datamat. Både det der går ind og det der kommer ud af en oversættelse er jo tekster, altså data, og kan derfor umiddelbart håndteres i datamaterne. Opgaven har dog vist sig at være langt vanskeligere end antaget midt i 1950'erne da problemet blev taget op mange steder i en rus af optimisme. På denne tid kneb det endnu stærkt med datamaternes kapacitet for data og det at levere datamaten et leksikon på en tilgængelig form strakte mulighederne til det yderste. De der arbejdede med oversættelsesproblemet kunne derfor endnu forestille sig at når blot dette kapacitetsproblem blev overvundet så var hele oversættelsesopgaven løst. Da man så fik langt større datakapaciteter til rådighed i datamaterne viste dette sig at være en illusion. Det er blevet mere og mere klart at en kvalitetsoversættelse kræver en analyse af den givne tekst der medtager sammenhæng ikke alene inden for den enkelte sætning, men fra sætning til sætning og fra paragraf til paragraf. Dette har hidtil ikke kunnet realiseres og kyndige inden for feltet er forberedt på at det vil tage mange år endnu før problemet er løst.",
        "Dette modsiges ikke af at der adskillige steder i verden har været demonstreret oversætterprogrammer for offentligheden. Oversættelse er ikke noget man kan eller ikke kan, men i høj grad et kvalitetsspørgsmål. De oversættere der har været demonstreret har alle været ret primitive. Dermed er ikke sagt at de ikke kan være nyttige til visse formål, for eksempel oversættelse af videnskabelig eller teknisk litteratur. Hvad der for øjeblikket ligger helt uden for disse oversætterprogrammers rækkevidde er skønlitterære oversættelser. Ved god skønlitteratur ligger en væsentlig del af værkets kvalitet i selve det sproglige udtryk og oversættelsen bliver en vanskelig kunst, i følge Karen Blixen den sværeste af alle. Hvor det drejer sig om en oversættelse der er betinget af en helhedsopfattelse af en tekst er mennesker stadig datamaterne langt overlegne."
      ],
      "german": [
        "Eine andere sprachliche Aufgabe, die Gegenstand großen Interesses geworden ist, ist die Übersetzung. Dieses Interesse überrascht in unserer Zeit aufgrund des großen Bedarfs an Kommunikation über Sprachgrenzen hinweg nicht. Die Sprachübersetzung mag auch unmittelbar als eine naheliegende Aufgabe für einen Datenautomaten erscheinen. Sowohl das, was in eine Übersetzung hineingeht, als auch das, was herauskommt, sind ja Texte, also Daten, und können daher direkt in den Datenautomaten verarbeitet werden. Die Aufgabe hat sich jedoch als weitaus schwieriger erwiesen als Mitte der 1950er Jahre angenommen, als das Problem vielerorts in einem Rausch von Optimismus angegangen wurde. Zu dieser Zeit war die Kapazität der Datenautomaten für Daten noch stark begrenzt, und dem Datenautomaten ein Lexikon in einer zugänglichen Form bereitzustellen, reizte die Möglichkeiten bis zum Äußersten aus. Diejenigen, die am Übersetzungsproblem arbeiteten, konnten sich daher noch vorstellen, dass die gesamte Übersetzungsaufgabe gelöst sei, sobald dieses Kapazitätsproblem überwunden war. Als man dann viel größere Datenkapazitäten in den Datenautomaten zur Verfügung hatte, erwies sich dies als Illusion. Es wurde immer deutlicher, dass eine qualitativ hochwertige Übersetzung eine Analyse des gegebenen Textes nicht nur erfordert, die Zusammenhänge innerhalb des einzelnen Satzes zu berücksichtigen, sondern auch die von Satz zu Satz und von Absatz zu Absatz. Dies konnte bisher nicht realisiert werden, und Experten auf diesem Gebiet erwarten, dass es noch viele Jahre dauern wird, bis das Problem gelöst ist.",
        "Dies wird nicht dadurch widerlegt, dass an mehreren Orten weltweit Übersetzungsprogramme für die Öffentlichkeit demonstriert wurden. Übersetzung ist nicht etwas, das man entweder kann oder nicht kann &ndash; sondern in hohem Maße eine Frage der Qualität. Die Übersetzungsprogramme, die demonstriert wurden, waren alle ziemlich primitiv. Damit ist nicht gemeint, dass sie nicht für bestimmte Zwecke nützlich sein können &ndash; wie zum Beispiel für die Übersetzung von wissenschaftlicher oder technischer Literatur. Was jedoch im Moment völlig außerhalb der Reichweite dieser Übersetzungsprogramme liegt, sind belletristische Übersetzungen. Bei guter Belletristik liegt ein wesentlicher Teil der Qualität des Werks im sprachlichen Ausdruck selbst, und die Übersetzung wird zu einer schwierigen Kunst &ndash; laut Karen Blixen <sup class=\"footnote-ref\" data-footnote-id=\"5.2\">5.2</sup> sogar die schwierigste von allen. Wenn es um eine Übersetzung geht, die auf einem ganzheitlichen Verständnis eines Textes beruht, sind Menschen den Datenautomaten immer noch weit überlegen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Sproganalyse"
      ],
      "german": [
        "Sprachanalyse"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Datamaternes styrke overfor tekster i naturligt sprog ligger i deres detailanalyse af enkelte sætninger. Sådanne analyser kan være af betydelig interesse ved tekster hvis nøjagtige udlægning indebærer betydningsfulde konsekvenser, i særdeleshed lovtekster. Som et interessant eksempel på en sådan anvendelse kan nævnes en analyse af visse centrale sætninger i den internationale traktat om forbud mod kernevåbenprøver. Disse sætninger blev analyseret af et program der er udviklet ved Harvard universitetet. Resultatet af analysen er oplysninger om hvordan ordene i sætningen grupperes og bestemmer hinanden, og i givet fald hvorledes ordene kan grupperes på mere end én måde. Det interessante ved dette eksempel var at der blandt blot ni sætninger blev fundet én der kunne opfattes på to afgørende forskellige måder. Den pågældende sætning lyder i den originale engelske formulering:",
        "»It is understood in this connection that the provisions of this subparagraph are without prejudice to the conclusion of a treaty resulting in the permanent banning of all nuclear test explosions, including all such explosions underground.«",
        "Omtrentligt oversat til dansk lyder sætningen: »Det forstås i denne forbindelse at aftalerne i denne underparagraf ikke stiller sig i vejen for afslutningen af en traktat der resulterer i et permanent forbud mod alle kernevåbenprøveeksplosioner, inklusive alle sådanne eksplosioner under jorden.«",
        "Det ejendommelige er imidlertid at den originale engelske version kan læses som at »aftalerne i denne underparagraf ikke stiller sig i vejen for en traktat og resulterer i et permanent forbud mod alle kernevåbenprøveeksplosioner, inklusive alle sådanne eksplosioner under jorden«, hvilket modsiger traktatens idé, der som bekendt ikke forbyder underjordiske prøver. Gennem sin pedantiske, systematiske analyse har datamaten altså afsløret en tvetydighed, som er tydelig nok når den først er påvist, men som falder så lidt i øjnene at den uantastet er passeret de trænede juridiske hoveder der har udtænkt teksten."
      ],
      "german": [
        "Die Stärke der Datenautomaten gegenüber Texten in natürlicher Sprache liegt in ihrer Detailanalyse einzelner Sätze. Solche Analysen können von erheblichem Interesse sein bei Texten, deren genaue Auslegung bedeutungsvolle Konsequenzen hat, insbesondere bei Gesetzestexten. Als interessantes Beispiel für eine solche Anwendung kann eine Analyse bestimmter zentraler Sätze im internationalen Vertrag über das Verbot von Kernwaffentests genannt werden <sup class=\"footnote-ref\" data-footnote-id=\"5.3\">5.3</sup>. Diese Sätze wurden von einem Programm analysiert, das an der Harvard-Universität entwickelt wurde. Das Ergebnis der Analyse sind Informationen darüber, wie die Wörter im Satz gruppiert und einander zugeordnet werden, und gegebenenfalls, wie die Wörter auf mehr als eine Weise gruppiert werden können. Das Interessante an diesem Beispiel war, dass unter nur neun Sätzen einer gefunden wurde, der auf zwei entscheidend unterschiedliche Weisen interpretiert werden konnte.",
        "Der betreffende Satz lautet in der originalen englischen Formulierung: »It is understood in this connection that the provisions of this subparagraph are without prejudice to the conclusion of a treaty resulting in the permanent banning of all nuclear test explosions, including all such explosions underground.«",
        "Ungefähr ins Dänische übersetzt <sup class=\"footnote-ref\" data-footnote-id=\"5.4\">5.4</sup> lautet der Satz: Det forstås (Es wird verstanden) i denne forbindelse (in dieser Verbindung / in diesem Zusammenhang) at aftalerne (dass Verabredungen) i denne underparagraf (in diesem Unterparagraph) ikke stiller sig (sich nicht stellen) i vejen (in den Weg) for afslutningen (zum Abschließen) af en traktat (von einem Vertrag) der resulterer (der darin resuliertiert) i et permanent forbud (zu einem permanenten Verbot) mod alle kernevåbenprøveeksplosioner (von allen Kernwaffenexplosionen), inklusive alle sådanne (inklusive aller derartigen) eksplosioner under jorden (explosionen unter der Erde).",
        "Das Merkwürdige ist jedoch, dass die originale englische Version so gelesen werden kann, dass die Bestimmungen in diesem Unterabsatz der Verabschiedung eines Vertrags nicht im Wege stehen und (darüber hinaus) zu einem dauerhaften Verbot aller Kernwaffentestexplosionen führen, einschließlich aller solcher Explosionen unter der Erde &ndash; was der Idee des Vertrags widerspricht, der bekanntlich unterirdische Tests nicht verbietet. Durch seine pedantische, systematische Analyse hat der Datenautomat also eine Zweideutigkeit aufgedeckt, die klar genug ist, sobald sie aufgezeigt wird, die jedoch so wenig auffällt, dass sie unangefochten an den geschulten juristischen Köpfen vorbeigegangen ist, die den Text erdacht haben."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Atomreaktorer"
      ],
      "german": [
        "Atomreaktoren"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Jeg vil nu gå over til at omtale en række anvendelser af datamater til hjælp ved arbejdet med datamodeller. Man kan her skelne mellem projekteringsopgaver, som går ud på at opbygge en helt ny konstruktion og hvor arbejdet med datamodellen er overstået når konstruktionen er fuldt ud planlagt, og overvågnings- og styringsopgaver, hvor datamodellen benyttes sideløbende med at den tilsvarende virkelighed udfolder sig.",
        "For at begynde med projekteringsopgaverne, lad os først tænke på et af de felter hvor datamater har været brugt flittigst, nemlig beregninger over atomreaktorer. Reaktorfolkenes stærke interesse for datamaterne skyldes dels at feltet er nyt og i hastig udvikling, dels at man selvsagt er parat til at gøre det ekstraordinære i retning af omhyggelig projektering på grund af dem store samfundsmæssige risiko der er knyttet til atomreaktorer.",
        "Det man undersøger med datamaternes hjælp er de fysiske forhold i reaktorerne, strømmen af neutroner i reaktorkernen, strålings- og varmeudvekslingen med omgivelserne, ændringerne i reaktorbrænslet med tiden, reaktorens opførsel i tilfælde af at forskellige styringsmekanismer svigter, og lignende. Beregningerne baseres på et omfattende kendskab til stoffernes egenskaber, sådan som fysikerne har bragt det til veje. Dertil kommer et omfattende datamateriale der beskriver opbygningen af den bestemte reaktor som man undersøger. Disse omstændigheder gør beregningerne uhyre besværlige og det er en kendsgerning at det gang på gang har været reaktorfolkene der har presset på for at få datamatfabrikanterne til at udvikle større og hurtigere datamater."
      ],
      "german": [
        "Ich werde nun eine Reihe von Anwendungen der Datenautomaten besprechen, die der Unterstützung bei der Arbeit mit Datenmodellen dienen. Hier kann man zwischen Planungsaufgaben unterscheiden, die darauf abzielen, eine völlig neue Konstruktion zu erstellen und bei denen die Arbeit mit den Datenmodellen abgeschlossen ist, wenn die Konstruktion vollständig geplant ist &ndash; und Überwachungs- und Steuerungsaufgaben, bei denen die Datenmodelle parallel zur sich verändernden Realität verwendet werden.",
        "Beginnen wir mit den Planungsaufgaben und denken zunächst an eines der Gebiete, in denen Datenautomaten am häufigsten verwendet wurden, nämlich Berechnungen für Atomreaktoren. Das starke Interesse der Reaktorfachleute an den Datenautomaten liegt einerseits darin, dass das Feld neu und in rascher Entwicklung ist &ndash; und anderseits, dass man, aufgrund des großen gesellschaftlichen Risikos, das mit Atomreaktoren verbunden ist, selbstverständlich bereit ist, außerordentliches in Richtung sorgfältiger Planung zu unternehmen.",
        "Was man mit Hilfe der Datenautomaten untersucht, sind die physikalischen Bedingungen in den Reaktoren, der Neutronenfluss im Reaktorkern, der Strahlungs- und Wärmeaustausch mit der Umgebung, die Veränderungen des Reaktorbrennstoffs im Laufe der Zeit, das Verhalten des Reaktors im Falle eines Ausfalls verschiedener Steuerungsmechanismen und dergleichen. Die Berechnungen basieren auf umfassendem Wissen über die Eigenschaften der Stoffe, wie es von den Physikern ermittelt wurde. Hinzu kommt umfangreiches Datenmaterial, das den Aufbau des jeweiligen Reaktors beschreibt, den man untersucht. Diese Umstände machen die Berechnungen äußerst schwierig, und es tatsächlich so, dass Reaktorfachleute immer wieder Druck auf die Datenautomatenhersteller ausgeübt haben, um größere und schnellere Datenautomaten zu entwickeln."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Vejanlæg"
      ],
      "german": [
        "Straßenbau"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Flere gode eksempler på samfundsmæssigt betydningsfulde projekteringsopgaver er knyttet til vejbygning. En af de mere enkle problemstillinger her er at finde frem til en placering af en vej gennem et kendt terræn således at jordflyttearbejdet bliver reduceret mest muligt. Ved mere ambitiøse projekter tilstræber man at få datamaten til at medtage stadig flere hensyn ved vejplaceringen, for eksempel vejens overskuelighed for trafikanterne. Ved de mest raffinerede projekter af denne art lader man datamaten fremstille trafikantens udsyn som et billede på et katodestrålerørs skærm, og giver vejingeniøren mulighed for at eksperimentere med vejføringen.",
        "En anden problemstilling fra dette felt er tilrettelæggelsen af vejkryds således at man på én gang opnår stor sikkerhed og god trafikkapacitet. Til arbejder af denne art har man ofte ingen anden måde end at prøve sig frem, eller som det kaldes teknisk, at simulere processen. Denne fremgangsmåde ligner børnenes spil med en vejplan, små modelbiler og terningkast. For at få noget nyttigt frem må man blot omhyggeligt fastlægge spillereglerne således at de afspejler den projekterede vejplan, trafiktætheden, og trafikanternes reaktioner. Mens simulationen er i gang vil man med passende data have et billede af vejkrydset og de køretøjer der i et givet øjeblik befinder sig i det, tillige med deres positioner og den fart og retning de kører, samt oplysninger om førernes egenskaber. Man lader nu tiden forløbe med passende små skridt og holder stadig regnskab med køretøjerne og førernes reaktioner. Når for eksempel en bilist bemærker at den foran kørende bil bremser, da vil han selv bremse, men det sker med en vis forsinkelse, som endda ikke er den samme for alle. Denne variation fra den ene bilist til den anden kan man tage hensyn til ved stadig at lade det der sker være noget afhængig af et element af tilfældighed, som ved kast af en terning. Ved at følge en sådan trafikafvikling gennem et langt tidsrum, som tillader et stort antal køretøjer med egenskaber som fordeler sig realistisk over de kendte variationer i reaktionstid, osv. vil man kunne få en viden om hvor hurtigt trafikken kan afvikles og hvor tit der vil ske uheld. Ved at gennemføre sådanne undersøgelser for forskelligt udformede kryds vil man kunne finde ud af hvilken udformning der er bedst.",
        "Der skal imidlertid spilles længe med et sådant trafikspil før man kan stole på resultatet, og her kommer datamaterne ind, for selv om det kan lyde mærkeligt, så kan hele spillet afvikles i en datamat. Datamaten kan rigtig nok ikke kaste med terning, men dette viser sig ikke at være en afgørende vanskelighed, det er muligt i en datamat at frembringe serier af tal der tilstrækkelig tilfældige til formålet."
      ],
      "german": [
        "Mehrere gute Beispiele für gesellschaftlich bedeutsame Planungsaufgaben sind mit dem Straßenbau verbunden. Eines der einfacheren Probleme hierbei ist es, einen Standort für eine Straße durch bekanntes Gelände zu finden, sodass die Erdbewegungsarbeiten möglichst minimiert werden. Bei ambitionierteren Projekten strebt man an, den Datenautomaten dazu zu bringen, bei der Straßenführung immer mehr Aspekte zu berücksichtigen, zum Beispiel die Übersichtlichkeit der Straße für die Verkehrsteilnehmer. Bei den raffiniertesten Projekten dieser Art lässt man den Datenautomaten das Sichtfeld des Verkehrsteilnehmers als Bild auf einem Kathodenstrahlröhrenbildschirm darstellen und gibt dem Straßenbauingenieur die Möglichkeit, mit der Straßenführung zu experimentieren.",
        "Eine andere Problemstellung aus diesem Bereich ist die Gestaltung von Straßenkreuzungen, sodass man gleichzeitig große Sicherheit und hohe Verkehrskapazität erreicht. Bei Arbeiten dieser Art gibt es oft keine andere Möglichkeit, als es auszuprobieren, oder wie es technisch genannt wird, den Prozess zu simulieren. Diese Vorgehensweise ähnelt dem Spiel von Kindern mit einem Straßenplan, kleinen Modellautos und Würfeln. Um etwas Nützliches zu erzielen, muss man nur sorgfältig die Spielregeln festlegen, sodass sie den geplanten Straßenverlauf, die Verkehrsdichte und die Reaktionen der Verkehrsteilnehmer abbilden. Während die Simulation läuft, wird man mit geeigneten Daten ein Bild der Kreuzung und der Fahrzeuge haben, die sich zu einem bestimmten Zeitpunkt dort befinden, zusammen mit ihren Positionen und der Geschwindigkeit und Richtung, in die sie fahren, sowie Informationen über die Eigenschaften der Fahrer. Man lässt nun die Zeit in geeigneten kleinen Schritten vergehen und verfolgt weiterhin die Fahrzeuge und die Reaktionen der Fahrer. Wenn zum Beispiel ein Autofahrer bemerkt, dass das vorausfahrende Auto bremst, dann wird er selbst bremsen, aber das geschieht mit einer gewissen Verzögerung, die sogar nicht bei allen gleich ist. Diese Variation von einem Autofahrer zum anderen kann man berücksichtigen, indem man das Geschehen weiterhin von einem Element des Zufalls abhängig macht, wie beim Würfeln. Indem man einen solchen Verkehrsfluss über einen langen Zeitraum hinweg verfolgt, der eine große Anzahl von Fahrzeugen mit Eigenschaften enthält, die sich realistisch über die bekannten Schwankungen in der Reaktionszeit verteilen, wird man herausfinden, wie schnell der Verkehr fließen kann und wie oft Unfälle passieren. Indem man solche Untersuchungen für unterschiedlich gestaltete Kreuzungen durchführt, wird man herausfinden können, welche Gestaltung die beste ist.",
        "Man muss jedoch lange mit einem solchen Verkehrsspiel spielen, bevor man dem Ergebnis vertrauen kann und hier kommen die Datenautomaten ins Spiel. Denn auch wenn es merkwürdig klingen mag, kann das ganze Spiel in einem Datenautomaten ablaufen. Der Datenautomat kann zwar keine Würfel werfen, aber das stellt sich nicht als entscheidendes Problem heraus &ndash; es ist möglich, in einem Datenautomaten Zahlenreihen zu erzeugen, die für den Zweck ausreichend zufällig sind."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Penge- og lageradministration"
      ],
      "german": [
        "Geld- und Lagerverwaltung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Lad os nu overveje datamaternes anvendelser til at hjælpe ved overvågningen og styringen af løbende aktiviteter. Først er der hertil at bemærke at en sådan datamæssig overvågning på ingen måde er noget nyt, men i mangfoldige år har fundet sted ved det papir- og kontorarbejde der finder sted i virksomhederne og statsmaskineriet. Det er derfor ikke overraskende at datamaterne først fik indpas i den løbende styring ved at de overtog en del af det papirarbejde der hidtil havde fundet sted. Blandt de første brugere af datamater på dette område var bankerne. Det stof bankerne arbejder med er jo for største delen penge, altså data, lige parat til at bearbejdes med datamat.",
        "Produktionsvirksomheder frembyder langt mere varierende problemer, og udnyttelsen af højt udviklet datamatik kræver en mere omfattende omstilling. Et af de områder der først blev taget op er lagerregnskabet. Det er først og fremmest påtrængende ved produktioner der består i at samle mange smådele til større apparater, for eksempel radioindustrien. Netop på grund af at apparaterne er opbygget af mange smådele er det fristende for fabrikanten at tilbyde mange forskellige varianter af sine produkter. Det virker jo umiddelbart så enkelt blot at sørge for at visse af de dele der indgår i de færdige apparater kan vælges med en passende variation, for eksempel således at et radioapparat kan leveres til flere forskellige forsyningsspændinger, til brug i forskellige lande. Ved mere omfattende produktioner viser det sig dog at problemet at holde styr på en produktion af denne type hurtigt kan vokse uhyggeligt i omfang. For at produktionen skal holdes jævnt kørende er det nødvendigt at de nødvendige enkeltdele hele tiden bringes frem til montørerne til rette tid og i rette mængder, men når der er tale om hundreder af forskellige dele og lige så mange mulige varianter af apparaterne kræver det et stort regnskab at sørge for at forsyningerne stadig afpasses efter ordrerne. Da der tillige må regnes med leveringstider for enkeltdelene kræves der et lager, som er kostbart i forrentning. Lagerets størrelse kan imidlertid reduceres gennem et forbedret regnskab. Alle disse omstændigheder gør at det kan blive i høj grad lønnende at lade det centrale lagerog forsyningsregnskab udføre af en datamat."
      ],
      "german": [
        "Lassen Sie uns nun die Anwendungen der Datenautomaten betrachten, um bei der Überwachung und Steuerung laufender Aktivitäten zu helfen. Zunächst ist hierbei anzumerken, dass eine solche datenbasierte Überwachung keineswegs neu ist, sondern seit vielen Jahren durch die Papier- und Büroarbeit stattfindet, die in den Unternehmen und der Staatsverwaltung durchgeführt wird. Es ist daher nicht überraschend, dass die Datenautomaten zuerst in die laufende Steuerung Einzug erhielten, indem sie einen Teil der Papierarbeit übernahmen, die bisher stattgefunden hatte. Zu den ersten Nutzern von Datenautomaten in diesem Bereich gehörten die Banken. Das Material, mit dem die Banken arbeiten, ist ja größtenteils Geld &ndash; also Daten, die direkt von einem Datenautomaten verarbeitet werden können.",
        "Produktionsunternehmen bieten weitaus variablere Probleme dar, und die Nutzung hochentwickelter <span class=\"alt-term\">Datenverarbeitung / Informatik</span> erfordert eine umfassendere Umstellung. Eines der ersten aufgegriffenen Gebiete war die Lagerbuchhaltung. Diest ist vor allem wichtig bei Produktionen, die darin bestehen, viele Kleinteile zu größeren Geräten zusammenzubauen, zum Beispiel in der Radioindustrie. Gerade weil die Geräte aus vielen Kleinteilen bestehen, ist es für den Hersteller verlockend, viele verschiedene Varianten seiner Produkte anzubieten. Es erscheint ja so einfach, lediglich dafür zu sorgen, dass bestimmte Teile, die in den fertigen Geräten enthalten sind, mit einer passenden Variation ausgewählt werden können &ndash; beispielsweise so, dass ein Radio für mehrere verschiedene Netzspannungen für die Nutzung in verschiedenen Ländern geliefert werden kann. Bei umfangreicheren Produktionen zeigt sich jedoch, dass das Problem, eine Produktion dieser Art zu überwachen, schnell ein erschreckendes Ausmaß annehmen kann. Damit die Produktion gleichmäßig weiterläuft, ist es notwendig, dass die erforderlichen Einzelteile den Monteuren immer rechtzeitig und in der richtigen Menge bereitgestellt werden. Aber wenn es Hunderte verschiedene Teile und ebenso viele mögliche Varianten der Geräte gibt, ist eine komplexe Buchhaltung erforderlich, um sicherzustellen, dass die Lieferungen (der Einzelteile) weiterhin den Bestellungen angepasst werden. Da man zudem mit Lieferzeiten für die Einzelteile rechnen muss, ist ein Lager erforderlich, das in der Finanzierung teuer ist. Die Lagergröße kann jedoch durch eine verbesserte Buchhaltung reduziert werden. All diese Umstände führen dazu, dass es sich in hohem Maße lohnen kann, die zentrale Lager- und Lieferbuchhaltung von einem Datenautomaten durchführen zu lassen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Produktionsplanlægning"
      ],
      "german": [
        "Produktionsplanung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Lagerregnskabet er dog kun én blandt flere datamatiske opgaver der kan være knyttet til en løbende produktion. En mere indviklet problemstilling træffes ved produktionslinier som man finder dem for eksempel på skibsværfter, hvor de enkelte dele af en produktion passerer fra den ene maskine til den den anden i en bestemt rækkefølge. Skibet består af et stort antal sådanne dele af vidt forskellig størrelse og det tidsrum en del er under behandling ved en bestemt maskine varierer i høj grad. Problemet er at afgøre i hvilken rækkefølge man skal fremstille delene således at de uundgåelige ventetider for maskinerne og arbejderne reduceres mest muligt. Denne principielt så simple opgave er ikke let at løse. Når antallet af maskiner og dele der skal fremstilles ikke er helt lille findes der uhyre mange mulige rækkefølger for produktionen, og man kender ingen simple metoder til at finde frem til den bedste. Når dertil kommer at man til stadighed, for eksempel daglig, har brug for at føre produktionsplanen ajour under hensyn til den faktiske udvikling, så kan det ikke overraske at opgaven kan få datamaterne til at strække ud."
      ],
      "german": [
        "Die Lagerbuchhaltung ist jedoch nur eine von mehreren datenautomatenbasierten Aufgaben, die mit einer laufenden Produktion verbunden sein können. Eine kompliziertere Problemstellung findet man bei Produktionslinien, wie man sie zum Beispiel auf Werften findet, wo die einzelnen (Einzel-)Teile einer Produktion in einer bestimmten Reihenfolge von einer Maschine zur nächsten gelangen. Das Schiff besteht aus einer großen Anzahl solcher (Einzel-)Teile in sehr unterschiedlicher Größe, und die Zeitspanne, die ein Teil an einer bestimmten Maschine bearbeitet wird, variiert stark. Das Problem besteht darin, die Reihenfolge festzulegen, in der die Teile hergestellt werden sollen, sodass die unvermeidlichen Wartezeiten für die Maschinen und Arbeiter so weit wie möglich reduziert werden. Diese prinzipiell so einfache Aufgabe ist nicht leicht zu lösen. Wenn die Anzahl der Maschinen und der herzustellenden (Einzel-)Teile nicht gering ist, gibt es unglaublich viele mögliche Produktionsreihenfolgen &ndash; und man kennt keine einfachen Methoden, um die beste von ihnen zu finden. Wenn man dann noch berücksichtigt, dass man ständig, zum Beispiel täglich, die Produktionsplanung in Anbetracht der tatsächlichen Entwicklung aktualisieren muss, dann überrascht es nicht, dass diese Aufgabe die Datenautomaten stark beanspruchen kann."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Direkte datamatisk styring"
      ],
      "german": [
        "Direkte datenautomatenbasierte Steuerung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Den opmærksomme lytter har muligvis bemærket den linie der går gennem de tre sidst omtalte problemstillinger, først pengeregnskabet, derefter lagerregnskabet, og sidst den egentlige produktionsplanlægning. Alle tre berører produktionen, men vi er rykket skridtvis ind mod produktionen selv. Dog har vi endnu ved produktionsplanlægningen arbejdere, værkførere, og andre mennesker som mellemled mellem datamatens resultater og den egentlige bearbejdning af råmaterialerne, ligesom vi forudsætter at de data om situationen, som datamaten behøver, stammer fra mennesker. Den konsekvente forlængelse af denne linie er at datamaten selv kobles direkte til passende måleinstrumenter der overvåger produktionen, og til maskinerne, som da styres direkte af datamaten.",
        "En gennemført datamatisk styring kommer i første række på tale ved storproduktion af ensartede produkter. De mest nærliggende eksempler er kemiske produktioner, blandt andet olieraffinering og syntese af kunstgødning. For at yde deres bedste må sådanne store anlæg stadig justeres for at kompensere for de uundgåelige ændringer i ydre vilkår såsom temperatur og råmaterialernes sammensætning. Hvilke justeringer der til enhver tid er nødvendige kan kun bestemmes ud fra et omfattende materiale af data om anlæggets drift, tryk og temperaturer på talrige steder i anlægget. Ved en datamatisk styring lader man alle målinger blive foretaget af elektriske måleinstrumenter der er direkte koblet til datamaten. I datamaten foregår der til stadighed en kontrol af at anlægget holder sig inden for de sikre grænser, at for eksempel temperaturen ikke noget sted stiger over bestemte grænser. Dertil beregnes de justeringer af ventiler og andre styreorganer som er nødvendige for at opnå den mest økonomiske drift.",
        "Lad os slutte med et eksempel på direkte datamatisk styring der ligger en del nærmere ved de flestes hverdag, og som også ligger på linie med vore eksempler på projektering, nemlig styring af trafik. Ved vejprojektering forsøger man at udforme vejene så godt som muligt, under hensyn til forventede behov. I modsætning hertil affinder man sig ved trafikstyring med vejene som de er, men forsøger at forbedre trafikkens afvikling løbende ved at påvirke trafiklysene og andre signaler til trafikanterne under hensyn til den øjeblikkelige trafiksituation. Et sådant system til datamatisk styring af trafikken har i en årrække været under udvikling i Toronto i Canada. Et stort antal steder i byen er der installeret følere der til enhver tid registrerer trafikstrømmen. Signalerne herfra ledes til en central datamat, som således hele tiden kan have et billede af situationen. Ud fra dette billede styrer datamaten trafiksignalerne således at den forhåndenværende gadekapacitet så godt som muligt stilles til rådighed for det øjeblikkelige trafikbehov. Man behøver ikke at kende meget til omkostningerne ved at udvide gadenettene i eksisterende byer for at forstå at denne måde at udvide kapaciteten kan være endda overordentlig lønnende.",
        "Lad dette sidste eksempel være en illustration af nødvendigheden af at de der har ansvaret for de aktiviteter hvori datamaterne indgår er fuldt fortrolig med datamaternes arbejdsmåde. I anvendelser af denne art er det helt indlysende at datamaten ikke kan opfattes som en tilsats til en iøvrigt lukket konstruktion, men er en helt central bestanddel af systemet. Det vil ikke være muligt at opbygge fuldt datamatisk styrede systemer uden at også dem der udvikler den trafikingeniørmæssige side af sagen har en god fortrolighed med den datamatiske side af sagen. De behøver ikke selv at kunne bygge datamaterne, men de må fuldt ud forstå deres muligheder og begrænsninger og må forstå enkelthederne i den styringsproces datamaten udfører.",
        "Sagt i korthed vil datamaterne ved enhver anvendelse der går ud over de mest primitive former komme til at sidde ved systemernes livsnerve. Den der vil bevare herredømmet over et system af denne art må beherske datamaten."
      ],
      "german": [
        "Der aufmerksame Zuhörer hat möglicherweise den roten Faden bemerkt, der durch die drei zuletzt besprochenen Problemstellungen verläuft: zuerst die Geldbuchhaltung, dann die Lagerbuchhaltung, und zuletzt die eigentliche Produktionsplanung. Alle drei betreffen die Produktion, aber wir haben uns schrittweise auf die Produktion selbst zubewegt. Doch haben wir bei der Produktionsplanung noch Arbeiter, Vorarbeiter und andere Menschen als Bindeglied zwischen den Ergebnissen des Datenautomaten und der eigentlichen Bearbeitung der Rohmaterialien. Ebenso setzen wir voraus, dass die Daten über die Situation, die der Datenautomat benötigt, von Menschen stammen. Die konsequente Verlängerung dieser Linie besteht darin, den Datenautomaten direkt mit geeigneten Messgeräten zu verbinden, die die Produktion überwachen, und mit den Maschinen, die dann direkt vom Datenautomaten gesteuert werden.",
        "Eine vollständig datenautomatenbasierte Steuerung kommt in erster Linie bei der Massenproduktion einheitlicher Produkte in Frage. Die naheliegendsten Beispiele sind chemische Produktionen, unter anderem Ölraffinierung und die Synthese von Kunstdünger. Um ihre beste Leistung zu erbringen, müssen solche großen Anlagen ständig angepasst werden, um die unvermeidlichen Änderungen der äußeren Bedingungen zu kompensieren, wie Temperatur und die Zusammensetzung der Rohmaterialien. Welche Anpassungen zu einem bestimmten Zeitpunkt notwendig sind, kann nur anhand umfangreicher Daten über den Betrieb der Anlage bestimmt werden, wie Druck und Temperaturen an zahlreichen Stellen in der Anlage. Bei einer datenautomatenbasierten Steuerung lässt man alle Messungen von elektrischen Messgeräten durchführen, die direkt mit dem Datenautomaten verbunden sind. Im Datenautomaten findet fortlaufend eine Kontrolle statt, ob die Anlage innerhalb sicherer Grenzen bleibt, dass also zum Beispiel die Temperatur an keiner Stelle über bestimmte Grenzwerte steigt. Darüber hinaus werden die Anpassungen der Ventile und anderer Steuerorgane berechnet, die notwendig sind, um den wirtschaftlichsten Betrieb zu erreichen.",
        "Lasst uns mit einem Beispiel für direkte datenautomatenbasierte Steuerung abschließen, das dem Alltag der meisten Menschen etwas näher liegt und dennoch auf einer Linie mit unseren Beispielen zur Planung liegt, nämlich der Steuerung des Verkehrs. Bei der Straßenplanung versucht man, die Straßen so gut wie möglich zu gestalten, unter Berücksichtigung des erwarteten Bedarfs. Im Gegensatz hierzu nimmt man bei der Verkehrssteuerung die Straßen so, wie sie sind, aber versucht, den Verkehrsfluss durch Beeinflussung der Ampeln und anderer Signale, unter Berücksichtigung der aktuellen Verkehrssituation, zu verbessern. Ein solches System zur datenautomatenbasierten Verkehrssteuerung wurde seit mehreren Jahren in Toronto, Kanada, entwickelt. An vielen Stellen in der Stadt sind Sensoren installiert, die den Verkehrsfluss jederzeit erfassen. Die Signale werden zu einem zentralen Datenautomaten geleitet, der dadurch ständig ein Bild der Situation haben kann. Auf Basis dieses Bildes steuert der Datenautomat die Verkehrssignale, sodass die vorhandene Straßenkapazität so gut wie möglich dem aktuellen Verkehrsbedarf zur Verfügung gestellt wird. Man muss nicht viel über die Kosten zur Erweiterung der Straßennetze in bestehenden Städten wissen, um zu verstehen, dass diese Methode zur Erweiterung der Kapazität äußerst lohnend sein kann.",
        "Lasst dieses letzte Beispiel eine Veranschaulichung für die Notwendigkeit sein, dass diejenigen, die für die Aktivitäten verantwortlich sind, in die Datenautomaten involviert sind, vollständig mit der Arbeitsweise der Datenautomaten vertraut sein müssen. Bei Anwendungen dieser Art ist es völlig offensichtlich, dass der Datenautomat nicht als Zusatz zu einer ansonsten abgeschlossenen Konstruktion betrachtet werden kann, sondern ein zentraler Bestandteil des Systems ist. Es wird nicht möglich sein, vollständig datenautomatenbasierte Systeme zu entwickeln, ohne dass auch diejenigen, die die verkehrstechnische Seite der Angelegenheit entwickeln, mit der datenautomatenbasierten Seite der Angelegenheit gut vertraut sind. Sie müssen nicht selbst in der Lage sein, die Datenautomaten zu bauen, aber sie müssen deren Möglichkeiten und Grenzen vollständig verstehen und die Einzelheiten des Steuerungsprozesses verstehen, den der Datenautomat ausführt.",
        "Kurz gesagt: Datenautomaten werden bei jeder Anwendung, die über die einfachsten Formen hinausgeht, zur Lebensader der Systeme werden. Wer die Kontrolle über ein solches System behalten will, muss den Datenautomaten beherrschen."
      ]
    },
    {
      "type": "section",
      "danish": [
        "FREMTIDSPERSPEKTIVER"
      ],
      "german": [
        "Zukunftsperspektiven"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Vi skal i dag forlænge den linie som allerede har tegnet sig af datamaternes udvikling og brug, og forsøge at få et billede af nogle af de samfundsmæssigt vigtigere muligheder. Jeg skal altså forsøge mig som profet og udsætter mig for risikoen for at blive gjort til grin af eftertiden. Når jeg påtager mig denne tvivlsomme rolle er det fordi vore forestillinger om fremtiden er vigtige for vore dispositioner i nutiden. Jeg vil derfor til slut medtage nogle tanker om hvad vi bør gøre umiddelbart for at datamaterne skal blive til gavn for os alle."
      ],
      "german": [
        "Heute wollen wir die Linie weiterführen, die sich bereits aus der Entwicklung und Nutzung der Datenautomaten abgezeichnet hat, und versuchen, ein Bild einiger der gesellschaftlich bedeutenderen Möglichkeiten zu zeichnen. Ich werde mich also als Prophet versuchen und setze mich dem Risiko aus, von der Nachwelt ausgelacht zu werden. Wenn ich diese zweifelhafte Rolle auf mich nehme, dann deshalb, weil unsere Vorstellungen von der Zukunft wichtig für unsere Entscheidungen in der Gegenwart sind. Ich werde daher abschließend einige Gedanken einbringen, darüber, was wir unmittelbar tun sollten, damit die Datenautomaten uns allen zugutekommen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamater i privatlivet"
      ],
      "german": [
        "Datenautomaten im Privatleben"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "For at begynde så anskueligt som muligt vil jeg først overveje udsigterne til at hvermand vil komme i daglig kontakt med datamaterne. Helt konkret kan man spørge om det vil ende med at vi hver især får vor datamat i huset? I betragtning af hvordan datamaterne er reduceret i størrelse er dette ikke udelukket af praktiske grunde. Således har man allerede for længst udviklet datamater der kun fylder som et sædvanligt radioapparat, til brug i fly og raketter. Når vi alligevel ikke skal vente at disse vil vinde almindeligt indpas i dagliglivet er det fordi behovet for isoleret, personlig datamatisk hjælp vil være forholdsvis begrænset. Der er langt mere grund til at vente en udbredt personlig forbindelse til store centrale datamatiske systemer. Situationen ligner den vi kender fra telefon, radio, og fjernsyn. Der er intet i vejen for at etablere rent personlige kommunikationsnet med disse midler, og sådanne findes som bekendt også, men den store udbredelse finder vi hvor de bruges som bindeled mellem den enkelte person og store centrale anlæg.",
        "Hvis datamatisk tjeneste skal vinde indpas på en analog måde må vi forestille os at den vil virke som en betydelig udvidelse af telefontjenesten. Blandt de etablerede kommunikationstjenester er det jo kun telefonsystemet som byder på den vekselvirkning mellem bruger og system som vil være den væsentlige værdi ved datamatisk tjeneste. Mere konkret kan vi få en forestilling om den sandsynlige udvikling ved at tænke på telefonsystemets særtjenester, især telefonvagten og vækning.",
        "Hvorvidt en offentlig datamatisk tjeneste vil udvikle sig som en udvidelse af telefonsystemet eller som et uafhængigt system skal jeg lade stå åbent. I alle tilfælde vil brugerne få rådighed over hvad jeg skal kalde en terminal, som muligvis kan være et telefonapparat som vi kender det, men som snarere vil være et apparat som også kan trykke meddelelser på papir og som har taster som en skrivemaskine. Terminaler med en fjernsynsskærm er også en mulighed. Ganske som ved telefonen vil kontakten mellem brugeren og centralsystemet foregå i kortere perioder, betinget af et opkald enten fra brugeren eller fra systemet."
      ],
      "german": [
        "Um so anschaulich wie möglich zu beginnen, werde ich zunächst die Prognose betrachten, dass jedermann täglich mit Datenautomaten in Kontakt kommen wird. Konkret kann man fragen, ob es so weit kommt, dass jeder von uns einen Datenautomaten im Haus haben wird. Angesichts der Tatsache, wie die Datenautomaten in ihrer Größe reduziert wurden, ist dies aus praktischen Gründen nicht ausgeschlossen. So wurden bereits Datenautomaten entwickelt, die nur so viel Platz wie ein gewöhnliches Radio einnehmen, zur Verwendung in Flugzeugen und Raketen. Wenn wir dennoch nicht erwarten sollten, dass diese im täglichen Leben allgemein Einzug erhalten werden, liegt es vermutlich daran, dass der Bedarf an isolierter, persönlicher datenautomatenbasierter Hilfe relativ begrenzt sein wird. Viel eher ist damit zu rechnen, dass es weit verbreitete persönliche Verbindungen zu großen zentralen datenautomatenbasierten Systemen geben wird. Die Situation ähnelt der, die wir vom Telefon, Radio und Fernsehen kennen. Es gibt nichts, was dagegen spräche, rein persönliche Kommunikationsnetze mit diesen Mitteln einzurichten, und solche gibt es bekanntlich auch, jedoch findet die große Verbreitung dort statt, wo sie als Verbindungsglied zwischen dem einzelnen Menschen und großen zentralen Anlagen genutzt werden.",
        "Falls datenautomatenbasierte Dienste auf ähnliche Weise Einzug halten sollen, müssen wir uns vorstellen, dass sie als eine erhebliche Erweiterung des Telefondienstes fungieren werden. Unter den etablierten Kommunikationsdiensten ist es ja nur das Telefonnutz, das die Wechselwirkung zwischen Benutzer und System bietet, die den wesentlichen Wert bei datenautomatenbasierten Diensten darstellen wird. Konkreter können wir uns eine Vorstellung von der wahrscheinlichen Entwicklung machen, indem wir an die Sonderdienste des Telefonsystems denken, insbesondere den Anrufbeantworter und die Weckfunktion.",
        "Ob sich ein öffentlicher datenautomatenbasierter Dienst als Erweiterung des Telefonsystems entwickeln wird oder als ein unabhängiges System, möchte ich offenlassen. In jedem Fall werden die Benutzer Zugriff auf das haben, was ich als Terminal bezeichnen möchte, das möglicherweise ein Telefonapparat sein kann, wie wir ihn kennen, aber eher ein Gerät sein wird, das auch Nachrichten auf Papier drucken kann und Tasten wie eine Schreibmaschine hat. Terminals mit einem Fernsehbildschirm sind ebenfalls eine Möglichkeit. Genau wie beim Telefon wird der Kontakt zwischen dem Benutzer und dem Zentralsystem in kürzeren Zeiträumen stattfinden, abhängig von einem Anruf entweder vom Benutzer oder vom System."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Privat regnskab"
      ],
      "german": [
        "Private Buchhaltung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Hvilken glæde vil en bruger nu kunne få af et sådant system? Det mest nærliggende område er hjælp til at holde styr på brugerens økonomiske forhold. Som en helt primitiv anvendelse kan man nævne beregningen af skatten ud fra oplysninger om indkomst og personlige forhold. Ved denne anvendelse, ligesom ved alle de senere nævnte, må man forestille sig at det datamatiske system vil optræde som en høflig hjælper der stiller spørgsmål om hvad det er brugeren ønsker og som stadig er parat til at forklare nærmere hvis brugeren er i tvivl om hvad det er han skal svare på og som kontrollerer sin forståelse ved bekræftende meddelelser.",
        "Hjælpen i økonomiske spørgsmål kan udvides til at brugeren kan få råd vedrørende de gunstigste dispositioner, for eksempel de gunstigste lånemuligheder. Så snart vi tænker på sådanne anvendelser bliver det klart hvorfor det er afgørende at tjenesten er knyttet til et fælles offentligt net, og hvorfor helt private datamater ikke frembyder lignende fordele. Sagen er at den fornuftigste disposition er afhængig af en lang række ydre forhold, skattelovgivning, konjunkturer, priser, og så videre. En effektiv, offentlig tjeneste måtte naturligvis stadig holdes ajour om alle disse forhold, hvilket ikke uden videre ville være tilfældet med et uafhængigt system.",
        "Perspektiverne på dette område rækker dog langt videre. Et centralt datamatisk system vil kunne føre det fuldstændige regnskab for de enkelte brugere. Systemet ville altså kunne overtage de funktioner som allerede nu tilbydes af girokontoret og nogle af bankerne. Betalinger vil derfor kunne foretages uden overføring af penge eller papir, blot gennem en indre dataproces i systemet, som bevirker at betalerens konto for mindskes og modtagerens forøges med beløbet. Vi nærmer os altså et samfund uden repræsentation af pengeværdier i form af mønter og sedler. Herfra er der kun et skridt til en tjeneste som langt mere aktivt hjælper brugeren til at klare de økonomiske forhold. Systemet kunne foretage regelmæssige betalinger efter en besked fra brugeren én gang for alle, kunne udsende opkrævninger og kontrollere at betalingerne gik ind, og kunne holde øje med udviklingen og levere gode råd og forslag om fornuftigere dispositioner."
      ],
      "german": [
        "Welchen Nutzen könnte ein Benutzer aus einem solchen System ziehen? Das naheliegendste Anwendungsgebiet ist Hilfe bei der Verwaltung der finanziellen Angelegenheiten des Benutzers. Als eine ganz einfache Anwendung kann man die Berechnung der Steuern anhand von Informationen über Einkommen und persönliche Verhältnisse nennen. Bei dieser Anwendung, ebenso wie bei allen später genannten, muss man sich vorstellen, dass das datenautomatenbasierte System als höflicher Helfer auftritt, der Fragen stellt, was der Benutzer möchte, und immer bereit ist, näher zu erklären, wenn der Benutzer Zweifel hat, worauf er antworten soll, und seine Verständigung durch bestätigende Mitteilungen überprüft.",
        "Die Hilfe bei finanziellen Fragen kann erweitert werden, sodass der Benutzer Ratschläge zu den vorteilhaftesten Entscheidungen erhalten kann, zum Beispiel die günstigsten Kreditmöglichkeiten. Sobald wir an solche Anwendungen denken, wird klar, warum es entscheidend ist, dass der Dienst mit einem gemeinsamen öffentlichen Netz verbunden ist, und warum völlig private Datenautomaten nicht ähnliche Vorteile bieten (können). Der Punkt ist, dass die vernünftigste Entscheidung von einer Vielzahl äußerer Faktoren abhängt, wie Steuerrecht, Konjunkturen, Preise und so weiter. Ein effizienter, öffentlich zugreifbarer Dienst müsste natürlich stets über all diese Faktoren auf dem Laufenden gehalten werden, was bei einem unabhängigen System nicht ohne Weiteres der Fall wäre.",
        "Die Perspektiven in diesem Bereich reichen jedoch viel weiter. Ein zentrales datenautomatenbasiertes System könnte die vollständige Buchführung für die einzelnen Benutzer übernehmen. Das System könnte also die Funktionen übernehmen, die bereits jetzt von den Postämtern und einigen Banken angeboten werden. Zahlungen könnten daher ohne Überweisung von Geld oder Papier durchgeführt werden, lediglich durch einen internen Datenprozess im System, wodurch das Konto des Zahlenden verringert und das des Empfängers um den Betrag erhöht wird. Wir nähern uns also einer Gesellschaft ohne Darstellung von Geldwerten in Form von Münzen und Scheinen. Von hier ist es nur ein Schritt zu einem Dienst, der dem Benutzer weit aktiver hilft, seine finanziellen Angelegenheiten zu regeln. Das System könnte regelmäßige Zahlungen nach einer einmaligen Anweisung des Benutzers durchführen, könnte Rechnungen versenden und überprüfen, ob die Zahlungen eingegangen sind, und könnte die Entwicklungen überwachen und gute Ratschläge sowie Vorschläge für sinnvollere Entscheidungen geben."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Privat rådgivning"
      ],
      "german": [
        "Private Beratung"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Et system af denne art vil også kunne overtage mange af de simplere informationsformidlinger, som nu ydes af aviser og andre slags skrifter. Hele den kontakt om stillinger og om privat køb og salg af ejendele som nu finder sted gennem dagspressens annoncer kunne overtages af et centralt datamatisk system. Den der vil give et tilbud kunne give mere detaillerede oplysninger end normalt 1 en annonce, og den der ønsker et tilbud kunne ligeledes stille med ret specifikke krav. Systemet kunne da udføre en nøje sammenligning af tilbud og krav og fritage begge parter for at reflektere på muligheder der ligger langt fra ønskerne.",
        "Det centrale datamatiske system ville også kunne holde øje med om bestemte situationer skulle opstå, om for eksempel en bestemt stilling skulle blive opslået ledig, eller en bestemt film skulle blive sat på programmet i en bestemt biograf, eller et bestemt nummer blive udtrukket i lotteriet.",
        "Ved en mere radikal udvidelse kan systemet påtage sig en mere almindelig rådgivningsvirksomhed. Som eksempel kan man tænke på sagførernes simplere opgaver. Når vi søger en sagfører er det ofte blot for at sikre os en rådgiver på vor side der har et nøje kendskab til den gældende lov. Der er intet der forhindrer os i selv at læse loven, uden hjælp, men oftest viger vi tilbage derfra fordi det er for besværligt at uddrage de bestemmelser som har betydning for os. Et centralt datamatisk system, som jævnt hen fik tilføjet oplysninger om ændringer i lovgivningen, kunne rådgive borgerne om den gældende lov og dens betydning for den enkelte."
      ],
      "german": [
        "Ein System dieser Art könnte auch viele der einfacheren Informationsvermittlungen übernehmen, die derzeit von Zeitungen und anderen Arten von Schriften bereitgestellt werden. Der gesamte Kontakt bezüglich Stellenangeboten und dem privaten Kauf und Verkauf von Eigentum, der derzeit durch Anzeigen in der Tagespresse stattfindet, könnte von einem zentralen datenautomatenbasierten System übernommen werden. Derjenige, der ein Angebot machen möchte, könnte detailliertere Informationen geben als normalerweise in einer Anzeige, und derjenige, der ein Angebot wünscht, könnte ebenso recht spezifische Anforderungen stellen. Das System könnte dann einen genauen Vergleich von Angeboten und Anforderungen durchführen und beide Parteien davon entlasten, über Möglichkeiten nachzudenken, die weit von den jeweiligen Wünschen entfernt sind.",
        "Das zentrale datenautomatenbasierte System könnte auch überwachen, ob bestimmte Situationen eintreten würden &mdash; ob zum Beispiel eine bestimmte Stelle ausgeschrieben würde, ein bestimmter Film in einem bestimmten Kino ins Programm aufgenommen würde oder eine bestimmte Nummer in der Lotterie gezogen würde.",
        "Bei einer radikaleren Erweiterung könnte das System eine allgemeinere Beratungstätigkeit übernehmen. Als Beispiel kann man an die einfacheren Aufgaben von Anwälten denken. Wenn wir einen Anwalt aufsuchen, ist es oft nur, um uns einen Berater an unsere Seite zu holen, der ein genaues Wissen über das geltende Recht hat. Es gibt nichts, was uns daran hindert, das Gesetz selbst zu lesen, ohne Hilfe, aber meistens schrecken wir davor zurück, weil es zu mühsam ist, die für uns relevanten Bestimmungen herauszufinden. Ein zentrales datenautomatenbasiertes System, dem regelmäßig Informationen über Gesetzesänderungen hinzugefügt würden, könnte die Bürger über das geltende Recht und dessen Bedeutung für den Einzelnen beraten."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Overvågning af samfundet"
      ],
      "german": [
        "Überwachung der Gesellschaft"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "De anvendelser jeg her har skitseret kan alle opfattes som hjælp til bedre dispositioner for den enkelte borger i en verden fuld af forandringer. Hvis vi vil forestille os fremtidige anvendelser af datamaterne til væsentlige samfundsmæssige opgaver må vi tænke på den analoge problemstilling, forstørret op til landsomfattende eller international målestok. Her må vi tænke på datamaterne som hjælpemidler ved lovgivningen og den offentlige administration. Med datamaternes hjælp er det i hidtil ukendt målestok muligt at indsamle løbende oplysninger om samfundenes udvikling og at bearbejde disse oplysninger til en form som egner sig som grundlag for den lovgivningsmæssige styring. Denne aktivitet er allerede kendt fra det arbejde som udføres af de offentlige statistiske kontorer, men hidtil har tiden fra indsamlingen af oplysninger til de bearbejdede resultater foreligger løbet op til måneder eller år, og værdien af disse oplysninger for den politiske styring har derfor været begrænset til langtidstendenser, ligesom selve den statistiske bearbejdelse indebærer at de fleste af oplysningernes detailler bortkastes.",
        "Ved en datamatisk overvågning vil oplysningerne kunne underkastes en langt mere indgående analyse hvorved mere indviklede sammenhænge 1 samfundets dynamik vil kunne opdages. Lad os som eksempel tænke på sundhedsvæsenet. Overblikket over befolkningens sundhedstilstand hviler på oplysninger om den enkelte, som til stadighed indhentes i støre mængder på hospitalerne og hos lægerne. Hidtil har anvendelsen af disse mængder af oplysninger væsentlig været begrænset til at afklare akutte tilstande, mens en systematisk efterbearbejdelse af materialet kun har været foretaget i begrænset omfang. Men paradoksalt nok forholder det sig sådan at efterhånden som man forbedrer den almindelige sundhedstilstand bliver det vanskeligere at efterspore og opklare sygdomme — når hver enkelt læge kun undtagelsesvis får en bestemt sygdomstilstand at se vil det blive vanskeligere at erkende det fælles billede der er grundlaget for at identificere en sygdom og efterspore dens årsag. Med en centraliseret datamatisk opsamling og bearbejdning af oplysningerne om den enkelte borgers sundhedstilstand vil det blive muligt at nyttiggøre dem i langt højere grad, således at man for eksempel tidligere kan efterspore sygdomskilder."
      ],
      "german": [
        "Die hier skizzierten Anwendungen können alle als Hilfe für bessere Entscheidungen des einzelnen Bürgers in einer Welt voller Veränderungen betrachtet werden. Wenn wir uns zukünftige Anwendungen von Datenautomaten für wesentliche gesellschaftliche Aufgaben vorstellen wollen, müssen wir auch an analoge Problemstellung denken, vergrößert auf landesweite oder internationale Ebene. Hier müssen wir an Datenautomaten als Hilfsmittel für die Gesetzgebung und die öffentliche Verwaltung denken. Mit Hilfe der Datenautomaten ist es in bisher unbekanntem Umfang möglich, laufend Informationen über die gesellschaftliche Entwicklung zu sammeln und diese Informationen so zu verarbeiten, dass sie als Grundlage für die gesetzgeberische Steuerung geeignet sind. Diese Tätigkeit ist bereits von der Arbeit der öffentlichen Statistikämter bekannt, aber bisher hat die Zeitspanne von der Datensammlung bis zu den vorliegenden aufbereiteten Ergebnissen Monate oder Jahre betragen, und der Wert dieser Informationen für die politische Steuerung war daher auf langfristige Trends beschränkt, ebenso wie die statistische Bearbeitung selbst bedeutet, dass die meisten Details der Informationen verworfen werden.",
        "Bei einer datenautomatenbasierten Überwachung könnten die Informationen einer weitaus gründlicheren Analyse unterzogen werden, wodurch komplexere Zusammenhänge in der Dynamik der Gesellschaft erkannt werden könnten. Lasst uns als Beispiel an das Gesundheitswesen denken. Der Überblick über den Gesundheitszustand der Bevölkerung beruht auf Informationen über den Einzelnen, die fortlaufend in großen Mengen in Krankenhäusern und bei Ärzten erhoben werden. Bisher war die Nutzung dieser Informationsmengen im Wesentlichen auf die Klärung akuter Zustände beschränkt, während eine systematische Nachbearbeitung des Materials nur in begrenztem Umfang durchgeführt wurde. Paradoxerweise verhält es sich jedoch so, dass es schwieriger wird, Krankheiten nachzuverfolgen und aufzuklären, je mehr sich der allgemeine Gesundheitszustand verbessert, wenn jeder einzelne Arzt nur ausnahmsweise einen bestimmten Krankheitszustand zu Gesicht bekommt. Dies erschwert es, das gemeinsame Bild zu erkennen, das die Grundlage für die Identifizierung einer Krankheit und die Nachverfolgung ihrer Ursache bildet. Mit einer zentralisierten datenautomatenbasierten Erfassung und Verarbeitung der Informationen über den Gesundheitszustand des einzelnen Bürgers wäre es möglich, sie in weit höherem Maße zu nutzen, sodass man zum Beispiel früher Krankheitsursachen nachverfolgen kann."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Sikring af privatlivets fred"
      ],
      "german": [
        "Schutz der Privatsphäre"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Den overvågning af borgerne som bliver mulig i det datamatiserede samfund indebærer den fare at oplysningerne vil blive misbrugt, altså at oplysninger der med befolkningens viden og ønske er blevet indsamlet til visse formål, imod dette ønske bliver benyttet af mindre grupper som våben mod andre grupper eller individer. Farerne herved er allerede kommet frem ved de misbrug af efterretningsvæsenets kartoteker som har været omtalt i dagspressen i de senere år, og det fremgår heraf at faren ikke udelukkende er knyttet til datamatiske kartoteker. Ved brug af datamater vil det imidlertid blive muligt at holde styr på flere oplysninger om flere borgere, og det vil blive lettere at søge frem til bestemte oplysninger. Der ligger heri en fristelse for administrationen til at ophobe oplysninger, for det tilfælde at de senere skulle vise sig at være nyttige. Omfanget af et muligt misbrug kan herved øges uhyggeligt.",
        "Af denne grund må det være klart at etable- - ringen af offentlige datamatiske medborgerregistre bør ledsages af en omhyggelig lovgivning til at forhindre misbrug. Blandt de forholdsregler denne lovgivning bør omfatte kan især nævnes tre, For det første bør tilgangen af oplysninger til registret i videst mulige omfang begrænses til oplysninger der er godkendt af den pågældende borger, eller som borgeren har haft mulighed for at imødegå ved hjælp af en offentligt beskikket forsvarer. Enhver borger må have ret til at betragte enhver oplysning om hans person der indgår i registret som et vidneudsagn der kan blive brugt imod ham og må sikres et sædvanligt retsligt forsvar. For det andet bør systemet være opbygget omkring en nøje klassifikation af oplysningerne, svarende til hemmeligholdelsesgraden, med en tilsvarende graduering af den kontrol der finder sted ved henvendelser udefra med anmodning om at oplysningerne udleveres. Helt almindeligt må det gælde at fremskaffelsen af dybt hemmelige oplysninger må kræve en mere besværlig og tidsrøvende kontrol af at henvendelsen er berttiget. For det tredie bør systemet være forberedt på i en ekstraordinær situation med kort varsel at destruere visse dele af registret, efter ordre fra regeringen.",
        "På den anden side må det ikke overses at datamaterne på grund af deres systematiske arbejdsmåde yder den fordel at det er muligt at sørge for at én gang fastlagte administrative kontrolprocedurer virkelig stadig overholdes, uden at man er meget afhængig af fortsat menneskelig påpasselighed. Det springende punkt er den oprindelige udformning af systemet. Her er der brug for en kombination af indsigt i fremkommelige fremgangsmåder til hemmeligholdelse som man må kunne hente hos den militære sagkundskab, dertil indsigt i retsbeskyttelsen, som den kan ydes fra juridisk hold, og endelig viden om datamatiske muligheder. En gruppe med denne indsigt måtte kunne udarbejde forslag som basis for et politisk valg. Betingelsen for at vi skal bevare herredømmet er i denne sag, som i alle tilsvarende, at de der har ansvaret for udformningen virkelig forstår de processer datamaterne udfører for os."
      ],
      "german": [
        "Die Überwachung der Bürger, die in der datenautomatenbasierten Gesellschaft möglich wird, birgt die Gefahr, dass die Informationen missbraucht werden, also dass Informationen, die mit dem Wissen und dem Wunsch der Bevölkerung zu bestimmten Zwecken gesammelt wurden, gegen diesen Wunsch von kleineren Gruppen als Waffe gegen andere Gruppen oder Einzelpersonen verwendet werden. Die Gefahren sind bereits durch den Missbrauch der Akten des Nachrichtendienstes ans Licht gekommen, der in den letzten Jahren in der Tagespresse erwähnt wurde <sup class=\"footnote-ref\" data-footnote-id=\"6.1\">6.1</sup> und daraus ergibt sich, dass die Gefahr nicht ausschließlich mit datenautomatenbasierten Karteien verbunden ist. Durch den Einsatz von Datenautomaten wird es jedoch möglich, mehr Informationen über mehr Bürger zu verwalten, und es wird einfacher, bestimmte Informationen zu finden. Darin liegt eine Versuchung für die Verwaltung, Informationen zu horten, für den Fall, dass sie sich später als nützlich erweisen könnten. Das Ausmaß eines möglichen Missbrauchs kann dadurch erschreckend vergrößert werden.",
        "Aus diesem Grund muss klar sein, dass die Einrichtung öffentlicher datenautomatenbasierter Bürgerregister von einer sorgfältigen Gesetzgebung begleitet werden sollte, um Missbrauch zu verhindern. Unter den Maßnahmen, die diese Gesetzgebung umfassen sollte, können insbesondere drei genannt werden. Erstens sollte der Zugang zu den Informationen im Register so weit wie möglich auf Informationen beschränkt werden, die von dem betreffenden Bürger genehmigt wurden oder denen der Bürger mithilfe eines öffentlich bestellten Vorsprechers entgegentreten konnte. Jeder Bürger muss das Recht haben, jede Information über seine Person, die im Register enthalten ist, als Zeugenaussage zu betrachten, die gegen ihn verwendet werden könnte, und muss eine übliche rechtliche Verteidigung gewährleistet bekommen. Zweitens sollte das System um eine genaue Klassifizierung der Informationen herum aufgebaut sein, entsprechend dem Geheimhaltungsgrad, mit einer entsprechenden Abstufung der Kontrolle bei Anfragen von außen, die die Herausgabe der Informationen verlangen. Ganz allgemein sollte gelten, dass die Beschaffung von streng geheimen Informationen eine aufwendigere und zeitintensivere Überprüfung der Berechtigung der Anfrage erfordern muss. Drittens sollte das System darauf vorbereitet sein, in einer außergewöhnlichen Situation mit kurzer Vorankündigung bestimmte Teile des Registers auf Anordnung der Regierung zu vernichten.",
        "Andererseits darf nicht übersehen werden, dass Datenautomaten aufgrund ihrer systematischen Arbeitsweise den Vorteil bieten, dass es möglich ist sicherzustellen, dass einmal festgelegte administrative Kontrollverfahren wirklich weiterhin eingehalten werden, ohne dass man stark von anhaltender menschlicher Sorgfalt abhängig ist. Der entscheidende Punkt ist die ursprüngliche Gestaltung des Systems. Hier ist eine Kombination aus Einsicht in praktikable Methoden zur Geheimhaltung erforderlich, die man von militärischem Fachwissen ableiten kann, dazu Einsicht in den Rechtsschutz, wie er von juristischer Seite geboten werden kann, und schließlich Wissen über datenautomatenbasierte Möglichkeiten. Eine Gruppe mit dieser Einsicht müsste in der Lage sein, Vorschläge als Grundlage für eine politische Entscheidung zu erarbeiten. Die Voraussetzung dafür, dass wir die Kontrolle behalten, ist in diesem Fall &ndash; wie in allen entsprechenden Fällen &ndash; dass diejenigen, die für die Gestaltung verantwortlich sind, die Prozesse, die die Datenautomaten für uns ausführen, wirklich verstehen."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Datamaternes fremtrængen"
      ],
      "german": [
        "Das Vordringen der Datenautomaten"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "Som det sidste emne for disse forelæsninger vil jeg nu overveje de problemer der på dette område umiddelbart rejser sig for vore erhversvirksomheder og for vort land som helhed. Det er ikke nogen tilfældighed at disse problemer kan slås sammen under ét. Med en vis rimelighed kan man betragte et land som en virksomhed i større skala, som står overfor andre lande på samme måde som virksomhederne står overfor hinanden, i et forhold præget såvel af indbyrdes afhængighed som af konkurrence.",
        "Ved generelle overvejelser på dette niveau må vi først og fremmest interessere os for styring, altså kombinationen af en løbende indsamling af data om verdens gang og en kombinering af disse data til en beslutning om hvad vi i hvert øjeblik skal gøre for at forløbet skal følge en ønske lig retning. Det første vi må indse er at vi, det vil sige både vore virksomheder og den offentlige forvaltning, før eller siden vil blive tvunget over i at bruge datamatisk styring. Dette følger direkte af konkurrencen. Omkostningerne ved at gennemføre en vis dataproces med en datamat vil nemlig efter alt at dømme endnu i lang tid fortsætte ad den hastigt faldende kurve, der i løbet af de sidste fem år har reduceret prisen til en tiendedel. Samtidig er omkostningerne ved at gennemføre de samme dataprocesser med menneskelig arbejdskraft stigende.",
        "Den næste væsentlige omstændighed ved datamatikkens fremtrængen er at omstillingen til datamatisk styring nødvendigvis må foregå under ledelse af de pågældende virksomheder selv, hvad enten disse er private eller offentlige. Det er en farlig misforståelse at tro at denne nye teknik kan købes som en færdig pakke, som man for eksempel i en virksomhed køber en lastbil. Styringen af en virksomhed berører hele beslutnings- og magtfordelingen inden for virksomheden. Udformningen af styringssystemet kan ikke overlades til udenforstående uden at evnen til efter eget ønske at ændre på styringssystemet, og i sidste instans selvstændigheden, går tabt. På det nationale plan berøres selve lovgivningen.",
        "Virksomhederne og den offentlige administration vil altså blive tvunget til at indføre datamatisk styring og må selv lede udviklingen hver på deres område. Men hertil behøver de yderligere støtte fra specialister på området datalogi og datamatik. Som den tredie væsentlige omstændighed ved situationen må fremhæves at denne støtte, for at være effektiv, må kunne hentes hos lokale kyndige. Indarbejdelsen af datamatisk styring i en virksomhed kræver en lang overgangsperiode præget af et nært samarbejde med datamatiske eksperter, og dette samarbejde vil hæmmes af alle geografiske og sproglige forskelle. En af forudsætningerne for at denne støtte kan være til rådighed er at datalogien vinder indpas i uddannelserne, både alment og som specialstudium.",
        "Placeringen af et fag i uddannelsen alene behøver ikke at være tilstrækkelig til at sikre det den støtte der er ønskelig fra et samfundssynspunkt. Det mest fremtrædende udslag af denne erkendelse inden for vore grænser er etableringen af atomenergikommissionens forsøgsanlæg ved Risø. Begrundelsen for Risø er at de øvrige energikilders utilstrækkelighed inden for en overskuelig tid vil tvinge os til at gå over til atomenergi. For at bevare en rimelig national uaf hængighed på dette område er det nødvendigt at vi råder over første rangs sagkundskab der stadig kan vurdere mulighederne ud fra vort synspunkt. Men en sådan sagkundskab kan kun erhverves og holdes vedlige af folk der stadig kan arbejde med forskning og udvikling på området. Denne virksomhed finder sted på Risø."
      ],
      "german": [
        "Als letztes Thema dieses Vorlesungsteils möchte ich nun die Probleme betrachten, die sich in diesem Bereich unmittelbar für unsere Unternehmen und für unser Land als Ganzes ergeben. Es ist kein Zufall, dass diese Probleme unter einem Punkt zusammengefasst werden können. Man kann mit einer gewissen Berechtigung ein Land als ein Unternehmen im größeren Maßstab betrachten, das anderen Ländern in gleicher Weise gegenübersteht wie Unternehmen einander, in einem Verhältnis, das sowohl durch gegenseitige Abhängigkeit als auch durch Konkurrenz geprägt ist.",
        "Bei allgemeinen Überlegungen auf diesem Niveau müssen wir uns in erster Linie für Steuerung interessieren, also die Kombination einer laufenden Sammlung von Daten über den Lauf der Welt und einer Kombination dieser Daten zu einer Entscheidung darüber, was wir zu jedem Zeitpunkt tun sollen, damit der Verlauf einer gewünschten Richtung folgt. Das Erste, was wir erkennen müssen, ist, dass wir &ndash; das heißt sowohl unsere Unternehmen als auch die öffentliche Verwaltung &ndash; früher oder später gezwungen sein werden, datenautomatenbasierte Steuerung einzusetzen. Dies folgt direkt aus dem Wettbewerb. Die Kosten für die Durchführung eines bestimmten Datenprozesses mit einem Datenautomaten werden aller Voraussicht nach noch lange dem steil abfallenden Kurvenverlauf folgen, der in den letzten fünf Jahren den Preis (bereits) auf ein Zehntel gesenkt hat. Gleichzeitig steigen die Kosten für die Durchführung derselben Datenprozesse mit menschlicher Arbeitskraft.",
        "Die nächste wesentliche Gegebenheit beim Vordringen der <span class=\"alt-term\">Datenauotmatik / Informatik</span> ist, dass die Umstellung auf datenautomatenbasierte Steuerung notwendigerweise unter der Leitung der betreffenden Unternehmen selbst erfolgen muss, ob es sich um private oder öffentliche Unternehmen handelt. Es ist ein gefährliches Missverständnis zu glauben, dass diese neue Technik als fertiges Paket gekauft werden kann &ndash; wie man zum Beispiel in einem Unternehmen einen Lastwagen kauft. Die Steuerung eines Unternehmens betrifft die gesamte Entscheidungs- und Machtverteilung innerhalb des Unternehmens. Die Gestaltung des Steuerungssystems kann nicht an Außenstehende überlassen werden &ndash; sonst verliert man die Fähigkeit, dieses Steuerungssystem nach eigenem Wunsch zu ändern, und letztlich die Unabhängigkeit. Auf nationaler Ebene wird sogar die Gesetzgebung selbst berührt.",
        "Die Unternehmen und die öffentliche Verwaltung werden also gezwungen sein, datenautomatenbasierte Steuerung einzuführen und müssen die Entwicklung jeweils in ihrem Bereich selbst leiten. Dazu benötigen sie jedoch zusätzliche Unterstützung von Spezialisten auf dem Gebiet der <span class=\"alt-term\">Datalogie und Datenverarbeitung / Informatik</span>. Als dritte wesentliche Gegebenheit der Situation muss hervorgehoben werden, dass diese Unterstützung, um effektiv zu sein, von lokalen Fachleuten bezogen werden muss. Die Einführung der datenautomatenbasierten Steuerung in ein Unternehmen erfordert eine lange Übergangszeit, geprägt von einer engen Zusammenarbeit mit datenautomatenkundigen Experten, und diese Zusammenarbeit wird durch alle geografischen und sprachlichen Unterschiede behindert werden. Eine der Voraussetzungen dafür, dass diese Unterstützung zur Verfügung stehen kann, ist, dass die <span class=\"alt-term\">Datalogie / Informatik</span> in die Ausbildung Einzug erhält &ndash; sowohl allgemein als auch als Spezialstudium.",
        "Die Aufnahme eines Fachs in die Ausbildung allein muss nicht ausreichen, um die Unterstützung sicherzustellen, die aus gesellschaftlicher Sicht wünschenswert ist. Der auffälligste Ausdruck dieser Erkenntnis innerhalb unserer (dänischen) Grenzen ist die Einrichtung der Versuchsanlage der Atomenergiekonmission in Risø. Die Begründung für Risø ist, dass uns die Unzulänglichkeit der übrigen Energiequellen in absehbarer Zeit zwingen wird, auf Atomenergie umzusteigen. Um eine angemessene nationale Unabhängigkeit auf diesem Gebiet zu bewahren, ist es notwendig, dass wir über erstklassiges Fachwissen verfügen, welches weiterhin die Möglichkeiten von unserem Standpunkt aus bewerten kann. Aber ein solches Fachwissen kann nur von Personen erworben und aufrechterhalten werden, die weiterhin in Forschung und Entwicklung auf diesem Gebiet tätig sind. Diese Tätigkeit findet in Risø statt."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Nationerne ruster sig"
      ],
      "german": [
        "Die Nationen rüsten sich"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "I samfundsmæssig betydning står datalogien på ingen måde tilbage for studiet af atomenergien. I U.S.A. hvor der er en stærk gensidig påvirkning mellem samfundet og teknikkens og forskningens resultater, har dette for længst givet sig udslag i en vældig aktivitet omkring datamaterne. De europæiske lande, først og fremmest England, stod omkring 1950 fuldt på højde med U.S.ÅA., men er siden gledet bagud, i den forstand at man i stadig stigende omfang har importeret amerikanske datamater og har været afhængig af amerikanske ideer, og tager man området som helhed ligger U.S.A. klart forud for den øvrige verden. Blandt årsagerne hertil kan man utvivlsomt nævne den større kapitalkoncentration i U.S.A., men dette dækker slet ikke hele sagen. Langt vigtigere er formentlig den fleksibilitet der præger tankegangen og in stitutionerne, deriblandt universiteterne, i U.S.A. Den traditionalisme og stivhed der præger de europæiske universiteter, med deres faste stabe af urørlige professorer, har på dette, som på mange andre områder, voldt de europæiske lande umådelig skade.",
        "I adskillige europæiske lande findes der dog nu en erkendelse af at denne udvikling betyder en alvorlig trussel mod vore samfund og man træffer tegn på en vilje til at dæmme op for den voksende amerikanske dominering på området. I Frankrig har man således set at amerikanske opkøb af franske datamatfabrikker er blevet besvaret med en statsstøtte til opbygning af en konkurrencedygtig fransk industri. Denne støtte beløber sig til over 600 millioner kroner over årene 1967 til 71. I England har man besluttet sig til at forbedre universiteternes udrustning med datamater for et beløb af 600 millioner kroner over de næste seks år. I Norge har staten besluttet sig til at bruge omkring 50 millioner kroner i løbet af fem år."
      ],
      "german": [
        "In gesellschaftlicher Bedeutung steht die <span class=\"alt-term\">Datalogie / Informatik</span> dem Studium der Atomenergie in keiner Weise nach. In den USA, wo es eine starke gegenseitige Beeinflussung zwischen der Gesellschaft und den Ergebnissen der Technik und Forschung gibt, hat sich dies längst in einer enormen Aktivität rund um die Datenautomaten niedergeschlagen. Die europäischen Länder, allen voran England, waren um 1950 voll auf Augenhöhe mit den USA, sind aber seither zurückgefallen &ndash; in dem Sinne, dass man in zunehmend größerem Umfang amerikanische Datenautomaten importierte und von amerikanischen Ideen abhängig war. Betrachtet man das Gebiet insgesamt, liegen die USA eindeutig vor dem Rest der Welt. Unter den Gründen hierfür kann man zweifellos die größere Kapitalkonzentration in den USA nennen, aber das erklärt keineswegs die ganze Sache. Weitaus wichtiger ist vermutlich die Flexibilität, die das Denken und die Institutionen &ndash; darunter auch die Universitäten &ndash; in den USA kennzeichnet. Der Traditionalismus und die Starrheit, die die europäischen Universitäten mit ihren festen Stäben von unantastbaren Professoren prägen, haben auf diesem, wie auf vielen anderen Gebieten, den europäischen Ländern enormen Schaden zugefügt.",
        "In mehreren europäischen Ländern gibt es jedoch inzwischen die Erkenntnis, dass diese Entwicklung eine ernsthafte Bedrohung für unsere Gesellschaften darstellt, und es gibt Anzeichen für den Willen, der zunehmenden amerikanischen Dominanz auf diesem Gebiet entgegenzuwirken. In Frankreich hat man beispielsweise gesehen, dass amerikanische Aufkäufe französischer Datenautomatenfabriken mit staatlicher Unterstützung für den Aufbau einer wettbewerbsfähigen französischen Industrie beantwortet wurden. Diese Unterstützung beläuft sich auf über 600 Millionen Kronen in den Jahren 1967 bis 1971 <sup class=\"footnote-ref\" data-footnote-id=\"6.2\">6.2</sup>. In England hat man beschlossen, die Ausstattung der Universitäten mit Datenautomaten in den nächsten sechs Jahren um einen Betrag von 600 Millionen Kronen zu verbessern. In Norwegen hat der Staat beschlossen, in den nächsten fünf Jahren etwa 50 Millionen Kronen zu investieren <sup class=\"footnote-ref\" data-footnote-id=\"6.3\">6.3</sup>."
      ]
    },
    {
      "type": "subsection",
      "danish": [
        "Danmarks situation"
      ],
      "german": [
        "Die Situation Dänemarks"
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "I sammenligning hermed er det der hidtil er gjort af den danske stat meget beskedent. Det er så meget mere trist som både vor hjemlige produk tion af datamater og den brug der er gjort af disse datamater i både private og statslige virksomheder har været fuldt ud konkurrencedygtige. En stor del af problemet må søges i en traditionel mangel på kontakt og deraf følgende mistillid mellem på den ene side statsvirksomhederne, specielt universiteterne og centraladministrationen, og på den anden side industrivirksomhederne. Når disse blandes med nationale mindreværdskomplekser og en tilsvarende blåøjet tillid til amerikansk teknik kan man komme i den besynderlige situation at vore højere læreanstalter afviser konstruktive tilbud om samarbejde fra dansk industri, ud fra en frygt for usaglige motiver bag tilbudet, hvorefter man kaster sig i armene på et amerikansk gigantforetagende, hvis kommercielle motiver ingen har grund til at tvivle om.",
        "Hvad vi har brug for er to ting. For det første en kraftig styrkelse af uddannelsen i datalogi på alle niveauer, ikke mindst ved de højere læreanstalter. Udviklingen hemmes her ganske væsentligt af uddannelsessystemets traditionelle stivhed. Der er dog en voksende erkendelse af at en usædvanlig indsats er påkrævet, omend resultaterne stadig lader vente på sig. Det er også værd at nævne at de uafhængige erhvervsvirk somheder har følt mangelen på uddannelsesmuligheder så stærkt at de for nylig har dannet et erhvervenes uddannelsesfond for elektronisk databehandling, med betydelig økonomisk rygdækning.",
        "Den anden ting vi har brug for er at fremhjælpe vor uafhængighed på området, ved at yde statsstøtte til hjemlig forsknings- og udviklingsvirksomhed, således at vi vil få en gunstig jordbund for en uafhængig udnyttelse af mulighederne. For at en sådan støtte skal blive gavnlig for landet som helhed er det vigtigt at det arbejde der gøres stadig holdes i kontakt med de dele af erhvervslivet der kan drage nytte deraf. Af denne grund er tanken om en uafhængig statslig forskningsinstitution, et datalogiens Risø, mindre frugtbar. Hvad man snarere måtte overveje er en stærk udvidelse af mulighederne for at yde støtte til sådanne erhvervsvirksomheder, som selv er interesserede i at arbejde med at udvikle nye datamatiske løsninger inden for deres eget felt, til at disse virksomheder kunne erhverve sig den nødvendige indsigt gennem efteruddannelse af medarbejdere og gennem samarbejde med uafhængige datalogiske specialistvirksomheder. I betragtning af hvad der hidtil er nået herhjemme kunne en sådan støtte forventes at give endda overordentlig gode resultater. Det bør også nævnes at den form for støtte der her anbefales allerede nu praktiseres gennem det erhversforskningsfond der er etableret af Danmarks teknisk-videnskabelige Forskningsråd.",
        "Lad os resumere: vi skal ikke vente at datamaterne vil påvirke den ydre form for vort dagligliv så meget som for eksempel bilerne eller fjernsynet. Virkningen ligger dybere, i vor tankegang og den måde vi går i lag med problemerne i virksomhederne og i det offentlige maskineri. Specielt vil forandringerne gælde administration og ledelse, som står over for dybtgående ændringer i arbejdsform. Hvad specielt angår Danmarks muligheder for at hævde sig, så har vi svagheder, men også stærke punkter, og situationen giver os grund til behersket optimisme."
      ],
      "german": [
        "Im Vergleich dazu ist das, was der dänische Staat bisher unternommen hat, sehr bescheiden. Das ist umso trauriger, weil sowohl unsere heimische Produktion von Datenautomaten als auch deren Einsatz in privaten und staatlichen Unternehmen voll konkurrenzfähig gewesen sind. Ein großer Teil des Problems liegt in dem traditionellen Kontaktmangel und daraus resultierendem Misstrauen zwischen den staatlichen Unternehmen auf der einen Seite &ndash; insbesondere den Universitäten und der Zentralverwaltung &ndash; und den Industrieunternehmen auf der anderen Seite. Wenn dies mit nationalen Minderwertigkeitskomplexen und einem ebenso blauäugigen Vertrauen in die amerikanische Technik vermischt wird, kann man in die merkwürdige Situation geraten, dass unsere Hochschulen konstruktive Kooperationsangebote der dänischen Industrie aus Angst vor unsachlichen Motiven hinter dem Angebot ablehnen, woraufhin man sich in die Arme eines amerikanischen Großunternehmens stürzt, dessen kommerzielle Motive niemand anzweifeln muss.",
        "Was wir brauchen, sind zwei Dinge. Erstens eine deutliche Stärkung der Ausbildung in der <span class=\"alt-term\">Datalogie / Informatik</span> auf allen Ebenen, nicht zuletzt an den Hochschulen. Die Entwicklung wird hier erheblich durch die traditionelle Starrheit des Bildungssystems gehemmt. Es gibt jedoch ein wachsendes Bewusstsein dafür, dass ein außergewöhnlicher Einsatz erforderlich ist, obwohl die Ergebnisse noch auf sich warten lassen. Es ist auch erwähnenswert, dass die unabhängigen Unternehmen den Mangel an Ausbildungsmöglichkeiten so stark empfunden haben, dass sie kürzlich einen Ausbildungsfonds der Wirtschaft für elektronische Datenverarbeitung gegründet haben - mit erheblicher finanziellen Mitteln.",
        "Das zweite, was wir brauchen, ist die Förderung unserer Unabhängigkeit auf diesem Gebiet durch staatliche Unterstützung für heimische Forschungs- und Entwicklungsarbeit, sodass wir einen günstigen Boden für eine unabhängige Nutzung der Möglichkeiten schaffen. Damit eine solche Unterstützung für das Land als Ganzes nützlich ist, ist es wichtig, dass die geleistete Arbeit weiterhin in Kontakt mit den Teilen der Wirtschaft steht, die davon profitieren können. Aus diesem Grund ist die Idee einer unabhängigen staatlichen Forschungseinrichtung, einem Risø der <span class=\"alt-term\">Datalogie / Informatik</span>, weniger fruchtbar. Vielmehr sollte man eine deutliche Erweiterung der Möglichkeiten zur Unterstützung solcher Unternehmen in Betracht ziehen, die selbst daran interessiert sind, neue datenautomatenbasierte Lösungen in ihrem eigenen Bereich zu entwickeln, damit diese Unternehmen das notwendige Wissen durch Weiterbildung ihrer Mitarbeiter und durch Zusammenarbeit mit unabhängigen <span class=\"alt-term\">datalogischen / informatischen</span> Spezialunternehmen erwerben können. Angesichts dessen, was bisher im Land erreicht wurde, könnte eine solche Unterstützung voraussichtlich sogar außerordentlich gute Resultate erzielen. Es sollte auch erwähnt werden, dass die hier empfohlene Art der Unterstützung bereits durch den Forschungsfonds für die Wirtschaft praktiziert wird, der vom (besagten) Dänischen Technisch-Wissenschaftlichen Forschungsrat eingerichtet wurde.",
        "Lasst uns zusammenfassen: Wir sollten nicht erwarten, dass Datenautomaten die äußere Form unseres täglichen Lebens so sehr beeinflussen werden wie zum Beispiel Autos oder Fernseher. Die Wirkung liegt tiefer, in unserem Denken und der Art, wie wir die Probleme in den Unternehmen und in der öffentlichen Verwaltung angehen. Besonders werden die Veränderungen die Verwaltung und Führung betreffen, die vor tiefgreifenden Änderungen in der Arbeitsweise stehen. Was speziell Dänemarks Möglichkeiten betrifft, sich zu behaupten, so haben wir Schwächen, aber auch starke Punkte, und die Situation gibt uns Grund zu verhaltenem Optimismus."
      ]
    },
    {
      "type": "paragraph",
      "danish": [
        "<sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup> Princippet at lagre programmet for løsningen af en opgave i datamatens almindelige indre lager bør efter hvad Maurice Wilkes i 1967 oplyser i sin ACM \"Turing Lecture rettelig tilskrives Eckert og Mauchly, fædrene til den første elektroniske regnemaskine."
      ],
      "german": [
        "<sup class=\"footnote-ref\" data-footnote-id=\"1.1\">1.1</sup> Anmerkung von Naur zum Text (verlinkt in Kapitel 1.1 und 4.2): Das Prinzip, das Programm zur Lösung einer Aufgabe in einem allgemeinen internen Speicher der Datenmaschine zu speichern, sollte, so Maurice Wilkes 1967 in seiner ACM Turing Lecture, zu Recht Eckert und Mauchly, den Vätern der ersten elektronischen Rechenmaschine, zugeschrieben werden.",
        "<sup class=\"footnote-ref\" data-footnote-id=\"1.2\">1.2</sup> Sinngemäße Beschreibung. Im Original wird gesagt, dass sich die Firma mit dem Automaten \"traf\". Als Hintergrund: Remington Rand ist eine Firma, die 1950 die Eckert–Mauchly Computer Corporation gekauft hat und zusammen mit Eckert und Mauchly Maschinen der Art Univac entwickelt und zum Verkauf angeboten hat. Die Firma besaß später eine Abteilung mit dem Namen Univac.",
        "<sup class=\"footnote-ref\" data-footnote-id=\"1.3\">1.3</sup> 100 dänischer Kronen im Jahre 1960 entsprechen etwa 1550 dänischer Kronen im Jahre 2024. Der Wert der Maschinen betrüge sich daher heute auf jeweils etwa 15-50 Millionen dänischer Kronen oder ca. 2-7 Millionen Euro."
      ]
    }
  ],
  "footnotes": [
    {
      "id": "1.1",
      "danish": "Princippet at lagre programmet for løsningen af en opgave i datamatens almindelige indre lager bør efter hvad Maurice Wilkes i 1967 oplyser i sin ACM \"Turing Lecture rettelig tilskrives Eckert og Mauchly, fædrene til den første elektroniske regnemaskine.",
      "german": "Anmerkung von Naur zum Text (verlinkt in Kapitel 1.1 und 4.2): Das Prinzip, das Programm zur Lösung einer Aufgabe in einem allgemeinen internen Speicher der Datenmaschine zu speichern, sollte, so Maurice Wilkes 1967 in seiner ACM Turing Lecture, zu Recht Eckert und Mauchly, den Vätern der ersten elektronischen Rechenmaschine, zugeschrieben werden."
    },
    {
      "id": "1.2",
      "danish": "Sinngemäße Beschreibung. Im Original wird gesagt, dass sich die Firma mit dem Automaten \"traf\". Als Hintergrund: Remington Rand ist eine Firma, die 1950 die Eckert–Mauchly Computer Corporation gekauft hat und zusammen mit Eckert und Mauchly Maschinen der Art Univac entwickelt und zum Verkauf angeboten hat. Die Firma besaß später eine Abteilung mit dem Namen Univac.",
      "german": "Sinngemäße Beschreibung. Im Original wird gesagt, dass sich die Firma mit dem Automaten \"traf\". Als Hintergrund: Remington Rand ist eine Firma, die 1950 die Eckert–Mauchly Computer Corporation gekauft hat und zusammen mit Eckert und Mauchly Maschinen der Art Univac entwickelt und zum Verkauf angeboten hat. Die Firma besaß später eine Abteilung mit dem Namen Univac."
    },
    {
      "id": "1.3",
      "danish": "100 dänischer Kronen im Jahre 1960 entsprechen etwa 1550 dänischer Kronen im Jahre 2024. Der Wert der Maschinen betrüge sich daher heute auf jeweils etwa 15-50 Millionen dänischer Kronen oder ca. 2-7 Millionen Euro.",
      "german": "100 dänischer Kronen im Jahre 1960 entsprechen etwa 1550 dänischer Kronen im Jahre 2024. Der Wert der Maschinen betrüge sich daher heute auf jeweils etwa 15-50 Millionen dänischer Kronen oder ca. 2-7 Millionen Euro."
    },
    {
      "id": "1.4",
      "danish": "Geglättete Übersetzung. Naur spricht hier bildlich von einem Strecken in die Umgebung der Lösung. Gemeint ist wohl die Fertigstellung der &bdquo;korrekten&ldquo; (also vom Nutzer eigentlich gewünschten) Berechnung &ndash; im Gegensatz zur Lösung, die durch die Programmierung erreicht wird und die von der Datenmaschine korrekt bzw. folgerichtig mit den Anweisungen ausgerechnet wird.",
      "german": "Geglättete Übersetzung. Naur spricht hier bildlich von einem Strecken in die Umgebung der Lösung. Gemeint ist wohl die Fertigstellung der &bdquo;korrekten&ldquo; (also vom Nutzer eigentlich gewünschten) Berechnung &ndash; im Gegensatz zur Lösung, die durch die Programmierung erreicht wird und die von der Datenmaschine korrekt bzw. folgerichtig mit den Anweisungen ausgerechnet wird."
    },
    {
      "id": "1.5",
      "danish": "Stark geglättete Übersetzung. Naur versucht hier, das Konzept höherer Programmiersprachen mit Elementen wie Syntaxanalyse und Compilern einzuführen. Eine wörtlichere Übersetzung des Abschnittes lautet: Die  allgemein anwendbare Lösung des Problems der Kommunikation zwischen Mensch und Datenautomat besteht darin, den Datenautomaten auf den Menschen treffen zu lassen, indem man ihn mit der stets komplizierteren Aufgabe der Analyse und Umwandlung menschlicher Äußerungen beauftragt.",
      "german": "Stark geglättete Übersetzung. Naur versucht hier, das Konzept höherer Programmiersprachen mit Elementen wie Syntaxanalyse und Compilern einzuführen. Eine wörtlichere Übersetzung des Abschnittes lautet: Die  allgemein anwendbare Lösung des Problems der Kommunikation zwischen Mensch und Datenautomat besteht darin, den Datenautomaten auf den Menschen treffen zu lassen, indem man ihn mit der stets komplizierteren Aufgabe der Analyse und Umwandlung menschlicher Äußerungen beauftragt."
    },
    {
      "id": "1.6",
      "danish": "Geglättete Übersetzung. Naur spricht hier bildlich von \"Fahrten mit begrenzter Dauer\".",
      "german": "Geglättete Übersetzung. Naur spricht hier bildlich von \"Fahrten mit begrenzter Dauer\"."
    },
    {
      "id": "1.7",
      "danish": "Man beachte, dass der Text 1967 erschien und das Patent auf die erste Computermaus (&bdquo;X-Y-Positions-Anzeiger für ein Bildschirmsystem&ldquo;) erst 1970 für den Erfinder Douglas C. Engelbart genehmigt wurde.",
      "german": "Man beachte, dass der Text 1967 erschien und das Patent auf die erste Computermaus (&bdquo;X-Y-Positions-Anzeiger für ein Bildschirmsystem&ldquo;) erst 1970 für den Erfinder Douglas C. Engelbart genehmigt wurde."
    },
    {
      "id": "1.8",
      "danish": "Gemeint ist Dänemark, das Heimatland des Autors und Austragungsort der Vorlesung.",
      "german": "Gemeint ist Dänemark, das Heimatland des Autors und Austragungsort der Vorlesung."
    },
    {
      "id": "1.9",
      "danish": "Im Original &bdquo;Akademiet for de tekniske Videnskaber&ldquo;, abgekürzt ATV.",
      "german": "Im Original &bdquo;Akademiet for de tekniske Videnskaber&ldquo;, abgekürzt ATV."
    },
    {
      "id": "1.10",
      "danish": "Aus dem Original geht nicht hervor, ob es sich bei diesem Betrag um dänische oder schwedische Kronen handelt. Die Größenordnungen sind aber vergleichbar: 1 Euro entspricht 2025 etwa 7,46 dänischer und 10,90 schwedischer Kronen. 2 Millionen 1947-SEK entsprächen heute etwa 50,5 Millionen 2024-SEK (ca. 4,6 Millionen 2025-Euro) &ndash; 2 Millionen 1947-DDK entsprächen heute etwa 48,9 Millionen 2024-DKK (ca. 6,6 Millionen 2025-Euro).",
      "german": "Aus dem Original geht nicht hervor, ob es sich bei diesem Betrag um dänische oder schwedische Kronen handelt. Die Größenordnungen sind aber vergleichbar: 1 Euro entspricht 2025 etwa 7,46 dänischer und 10,90 schwedischer Kronen. 2 Millionen 1947-SEK entsprächen heute etwa 50,5 Millionen 2024-SEK (ca. 4,6 Millionen 2025-Euro) &ndash; 2 Millionen 1947-DDK entsprächen heute etwa 48,9 Millionen 2024-DKK (ca. 6,6 Millionen 2025-Euro)."
    },
    {
      "id": "1.11",
      "danish": "Das mittlerweile nicht mehr existierende Mathematikmaschineninstitut in Stockholm hieß im schwedischen Original &bdquo;Matematikmaskinnämnden&ldquo;.",
      "german": "Das mittlerweile nicht mehr existierende Mathematikmaschineninstitut in Stockholm hieß im schwedischen Original &bdquo;Matematikmaskinnämnden&ldquo;."
    },
    {
      "id": "1.12",
      "danish": "Der mittlerweile nicht mehr existierende Verteidigungsforschungsrat war zur Zeit des kalten Krieges ein Teil der dänischen Streitkräfte und hieß im dänsichen Original &bdquo;Forsvarets Forskningsråd&ldquo;.",
      "german": "Der mittlerweile nicht mehr existierende Verteidigungsforschungsrat war zur Zeit des kalten Krieges ein Teil der dänischen Streitkräfte und hieß im dänsichen Original &bdquo;Forsvarets Forskningsråd&ldquo;."
    },
    {
      "id": "1.13",
      "danish": "Im dänischen Original &bdquo;militære counterpart-bevilling&ldquo;, eine Kostenstelle Dänemarks im kalten Krieg.",
      "german": "Im dänischen Original &bdquo;militære counterpart-bevilling&ldquo;, eine Kostenstelle Dänemarks im kalten Krieg."
    },
    {
      "id": "1.14",
      "danish": "Regnecentralen (Aussprache mit deuscher Lautschrift etwa: Reinezentralen); übersetzt Rechenzentrale oder (sinngemäß) Rechenzentrum. Das Regnecentralen Institut an der Akademie für technische Wissenschaften wurde 1952 gegründet und 1955 mit Geldern aus dem Marshallplan in eine Aktiongesellschaft umgewandelt. Der Name wurde dabei beibehalten. Bekannt wurde die Firma durch den Verkauf von Lochstreifenlesern. Nach wirtschaftlichen Problemen wurde sie 1989 von der britischen firma International Computers Limited übernommen, die 2002 von der japanischen Firma Fujitsu übernommen wurde. Der Name Regnecentralen wurde aber bereits seit 1993 nicht mehr benutzt.",
      "german": "Regnecentralen (Aussprache mit deuscher Lautschrift etwa: Reinezentralen); übersetzt Rechenzentrale oder (sinngemäß) Rechenzentrum. Das Regnecentralen Institut an der Akademie für technische Wissenschaften wurde 1952 gegründet und 1955 mit Geldern aus dem Marshallplan in eine Aktiongesellschaft umgewandelt. Der Name wurde dabei beibehalten. Bekannt wurde die Firma durch den Verkauf von Lochstreifenlesern. Nach wirtschaftlichen Problemen wurde sie 1989 von der britischen firma International Computers Limited übernommen, die 2002 von der japanischen Firma Fujitsu übernommen wurde. Der Name Regnecentralen wurde aber bereits seit 1993 nicht mehr benutzt."
    },
    {
      "id": "1.15",
      "danish": "Die dänischen Regionen (im Original &bdquo;staten&ldquo;) sind vergleichbar mit den deutschen Bundesländern und stellen die (einzige) Zwischenstufe zwischen der dänischen Zentralverwaltung und den dänischen Kommunen dar.",
      "german": "Die dänischen Regionen (im Original &bdquo;staten&ldquo;) sind vergleichbar mit den deutschen Bundesländern und stellen die (einzige) Zwischenstufe zwischen der dänischen Zentralverwaltung und den dänischen Kommunen dar."
    },
    {
      "id": "2.1",
      "danish": "Vergleiche die Wort-für-Wort Definition des dänischen Original im Glossar.",
      "german": "Vergleiche die Wort-für-Wort Definition des dänischen Original im Glossar."
    },
    {
      "id": "3.1",
      "danish": "1 Million 1967-DKK entsprechen ca. 10,5 Millionen 2024-DKK (ca. 1,4 Millionen 2024-Euro)",
      "german": "1 Million 1967-DKK entsprechen ca. 10,5 Millionen 2024-DKK (ca. 1,4 Millionen 2024-Euro)"
    },
    {
      "id": "3.2",
      "danish": "Bei Ferritkernen handelt es sich um eine keramische Mischung aus Eisenoxid und anderen Metall- oder Metalloxiden. Diese Materialien werden zu einem Pulver gemahlen, das dann zu einem festen Kern geformt wird und magnetische Eigenschaften (Ferrit-Magnetismus) aufweist. Kernspeicher basierend auf Ferritkernen wurden etwa von 1954 bis 1975 als Speicher in damaligen Computern eingesetzt.",
      "german": "Bei Ferritkernen handelt es sich um eine keramische Mischung aus Eisenoxid und anderen Metall- oder Metalloxiden. Diese Materialien werden zu einem Pulver gemahlen, das dann zu einem festen Kern geformt wird und magnetische Eigenschaften (Ferrit-Magnetismus) aufweist. Kernspeicher basierend auf Ferritkernen wurden etwa von 1954 bis 1975 als Speicher in damaligen Computern eingesetzt."
    },
    {
      "id": "4.1",
      "danish": "Das dänische Wort im Original ist &bdquo;strikkeopskrifter&ldquo;, also wortwörtlich &bdquo;Strickanleitung&ldquo;, weswegen der Vergleich im Original noch besser funktioniert.",
      "german": "Das dänische Wort im Original ist &bdquo;strikkeopskrifter&ldquo;, also wortwörtlich &bdquo;Strickanleitung&ldquo;, weswegen der Vergleich im Original noch besser funktioniert."
    },
    {
      "id": "5.1",
      "danish": "Die &bdquo;Danmarks tekniske Bibliotek&ldquo; war eine Einrichtung in Lyngby, einem Vorort von Kopenhagen. Sie wurde 1995 in &bdquo;Danmarks Tekniske Videncenter og Bibliotek&ldquo; (Dänemarks technisches Videocenter und Bibliothek) und 2008 in &bdquo;Danmarks Tekniske Informationscenter&ldquo; (Dänemarks technisches Informationscenter) umbenannt. Im Jahre 2013 wurde die Einrichtung mit der &bdquo;Ingeniørhøjskolen i København&ldquo; (Ingenieurshochschule in Kopenhagen) zur &bdquo;Danmarks Tekniske Universitet&ldquo; (Dänemarks technischer Univesität) fusioniert.",
      "german": "Die &bdquo;Danmarks tekniske Bibliotek&ldquo; war eine Einrichtung in Lyngby, einem Vorort von Kopenhagen. Sie wurde 1995 in &bdquo;Danmarks Tekniske Videncenter og Bibliotek&ldquo; (Dänemarks technisches Videocenter und Bibliothek) und 2008 in &bdquo;Danmarks Tekniske Informationscenter&ldquo; (Dänemarks technisches Informationscenter) umbenannt. Im Jahre 2013 wurde die Einrichtung mit der &bdquo;Ingeniørhøjskolen i København&ldquo; (Ingenieurshochschule in Kopenhagen) zur &bdquo;Danmarks Tekniske Universitet&ldquo; (Dänemarks technischer Univesität) fusioniert."
    },
    {
      "id": "5.2",
      "danish": "Karen Brixen (1885-1962) war eine dänische Schriftstellerin, die in Deutschland meinst unter ihrem Pseudonym Tania Blixen und in England unter Isak Dinesen bekannt ist. Sie leitete 17 Jahre lang eine Kaffeefarm in Kenia. Internationale Bekanntheit erlangte ihr autobiographisches Werk &bdquo;Den afrikanske farm&ldquo; (wörtlich &bdquo;Die afrikanische Farm&ldquo;, verkauft als &bdquo;Jenseits von Afrika&ldquo;), das im Jahre 1985 vom Regisseur Sydney Pollack unter dem Titel &bdquo;Out of Africa&ldquo; verfilmt wurde.",
      "german": "Karen Brixen (1885-1962) war eine dänische Schriftstellerin, die in Deutschland meinst unter ihrem Pseudonym Tania Blixen und in England unter Isak Dinesen bekannt ist. Sie leitete 17 Jahre lang eine Kaffeefarm in Kenia. Internationale Bekanntheit erlangte ihr autobiographisches Werk &bdquo;Den afrikanske farm&ldquo; (wörtlich &bdquo;Die afrikanische Farm&ldquo;, verkauft als &bdquo;Jenseits von Afrika&ldquo;), das im Jahre 1985 vom Regisseur Sydney Pollack unter dem Titel &bdquo;Out of Africa&ldquo; verfilmt wurde."
    },
    {
      "id": "5.3",
      "danish": "Hierbei handelt es sich um den &bdquo;Treaty Banning Nuclear Weapon Tests in the Atmosphere, in Outer Space and Under Water, August 5, 1963&ldquo;, der am 05.08.1963 von den USA, dem UK, und der UdSSR in Moskau unterzeichnet wurde. Ein analoger Text unter dem Namen &bdquo;Partial Nuclear Test Ban Treaty&ldquo; wurde am 08.08.1963 von der DDR, am 09.08.1963 von Dänemark, und am 19.08.1963 von der BRD unterzeichnet. Der Text ist aus dem Artikel 1b des Vertrages und online verfügbar unter https://avalon.law.yale.edu/20th_century/usmu015.asp. Rechtlich bindend sind für alle Unterzeichner nur die englische und russische Version des Textes.",
      "german": "Hierbei handelt es sich um den &bdquo;Treaty Banning Nuclear Weapon Tests in the Atmosphere, in Outer Space and Under Water, August 5, 1963&ldquo;, der am 05.08.1963 von den USA, dem UK, und der UdSSR in Moskau unterzeichnet wurde. Ein analoger Text unter dem Namen &bdquo;Partial Nuclear Test Ban Treaty&ldquo; wurde am 08.08.1963 von der DDR, am 09.08.1963 von Dänemark, und am 19.08.1963 von der BRD unterzeichnet. Der Text ist aus dem Artikel 1b des Vertrages und online verfügbar unter https://avalon.law.yale.edu/20th_century/usmu015.asp. Rechtlich bindend sind für alle Unterzeichner nur die englische und russische Version des Textes."
    },
    {
      "id": "5.4",
      "danish": "Naur hat im dänischen Original den Satz ins dänische übersetzt. Der Satz lautet auf deutsch, in sprachlich geglättet, etwa: Es wird in diesem Zusammenhang (von allen Beteiligten) verstanden, dass die Bestimmungen in diesem Unterabsatz den Abschluss eines Vertrages nicht ausschließen, der zum Verbot aller Kernwaffentestexplosionen führt, einschließlich unterirdischen Explosionen",
      "german": "Naur hat im dänischen Original den Satz ins dänische übersetzt. Der Satz lautet auf deutsch, in sprachlich geglättet, etwa: Es wird in diesem Zusammenhang (von allen Beteiligten) verstanden, dass die Bestimmungen in diesem Unterabsatz den Abschluss eines Vertrages nicht ausschließen, der zum Verbot aller Kernwaffentestexplosionen führt, einschließlich unterirdischen Explosionen"
    },
    {
      "id": "6.1",
      "danish": "In den 1960er Jahren gab es zahlreiche Kontroversen bzgl. der Datenhaltung in dänischen Verwaltungen. So kamen die Nationalsozialisten (insb. GeStaPo und SS) zum Beispiel über das Archiv der jüdischen Gemeinde Dänemarks an Namen und Adressen fast aller Juden in Dänemark. Über zentralisierte Daten über politische Straftäter der dänischen Polizei erfuhr man (z.T. bereits vor der Invasion Dänemarks durch Nazideutschland) von der kommunistischen Gesinnung zahlreicher dänischer Staatsbürger. Während viele Juden in einer einmaligen Aktion nach Schweden gerettet werden konnten, wurden bereits sehr früh hunderte hochrangige dänische Kommunisten verhaftet. Weitere historische Informationen sind für geschichtsinteressierte Leser unter anderem im Buch mit der ISBN 3896675109 und in folgendem Journalbeitrag zu finden: https://www.tandfonline.com/doi/full/10.1080/02684527.2021.1976919#d1e341.",
      "german": "In den 1960er Jahren gab es zahlreiche Kontroversen bzgl. der Datenhaltung in dänischen Verwaltungen. So kamen die Nationalsozialisten (insb. GeStaPo und SS) zum Beispiel über das Archiv der jüdischen Gemeinde Dänemarks an Namen und Adressen fast aller Juden in Dänemark. Über zentralisierte Daten über politische Straftäter der dänischen Polizei erfuhr man (z.T. bereits vor der Invasion Dänemarks durch Nazideutschland) von der kommunistischen Gesinnung zahlreicher dänischer Staatsbürger. Während viele Juden in einer einmaligen Aktion nach Schweden gerettet werden konnten, wurden bereits sehr früh hunderte hochrangige dänische Kommunisten verhaftet. Weitere historische Informationen sind für geschichtsinteressierte Leser unter anderem im Buch mit der ISBN 3896675109 und in folgendem Journalbeitrag zu finden: https://www.tandfonline.com/doi/full/10.1080/02684527.2021.1976919#d1e341."
    },
    {
      "id": "6.2",
      "danish": "600 Millionen 1967-DKK entsprechen ca. 10,4 Millionen 2024-DKK (ca. 1,4 Millionen 2024-Euro).",
      "german": "600 Millionen 1967-DKK entsprechen ca. 10,4 Millionen 2024-DKK (ca. 1,4 Millionen 2024-Euro)."
    },
    {
      "id": "6.3",
      "danish": "Auch hier ist wird aus dem Original nicht klar, ob es sich um dänische oder norwegische Kronen handelt. Auch hier sind die Größenordnungen jedoch vergleichbar. 50 Millionen 1967-DKK entsprächen etwa 520 Millionen 2024-DKK (ca. 69 Millionen 2024-Euro). In norwegischen Kronen entsprächen 50 Millionen 1967-NOK etwa 612 Millionen 2024-NOK (ca. 52 Millionen 2024-Euro).",
      "german": "Auch hier ist wird aus dem Original nicht klar, ob es sich um dänische oder norwegische Kronen handelt. Auch hier sind die Größenordnungen jedoch vergleichbar. 50 Millionen 1967-DKK entsprächen etwa 520 Millionen 2024-DKK (ca. 69 Millionen 2024-Euro). In norwegischen Kronen entsprächen 50 Millionen 1967-NOK etwa 612 Millionen 2024-NOK (ca. 52 Millionen 2024-Euro)."
    }
  ]
}
